      ****************************************************************  
      * COPYBOOK: ADDONTBL                                           *  
      * RURAL ADD ON BY STATE & COUNTY CODE                          *  
      *--------------------------------------------------------------*  
      * CATEGORY                    CY2019 CY2020 CY2021 CY2022      *  
      * (A) HIGH UTILIZATION         1.5%   0.5%   ----   ----       *  
      * (B) LOW POPULATION DENSITY   4.0%   3.0%   2.0%   1.0%       *  
      * (C) ALL OTHER                3.0%   2.0%   1.0%   ----       *  
      ****************************************************************  
       01 T-STATE-COUNTY-CODES.                                         
           05  T-STATE-COUNTY-CODE-DATA.                                
               10  FILLER            PIC X(6) VALUE '01005A'.           
               10  FILLER            PIC X(6) VALUE '01011A'.           
               10  FILLER            PIC X(6) VALUE '01013A'.           
               10  FILLER            PIC X(6) VALUE '01017C'.           
               10  FILLER            PIC X(6) VALUE '01019A'.           
               10  FILLER            PIC X(6) VALUE '01023A'.           
               10  FILLER            PIC X(6) VALUE '01025A'.           
               10  FILLER            PIC X(6) VALUE '01027C'.           
               10  FILLER            PIC X(6) VALUE '01029A'.           
               10  FILLER            PIC X(6) VALUE '01031A'.           
               10  FILLER            PIC X(6) VALUE '01035A'.           
               10  FILLER            PIC X(6) VALUE '01037C'.           
               10  FILLER            PIC X(6) VALUE '01039A'.           
               10  FILLER            PIC X(6) VALUE '01041A'.           
               10  FILLER            PIC X(6) VALUE '01043A'.           
               10  FILLER            PIC X(6) VALUE '01045A'.           
               10  FILLER            PIC X(6) VALUE '01047C'.           
               10  FILLER            PIC X(6) VALUE '01049A'.           
               10  FILLER            PIC X(6) VALUE '01053A'.           
               10  FILLER            PIC X(6) VALUE '01057A'.           
               10  FILLER            PIC X(6) VALUE '01059A'.           
               10  FILLER            PIC X(6) VALUE '01063A'.           
               10  FILLER            PIC X(6) VALUE '01071A'.           
               10  FILLER            PIC X(6) VALUE '01075A'.           
               10  FILLER            PIC X(6) VALUE '01087C'.           
               10  FILLER            PIC X(6) VALUE '01091A'.           
               10  FILLER            PIC X(6) VALUE '01093A'.           
               10  FILLER            PIC X(6) VALUE '01095A'.           
               10  FILLER            PIC X(6) VALUE '01099A'.           
               10  FILLER            PIC X(6) VALUE '01105A'.           
               10  FILLER            PIC X(6) VALUE '01109A'.           
               10  FILLER            PIC X(6) VALUE '01111C'.           
               10  FILLER            PIC X(6) VALUE '01119A'.           
               10  FILLER            PIC X(6) VALUE '01121C'.           
               10  FILLER            PIC X(6) VALUE '01123A'.           
               10  FILLER            PIC X(6) VALUE '01127A'.           
               10  FILLER            PIC X(6) VALUE '01129A'.           
               10  FILLER            PIC X(6) VALUE '01131A'.           
               10  FILLER            PIC X(6) VALUE '01133A'.           
               10  FILLER            PIC X(6) VALUE '02013B'.           
               10  FILLER            PIC X(6) VALUE '02016B'.           
               10  FILLER            PIC X(6) VALUE '02050B'.           
               10  FILLER            PIC X(6) VALUE '02060B'.           
               10  FILLER            PIC X(6) VALUE '02068B'.           
               10  FILLER            PIC X(6) VALUE '02070B'.           
               10  FILLER            PIC X(6) VALUE '02100B'.           
               10  FILLER            PIC X(6) VALUE '02105B'.           
               10  FILLER            PIC X(6) VALUE '02110C'.           
               10  FILLER            PIC X(6) VALUE '02122B'.           
               10  FILLER            PIC X(6) VALUE '02130B'.           
               10  FILLER            PIC X(6) VALUE '02150B'.           
               10  FILLER            PIC X(6) VALUE '02164B'.           
               10  FILLER            PIC X(6) VALUE '02180B'.           
               10  FILLER            PIC X(6) VALUE '02185B'.           
               10  FILLER            PIC X(6) VALUE '02188B'.           
               10  FILLER            PIC X(6) VALUE '02195B'.           
               10  FILLER            PIC X(6) VALUE '02198B'.           
               10  FILLER            PIC X(6) VALUE '02220B'.           
               10  FILLER            PIC X(6) VALUE '02230B'.           
               10  FILLER            PIC X(6) VALUE '02240B'.           
               10  FILLER            PIC X(6) VALUE '02261B'.           
               10  FILLER            PIC X(6) VALUE '02270B'.           
               10  FILLER            PIC X(6) VALUE '02275B'.           
               10  FILLER            PIC X(6) VALUE '02282B'.           
               10  FILLER            PIC X(6) VALUE '02290B'.           
               10  FILLER            PIC X(6) VALUE '04001C'.           
               10  FILLER            PIC X(6) VALUE '04007C'.           
               10  FILLER            PIC X(6) VALUE '04009C'.           
               10  FILLER            PIC X(6) VALUE '04011B'.           
               10  FILLER            PIC X(6) VALUE '04012B'.           
               10  FILLER            PIC X(6) VALUE '04017C'.           
               10  FILLER            PIC X(6) VALUE '04023C'.           
               10  FILLER            PIC X(6) VALUE '05001C'.           
               10  FILLER            PIC X(6) VALUE '05003C'.           
               10  FILLER            PIC X(6) VALUE '05005C'.           
               10  FILLER            PIC X(6) VALUE '05009C'.           
               10  FILLER            PIC X(6) VALUE '05011A'.           
               10  FILLER            PIC X(6) VALUE '05013A'.           
               10  FILLER            PIC X(6) VALUE '05015C'.           
               10  FILLER            PIC X(6) VALUE '05017C'.           
               10  FILLER            PIC X(6) VALUE '05019C'.           
               10  FILLER            PIC X(6) VALUE '05021C'.           
               10  FILLER            PIC X(6) VALUE '05023C'.           
               10  FILLER            PIC X(6) VALUE '05027C'.           
               10  FILLER            PIC X(6) VALUE '05029C'.           
               10  FILLER            PIC X(6) VALUE '05037A'.           
               10  FILLER            PIC X(6) VALUE '05039A'.           
               10  FILLER            PIC X(6) VALUE '05041A'.           
               10  FILLER            PIC X(6) VALUE '05043A'.           
               10  FILLER            PIC X(6) VALUE '05047C'.           
               10  FILLER            PIC X(6) VALUE '05049A'.           
               10  FILLER            PIC X(6) VALUE '05055C'.           
               10  FILLER            PIC X(6) VALUE '05057A'.           
               10  FILLER            PIC X(6) VALUE '05059C'.           
               10  FILLER            PIC X(6) VALUE '05061A'.           
               10  FILLER            PIC X(6) VALUE '05063A'.           
               10  FILLER            PIC X(6) VALUE '05065A'.           
               10  FILLER            PIC X(6) VALUE '05067C'.           
               10  FILLER            PIC X(6) VALUE '05071C'.           
               10  FILLER            PIC X(6) VALUE '05073A'.           
               10  FILLER            PIC X(6) VALUE '05075C'.           
               10  FILLER            PIC X(6) VALUE '05077A'.           
               10  FILLER            PIC X(6) VALUE '05083C'.           
               10  FILLER            PIC X(6) VALUE '05089C'.           
               10  FILLER            PIC X(6) VALUE '05093C'.           
               10  FILLER            PIC X(6) VALUE '05095C'.           
               10  FILLER            PIC X(6) VALUE '05097C'.           
               10  FILLER            PIC X(6) VALUE '05099C'.           
               10  FILLER            PIC X(6) VALUE '05101C'.           
               10  FILLER            PIC X(6) VALUE '05103C'.           
               10  FILLER            PIC X(6) VALUE '05107A'.           
               10  FILLER            PIC X(6) VALUE '05109C'.           
               10  FILLER            PIC X(6) VALUE '05113A'.           
               10  FILLER            PIC X(6) VALUE '05115C'.           
               10  FILLER            PIC X(6) VALUE '05117C'.           
               10  FILLER            PIC X(6) VALUE '05121A'.           
               10  FILLER            PIC X(6) VALUE '05123C'.           
               10  FILLER            PIC X(6) VALUE '05127C'.           
               10  FILLER            PIC X(6) VALUE '05129A'.           
               10  FILLER            PIC X(6) VALUE '05133A'.           
               10  FILLER            PIC X(6) VALUE '05135A'.           
               10  FILLER            PIC X(6) VALUE '05137A'.           
               10  FILLER            PIC X(6) VALUE '05139C'.           
               10  FILLER            PIC X(6) VALUE '05141A'.           
               10  FILLER            PIC X(6) VALUE '05145C'.           
               10  FILLER            PIC X(6) VALUE '05147A'.           
               10  FILLER            PIC X(6) VALUE '05149C'.           
               10  FILLER            PIC X(6) VALUE '06003B'.           
               10  FILLER            PIC X(6) VALUE '06005C'.           
               10  FILLER            PIC X(6) VALUE '06009C'.           
               10  FILLER            PIC X(6) VALUE '06011C'.           
               10  FILLER            PIC X(6) VALUE '06015C'.           
               10  FILLER            PIC X(6) VALUE '06021C'.           
               10  FILLER            PIC X(6) VALUE '06023C'.           
               10  FILLER            PIC X(6) VALUE '06027B'.           
               10  FILLER            PIC X(6) VALUE '06033C'.           
               10  FILLER            PIC X(6) VALUE '06035C'.           
               10  FILLER            PIC X(6) VALUE '06043C'.           
               10  FILLER            PIC X(6) VALUE '06045C'.           
               10  FILLER            PIC X(6) VALUE '06049B'.           
               10  FILLER            PIC X(6) VALUE '06051B'.           
               10  FILLER            PIC X(6) VALUE '06057C'.           
               10  FILLER            PIC X(6) VALUE '06063C'.           
               10  FILLER            PIC X(6) VALUE '06091B'.           
               10  FILLER            PIC X(6) VALUE '06093C'.           
               10  FILLER            PIC X(6) VALUE '06103C'.           
               10  FILLER            PIC X(6) VALUE '06105B'.           
               10  FILLER            PIC X(6) VALUE '06109C'.           
               10  FILLER            PIC X(6) VALUE '08003C'.           
               10  FILLER            PIC X(6) VALUE '08007C'.           
               10  FILLER            PIC X(6) VALUE '08009B'.           
               10  FILLER            PIC X(6) VALUE '08011B'.           
               10  FILLER            PIC X(6) VALUE '08015C'.           
               10  FILLER            PIC X(6) VALUE '08017B'.           
               10  FILLER            PIC X(6) VALUE '08021C'.           
               10  FILLER            PIC X(6) VALUE '08023B'.           
               10  FILLER            PIC X(6) VALUE '08025C'.           
               10  FILLER            PIC X(6) VALUE '08027B'.           
               10  FILLER            PIC X(6) VALUE '08029C'.           
               10  FILLER            PIC X(6) VALUE '08033B'.           
               10  FILLER            PIC X(6) VALUE '08037C'.           
               10  FILLER            PIC X(6) VALUE '08043C'.           
               10  FILLER            PIC X(6) VALUE '08045C'.           
               10  FILLER            PIC X(6) VALUE '08049C'.           
               10  FILLER            PIC X(6) VALUE '08051B'.           
               10  FILLER            PIC X(6) VALUE '08053B'.           
               10  FILLER            PIC X(6) VALUE '08055B'.           
               10  FILLER            PIC X(6) VALUE '08057B'.           
               10  FILLER            PIC X(6) VALUE '08061B'.           
               10  FILLER            PIC X(6) VALUE '08063B'.           
               10  FILLER            PIC X(6) VALUE '08065C'.           
               10  FILLER            PIC X(6) VALUE '08067C'.           
               10  FILLER            PIC X(6) VALUE '08071B'.           
               10  FILLER            PIC X(6) VALUE '08073B'.           
               10  FILLER            PIC X(6) VALUE '08075C'.           
               10  FILLER            PIC X(6) VALUE '08079B'.           
               10  FILLER            PIC X(6) VALUE '08081B'.           
               10  FILLER            PIC X(6) VALUE '08083C'.           
               10  FILLER            PIC X(6) VALUE '08085C'.           
               10  FILLER            PIC X(6) VALUE '08087C'.           
               10  FILLER            PIC X(6) VALUE '08089C'.           
               10  FILLER            PIC X(6) VALUE '08091C'.           
               10  FILLER            PIC X(6) VALUE '08095C'.           
               10  FILLER            PIC X(6) VALUE '08097C'.           
               10  FILLER            PIC X(6) VALUE '08099C'.           
               10  FILLER            PIC X(6) VALUE '08103B'.           
               10  FILLER            PIC X(6) VALUE '08105C'.           
               10  FILLER            PIC X(6) VALUE '08107C'.           
               10  FILLER            PIC X(6) VALUE '08109B'.           
               10  FILLER            PIC X(6) VALUE '08111B'.           
               10  FILLER            PIC X(6) VALUE '08113B'.           
               10  FILLER            PIC X(6) VALUE '08115B'.           
               10  FILLER            PIC X(6) VALUE '08117C'.           
               10  FILLER            PIC X(6) VALUE '08121B'.           
               10  FILLER            PIC X(6) VALUE '08125B'.           
               10  FILLER            PIC X(6) VALUE '09005A'.           
               10  FILLER            PIC X(6) VALUE '12007A'.           
               10  FILLER            PIC X(6) VALUE '12013C'.           
               10  FILLER            PIC X(6) VALUE '12023A'.           
               10  FILLER            PIC X(6) VALUE '12027A'.           
               10  FILLER            PIC X(6) VALUE '12029A'.           
               10  FILLER            PIC X(6) VALUE '12037C'.           
               10  FILLER            PIC X(6) VALUE '12043A'.           
               10  FILLER            PIC X(6) VALUE '12045A'.           
               10  FILLER            PIC X(6) VALUE '12047A'.           
               10  FILLER            PIC X(6) VALUE '12049A'.           
               10  FILLER            PIC X(6) VALUE '12051A'.           
               10  FILLER            PIC X(6) VALUE '12059A'.           
               10  FILLER            PIC X(6) VALUE '12063C'.           
               10  FILLER            PIC X(6) VALUE '12067A'.           
               10  FILLER            PIC X(6) VALUE '12075A'.           
               10  FILLER            PIC X(6) VALUE '12077A'.           
               10  FILLER            PIC X(6) VALUE '12079C'.           
               10  FILLER            PIC X(6) VALUE '12087C'.           
               10  FILLER            PIC X(6) VALUE '12093A'.           
               10  FILLER            PIC X(6) VALUE '12107A'.           
               10  FILLER            PIC X(6) VALUE '12121A'.           
               10  FILLER            PIC X(6) VALUE '12123C'.           
               10  FILLER            PIC X(6) VALUE '12125A'.           
               10  FILLER            PIC X(6) VALUE '12133C'.           
               10  FILLER            PIC X(6) VALUE '13001C'.           
               10  FILLER            PIC X(6) VALUE '13003C'.           
               10  FILLER            PIC X(6) VALUE '13005A'.           
               10  FILLER            PIC X(6) VALUE '13007A'.           
               10  FILLER            PIC X(6) VALUE '13009C'.           
               10  FILLER            PIC X(6) VALUE '13011C'.           
               10  FILLER            PIC X(6) VALUE '13017C'.           
               10  FILLER            PIC X(6) VALUE '13019A'.           
               10  FILLER            PIC X(6) VALUE '13023C'.           
               10  FILLER            PIC X(6) VALUE '13031C'.           
               10  FILLER            PIC X(6) VALUE '13037C'.           
               10  FILLER            PIC X(6) VALUE '13039C'.           
               10  FILLER            PIC X(6) VALUE '13043C'.           
               10  FILLER            PIC X(6) VALUE '13049C'.           
               10  FILLER            PIC X(6) VALUE '13055A'.           
               10  FILLER            PIC X(6) VALUE '13061C'.           
               10  FILLER            PIC X(6) VALUE '13065A'.           
               10  FILLER            PIC X(6) VALUE '13069C'.           
               10  FILLER            PIC X(6) VALUE '13071C'.           
               10  FILLER            PIC X(6) VALUE '13075A'.           
               10  FILLER            PIC X(6) VALUE '13081C'.           
               10  FILLER            PIC X(6) VALUE '13087C'.           
               10  FILLER            PIC X(6) VALUE '13091A'.           
               10  FILLER            PIC X(6) VALUE '13093C'.           
               10  FILLER            PIC X(6) VALUE '13099A'.           
               10  FILLER            PIC X(6) VALUE '13105C'.           
               10  FILLER            PIC X(6) VALUE '13107C'.           
               10  FILLER            PIC X(6) VALUE '13109C'.           
               10  FILLER            PIC X(6) VALUE '13111C'.           
               10  FILLER            PIC X(6) VALUE '13119A'.           
               10  FILLER            PIC X(6) VALUE '13123C'.           
               10  FILLER            PIC X(6) VALUE '13125C'.           
               10  FILLER            PIC X(6) VALUE '13129C'.           
               10  FILLER            PIC X(6) VALUE '13131C'.           
               10  FILLER            PIC X(6) VALUE '13133C'.           
               10  FILLER            PIC X(6) VALUE '13137C'.           
               10  FILLER            PIC X(6) VALUE '13141C'.           
               10  FILLER            PIC X(6) VALUE '13147C'.           
               10  FILLER            PIC X(6) VALUE '13155C'.           
               10  FILLER            PIC X(6) VALUE '13157C'.           
               10  FILLER            PIC X(6) VALUE '13161C'.           
               10  FILLER            PIC X(6) VALUE '13163C'.           
               10  FILLER            PIC X(6) VALUE '13165C'.           
               10  FILLER            PIC X(6) VALUE '13167C'.           
               10  FILLER            PIC X(6) VALUE '13175C'.           
               10  FILLER            PIC X(6) VALUE '13187C'.           
               10  FILLER            PIC X(6) VALUE '13193C'.           
               10  FILLER            PIC X(6) VALUE '13201C'.           
               10  FILLER            PIC X(6) VALUE '13205C'.           
               10  FILLER            PIC X(6) VALUE '13209C'.           
               10  FILLER            PIC X(6) VALUE '13229C'.           
               10  FILLER            PIC X(6) VALUE '13233A'.           
               10  FILLER            PIC X(6) VALUE '13235A'.           
               10  FILLER            PIC X(6) VALUE '13237C'.           
               10  FILLER            PIC X(6) VALUE '13239C'.           
               10  FILLER            PIC X(6) VALUE '13241C'.           
               10  FILLER            PIC X(6) VALUE '13243C'.           
               10  FILLER            PIC X(6) VALUE '13249C'.           
               10  FILLER            PIC X(6) VALUE '13251C'.           
               10  FILLER            PIC X(6) VALUE '13253C'.           
               10  FILLER            PIC X(6) VALUE '13257A'.           
               10  FILLER            PIC X(6) VALUE '13259A'.           
               10  FILLER            PIC X(6) VALUE '13261C'.           
               10  FILLER            PIC X(6) VALUE '13263C'.           
               10  FILLER            PIC X(6) VALUE '13265C'.           
               10  FILLER            PIC X(6) VALUE '13267C'.           
               10  FILLER            PIC X(6) VALUE '13269C'.           
               10  FILLER            PIC X(6) VALUE '13271A'.           
               10  FILLER            PIC X(6) VALUE '13275C'.           
               10  FILLER            PIC X(6) VALUE '13277C'.           
               10  FILLER            PIC X(6) VALUE '13279C'.           
               10  FILLER            PIC X(6) VALUE '13281C'.           
               10  FILLER            PIC X(6) VALUE '13283C'.           
               10  FILLER            PIC X(6) VALUE '13285C'.           
               10  FILLER            PIC X(6) VALUE '13287A'.           
               10  FILLER            PIC X(6) VALUE '13291C'.           
               10  FILLER            PIC X(6) VALUE '13293C'.           
               10  FILLER            PIC X(6) VALUE '13299C'.           
               10  FILLER            PIC X(6) VALUE '13301C'.           
               10  FILLER            PIC X(6) VALUE '13303C'.           
               10  FILLER            PIC X(6) VALUE '13305C'.           
               10  FILLER            PIC X(6) VALUE '13307C'.           
               10  FILLER            PIC X(6) VALUE '13309C'.           
               10  FILLER            PIC X(6) VALUE '13311C'.           
               10  FILLER            PIC X(6) VALUE '13315A'.           
               10  FILLER            PIC X(6) VALUE '13317C'.           
               10  FILLER            PIC X(6) VALUE '13319C'.           
               10  FILLER            PIC X(6) VALUE '15001C'.           
               10  FILLER            PIC X(6) VALUE '15005A'.           
               10  FILLER            PIC X(6) VALUE '15007C'.           
               10  FILLER            PIC X(6) VALUE '16003B'.           
               10  FILLER            PIC X(6) VALUE '16007C'.           
               10  FILLER            PIC X(6) VALUE '16009C'.           
               10  FILLER            PIC X(6) VALUE '16011C'.           
               10  FILLER            PIC X(6) VALUE '16013C'.           
               10  FILLER            PIC X(6) VALUE '16017C'.           
               10  FILLER            PIC X(6) VALUE '16021C'.           
               10  FILLER            PIC X(6) VALUE '16025B'.           
               10  FILLER            PIC X(6) VALUE '16029B'.           
               10  FILLER            PIC X(6) VALUE '16031C'.           
               10  FILLER            PIC X(6) VALUE '16033B'.           
               10  FILLER            PIC X(6) VALUE '16035B'.           
               10  FILLER            PIC X(6) VALUE '16037B'.           
               10  FILLER            PIC X(6) VALUE '16039C'.           
               10  FILLER            PIC X(6) VALUE '16043C'.           
               10  FILLER            PIC X(6) VALUE '16047A'.           
               10  FILLER            PIC X(6) VALUE '16049B'.           
               10  FILLER            PIC X(6) VALUE '16057C'.           
               10  FILLER            PIC X(6) VALUE '16059B'.           
               10  FILLER            PIC X(6) VALUE '16061C'.           
               10  FILLER            PIC X(6) VALUE '16063B'.           
               10  FILLER            PIC X(6) VALUE '16065C'.           
               10  FILLER            PIC X(6) VALUE '16067C'.           
               10  FILLER            PIC X(6) VALUE '16071B'.           
               10  FILLER            PIC X(6) VALUE '16075C'.           
               10  FILLER            PIC X(6) VALUE '16077A'.           
               10  FILLER            PIC X(6) VALUE '16079B'.           
               10  FILLER            PIC X(6) VALUE '16081C'.           
               10  FILLER            PIC X(6) VALUE '16085B'.           
               10  FILLER            PIC X(6) VALUE '16087C'.           
               10  FILLER            PIC X(6) VALUE '17001C'.           
               10  FILLER            PIC X(6) VALUE '17009C'.           
               10  FILLER            PIC X(6) VALUE '17011C'.           
               10  FILLER            PIC X(6) VALUE '17015C'.           
               10  FILLER            PIC X(6) VALUE '17017C'.           
               10  FILLER            PIC X(6) VALUE '17021C'.           
               10  FILLER            PIC X(6) VALUE '17023C'.           
               10  FILLER            PIC X(6) VALUE '17025C'.           
               10  FILLER            PIC X(6) VALUE '17029C'.           
               10  FILLER            PIC X(6) VALUE '17033C'.           
               10  FILLER            PIC X(6) VALUE '17035C'.           
               10  FILLER            PIC X(6) VALUE '17039A'.           
               10  FILLER            PIC X(6) VALUE '17041C'.           
               10  FILLER            PIC X(6) VALUE '17045C'.           
               10  FILLER            PIC X(6) VALUE '17047C'.           
               10  FILLER            PIC X(6) VALUE '17049C'.           
               10  FILLER            PIC X(6) VALUE '17051C'.           
               10  FILLER            PIC X(6) VALUE '17053A'.           
               10  FILLER            PIC X(6) VALUE '17055C'.           
               10  FILLER            PIC X(6) VALUE '17057C'.           
               10  FILLER            PIC X(6) VALUE '17059C'.           
               10  FILLER            PIC X(6) VALUE '17061C'.           
               10  FILLER            PIC X(6) VALUE '17065C'.           
               10  FILLER            PIC X(6) VALUE '17067C'.           
               10  FILLER            PIC X(6) VALUE '17069C'.           
               10  FILLER            PIC X(6) VALUE '17071C'.           
               10  FILLER            PIC X(6) VALUE '17075C'.           
               10  FILLER            PIC X(6) VALUE '17079C'.           
               10  FILLER            PIC X(6) VALUE '17081C'.           
               10  FILLER            PIC X(6) VALUE '17085C'.           
               10  FILLER            PIC X(6) VALUE '17087C'.           
               10  FILLER            PIC X(6) VALUE '17095C'.           
               10  FILLER            PIC X(6) VALUE '17099C'.           
               10  FILLER            PIC X(6) VALUE '17101C'.           
               10  FILLER            PIC X(6) VALUE '17103C'.           
               10  FILLER            PIC X(6) VALUE '17105C'.           
               10  FILLER            PIC X(6) VALUE '17107C'.           
               10  FILLER            PIC X(6) VALUE '17109C'.           
               10  FILLER            PIC X(6) VALUE '17121C'.           
               10  FILLER            PIC X(6) VALUE '17125C'.           
               10  FILLER            PIC X(6) VALUE '17127C'.           
               10  FILLER            PIC X(6) VALUE '17135C'.           
               10  FILLER            PIC X(6) VALUE '17137C'.           
               10  FILLER            PIC X(6) VALUE '17139C'.           
               10  FILLER            PIC X(6) VALUE '17141C'.           
               10  FILLER            PIC X(6) VALUE '17145C'.           
               10  FILLER            PIC X(6) VALUE '17149C'.           
               10  FILLER            PIC X(6) VALUE '17151C'.           
               10  FILLER            PIC X(6) VALUE '17153C'.           
               10  FILLER            PIC X(6) VALUE '17155C'.           
               10  FILLER            PIC X(6) VALUE '17157C'.           
               10  FILLER            PIC X(6) VALUE '17159C'.           
               10  FILLER            PIC X(6) VALUE '17165C'.           
               10  FILLER            PIC X(6) VALUE '17169C'.           
               10  FILLER            PIC X(6) VALUE '17171C'.           
               10  FILLER            PIC X(6) VALUE '17173C'.           
               10  FILLER            PIC X(6) VALUE '17177C'.           
               10  FILLER            PIC X(6) VALUE '17181C'.           
               10  FILLER            PIC X(6) VALUE '17185C'.           
               10  FILLER            PIC X(6) VALUE '17187C'.           
               10  FILLER            PIC X(6) VALUE '17189C'.           
               10  FILLER            PIC X(6) VALUE '17191C'.           
               10  FILLER            PIC X(6) VALUE '17193C'.           
               10  FILLER            PIC X(6) VALUE '17195C'.           
               10  FILLER            PIC X(6) VALUE '18001C'.           
               10  FILLER            PIC X(6) VALUE '18009C'.           
               10  FILLER            PIC X(6) VALUE '18017C'.           
               10  FILLER            PIC X(6) VALUE '18023C'.           
               10  FILLER            PIC X(6) VALUE '18025C'.           
               10  FILLER            PIC X(6) VALUE '18027C'.           
               10  FILLER            PIC X(6) VALUE '18031C'.           
               10  FILLER            PIC X(6) VALUE '18033C'.           
               10  FILLER            PIC X(6) VALUE '18037C'.           
               10  FILLER            PIC X(6) VALUE '18041C'.           
               10  FILLER            PIC X(6) VALUE '18045C'.           
               10  FILLER            PIC X(6) VALUE '18047C'.           
               10  FILLER            PIC X(6) VALUE '18049C'.           
               10  FILLER            PIC X(6) VALUE '18051C'.           
               10  FILLER            PIC X(6) VALUE '18053C'.           
               10  FILLER            PIC X(6) VALUE '18055C'.           
               10  FILLER            PIC X(6) VALUE '18065C'.           
               10  FILLER            PIC X(6) VALUE '18069C'.           
               10  FILLER            PIC X(6) VALUE '18071C'.           
               10  FILLER            PIC X(6) VALUE '18075C'.           
               10  FILLER            PIC X(6) VALUE '18077C'.           
               10  FILLER            PIC X(6) VALUE '18079C'.           
               10  FILLER            PIC X(6) VALUE '18083C'.           
               10  FILLER            PIC X(6) VALUE '18085C'.           
               10  FILLER            PIC X(6) VALUE '18087C'.           
               10  FILLER            PIC X(6) VALUE '18093C'.           
               10  FILLER            PIC X(6) VALUE '18099C'.           
               10  FILLER            PIC X(6) VALUE '18101C'.           
               10  FILLER            PIC X(6) VALUE '18103C'.           
               10  FILLER            PIC X(6) VALUE '18107C'.           
               10  FILLER            PIC X(6) VALUE '18113C'.           
               10  FILLER            PIC X(6) VALUE '18117C'.           
               10  FILLER            PIC X(6) VALUE '18121C'.           
               10  FILLER            PIC X(6) VALUE '18123C'.           
               10  FILLER            PIC X(6) VALUE '18125C'.           
               10  FILLER            PIC X(6) VALUE '18131C'.           
               10  FILLER            PIC X(6) VALUE '18135C'.           
               10  FILLER            PIC X(6) VALUE '18137C'.           
               10  FILLER            PIC X(6) VALUE '18139C'.           
               10  FILLER            PIC X(6) VALUE '18143A'.           
               10  FILLER            PIC X(6) VALUE '18147C'.           
               10  FILLER            PIC X(6) VALUE '18149C'.           
               10  FILLER            PIC X(6) VALUE '18151C'.           
               10  FILLER            PIC X(6) VALUE '18155C'.           
               10  FILLER            PIC X(6) VALUE '18159C'.           
               10  FILLER            PIC X(6) VALUE '18169C'.           
               10  FILLER            PIC X(6) VALUE '18171C'.           
               10  FILLER            PIC X(6) VALUE '18177C'.           
               10  FILLER            PIC X(6) VALUE '18179A'.           
               10  FILLER            PIC X(6) VALUE '18181C'.           
               10  FILLER            PIC X(6) VALUE '19001C'.           
               10  FILLER            PIC X(6) VALUE '19003C'.           
               10  FILLER            PIC X(6) VALUE '19005C'.           
               10  FILLER            PIC X(6) VALUE '19007C'.           
               10  FILLER            PIC X(6) VALUE '19009C'.           
               10  FILLER            PIC X(6) VALUE '19015C'.           
               10  FILLER            PIC X(6) VALUE '19019C'.           
               10  FILLER            PIC X(6) VALUE '19021C'.           
               10  FILLER            PIC X(6) VALUE '19023C'.           
               10  FILLER            PIC X(6) VALUE '19025C'.           
               10  FILLER            PIC X(6) VALUE '19027C'.           
               10  FILLER            PIC X(6) VALUE '19029C'.           
               10  FILLER            PIC X(6) VALUE '19031C'.           
               10  FILLER            PIC X(6) VALUE '19033C'.           
               10  FILLER            PIC X(6) VALUE '19035C'.           
               10  FILLER            PIC X(6) VALUE '19037C'.           
               10  FILLER            PIC X(6) VALUE '19039C'.           
               10  FILLER            PIC X(6) VALUE '19041C'.           
               10  FILLER            PIC X(6) VALUE '19043C'.           
               10  FILLER            PIC X(6) VALUE '19045C'.           
               10  FILLER            PIC X(6) VALUE '19047C'.           
               10  FILLER            PIC X(6) VALUE '19051C'.           
               10  FILLER            PIC X(6) VALUE '19053C'.           
               10  FILLER            PIC X(6) VALUE '19055C'.           
               10  FILLER            PIC X(6) VALUE '19057C'.           
               10  FILLER            PIC X(6) VALUE '19059C'.           
               10  FILLER            PIC X(6) VALUE '19063C'.           
               10  FILLER            PIC X(6) VALUE '19065C'.           
               10  FILLER            PIC X(6) VALUE '19067C'.           
               10  FILLER            PIC X(6) VALUE '19069C'.           
               10  FILLER            PIC X(6) VALUE '19071C'.           
               10  FILLER            PIC X(6) VALUE '19073C'.           
               10  FILLER            PIC X(6) VALUE '19079C'.           
               10  FILLER            PIC X(6) VALUE '19081C'.           
               10  FILLER            PIC X(6) VALUE '19083C'.           
               10  FILLER            PIC X(6) VALUE '19087C'.           
               10  FILLER            PIC X(6) VALUE '19089C'.           
               10  FILLER            PIC X(6) VALUE '19091C'.           
               10  FILLER            PIC X(6) VALUE '19093C'.           
               10  FILLER            PIC X(6) VALUE '19095C'.           
               10  FILLER            PIC X(6) VALUE '19097C'.           
               10  FILLER            PIC X(6) VALUE '19099C'.           
               10  FILLER            PIC X(6) VALUE '19101C'.           
               10  FILLER            PIC X(6) VALUE '19107C'.           
               10  FILLER            PIC X(6) VALUE '19109C'.           
               10  FILLER            PIC X(6) VALUE '19111C'.           
               10  FILLER            PIC X(6) VALUE '19115C'.           
               10  FILLER            PIC X(6) VALUE '19117C'.           
               10  FILLER            PIC X(6) VALUE '19119C'.           
               10  FILLER            PIC X(6) VALUE '19123C'.           
               10  FILLER            PIC X(6) VALUE '19125C'.           
               10  FILLER            PIC X(6) VALUE '19127C'.           
               10  FILLER            PIC X(6) VALUE '19131C'.           
               10  FILLER            PIC X(6) VALUE '19133C'.           
               10  FILLER            PIC X(6) VALUE '19135C'.           
               10  FILLER            PIC X(6) VALUE '19137C'.           
               10  FILLER            PIC X(6) VALUE '19139C'.           
               10  FILLER            PIC X(6) VALUE '19141C'.           
               10  FILLER            PIC X(6) VALUE '19143C'.           
               10  FILLER            PIC X(6) VALUE '19145C'.           
               10  FILLER            PIC X(6) VALUE '19147C'.           
               10  FILLER            PIC X(6) VALUE '19149A'.           
               10  FILLER            PIC X(6) VALUE '19151C'.           
               10  FILLER            PIC X(6) VALUE '19157C'.           
               10  FILLER            PIC X(6) VALUE '19159C'.           
               10  FILLER            PIC X(6) VALUE '19161C'.           
               10  FILLER            PIC X(6) VALUE '19165C'.           
               10  FILLER            PIC X(6) VALUE '19167C'.           
               10  FILLER            PIC X(6) VALUE '19171C'.           
               10  FILLER            PIC X(6) VALUE '19173C'.           
               10  FILLER            PIC X(6) VALUE '19175C'.           
               10  FILLER            PIC X(6) VALUE '19177C'.           
               10  FILLER            PIC X(6) VALUE '19179C'.           
               10  FILLER            PIC X(6) VALUE '19185C'.           
               10  FILLER            PIC X(6) VALUE '19187C'.           
               10  FILLER            PIC X(6) VALUE '19189C'.           
               10  FILLER            PIC X(6) VALUE '19191C'.           
               10  FILLER            PIC X(6) VALUE '19195C'.           
               10  FILLER            PIC X(6) VALUE '19197C'.           
               10  FILLER            PIC X(6) VALUE '20001C'.           
               10  FILLER            PIC X(6) VALUE '20003C'.           
               10  FILLER            PIC X(6) VALUE '20005C'.           
               10  FILLER            PIC X(6) VALUE '20007B'.           
               10  FILLER            PIC X(6) VALUE '20009C'.           
               10  FILLER            PIC X(6) VALUE '20011C'.           
               10  FILLER            PIC X(6) VALUE '20013C'.           
               10  FILLER            PIC X(6) VALUE '20017B'.           
               10  FILLER            PIC X(6) VALUE '20019A'.           
               10  FILLER            PIC X(6) VALUE '20021C'.           
               10  FILLER            PIC X(6) VALUE '20023B'.           
               10  FILLER            PIC X(6) VALUE '20025B'.           
               10  FILLER            PIC X(6) VALUE '20027C'.           
               10  FILLER            PIC X(6) VALUE '20029C'.           
               10  FILLER            PIC X(6) VALUE '20031C'.           
               10  FILLER            PIC X(6) VALUE '20033B'.           
               10  FILLER            PIC X(6) VALUE '20035C'.           
               10  FILLER            PIC X(6) VALUE '20037C'.           
               10  FILLER            PIC X(6) VALUE '20039B'.           
               10  FILLER            PIC X(6) VALUE '20041C'.           
               10  FILLER            PIC X(6) VALUE '20047B'.           
               10  FILLER            PIC X(6) VALUE '20049B'.           
               10  FILLER            PIC X(6) VALUE '20051C'.           
               10  FILLER            PIC X(6) VALUE '20053A'.           
               10  FILLER            PIC X(6) VALUE '20055C'.           
               10  FILLER            PIC X(6) VALUE '20057C'.           
               10  FILLER            PIC X(6) VALUE '20059C'.           
               10  FILLER            PIC X(6) VALUE '20061C'.           
               10  FILLER            PIC X(6) VALUE '20063B'.           
               10  FILLER            PIC X(6) VALUE '20065A'.           
               10  FILLER            PIC X(6) VALUE '20067C'.           
               10  FILLER            PIC X(6) VALUE '20069C'.           
               10  FILLER            PIC X(6) VALUE '20071B'.           
               10  FILLER            PIC X(6) VALUE '20073A'.           
               10  FILLER            PIC X(6) VALUE '20075B'.           
               10  FILLER            PIC X(6) VALUE '20077C'.           
               10  FILLER            PIC X(6) VALUE '20081C'.           
               10  FILLER            PIC X(6) VALUE '20083B'.           
               10  FILLER            PIC X(6) VALUE '20089B'.           
               10  FILLER            PIC X(6) VALUE '20093B'.           
               10  FILLER            PIC X(6) VALUE '20095A'.           
               10  FILLER            PIC X(6) VALUE '20097B'.           
               10  FILLER            PIC X(6) VALUE '20099C'.           
               10  FILLER            PIC X(6) VALUE '20101B'.           
               10  FILLER            PIC X(6) VALUE '20105B'.           
               10  FILLER            PIC X(6) VALUE '20109B'.           
               10  FILLER            PIC X(6) VALUE '20111C'.           
               10  FILLER            PIC X(6) VALUE '20113C'.           
               10  FILLER            PIC X(6) VALUE '20115C'.           
               10  FILLER            PIC X(6) VALUE '20117C'.           
               10  FILLER            PIC X(6) VALUE '20119B'.           
               10  FILLER            PIC X(6) VALUE '20123C'.           
               10  FILLER            PIC X(6) VALUE '20125C'.           
               10  FILLER            PIC X(6) VALUE '20127C'.           
               10  FILLER            PIC X(6) VALUE '20129B'.           
               10  FILLER            PIC X(6) VALUE '20131C'.           
               10  FILLER            PIC X(6) VALUE '20133C'.           
               10  FILLER            PIC X(6) VALUE '20135B'.           
               10  FILLER            PIC X(6) VALUE '20137C'.           
               10  FILLER            PIC X(6) VALUE '20141B'.           
               10  FILLER            PIC X(6) VALUE '20143C'.           
               10  FILLER            PIC X(6) VALUE '20145C'.           
               10  FILLER            PIC X(6) VALUE '20147C'.           
               10  FILLER            PIC X(6) VALUE '20151C'.           
               10  FILLER            PIC X(6) VALUE '20153B'.           
               10  FILLER            PIC X(6) VALUE '20155C'.           
               10  FILLER            PIC X(6) VALUE '20157C'.           
               10  FILLER            PIC X(6) VALUE '20159C'.           
               10  FILLER            PIC X(6) VALUE '20163B'.           
               10  FILLER            PIC X(6) VALUE '20165B'.           
               10  FILLER            PIC X(6) VALUE '20167A'.           
               10  FILLER            PIC X(6) VALUE '20169A'.           
               10  FILLER            PIC X(6) VALUE '20171C'.           
               10  FILLER            PIC X(6) VALUE '20175C'.           
               10  FILLER            PIC X(6) VALUE '20179B'.           
               10  FILLER            PIC X(6) VALUE '20181B'.           
               10  FILLER            PIC X(6) VALUE '20183B'.           
               10  FILLER            PIC X(6) VALUE '20185B'.           
               10  FILLER            PIC X(6) VALUE '20187B'.           
               10  FILLER            PIC X(6) VALUE '20189C'.           
               10  FILLER            PIC X(6) VALUE '20193C'.           
               10  FILLER            PIC X(6) VALUE '20195B'.           
               10  FILLER            PIC X(6) VALUE '20199B'.           
               10  FILLER            PIC X(6) VALUE '20201C'.           
               10  FILLER            PIC X(6) VALUE '20203B'.           
               10  FILLER            PIC X(6) VALUE '20205A'.           
               10  FILLER            PIC X(6) VALUE '20207C'.           
               10  FILLER            PIC X(6) VALUE '21001A'.           
               10  FILLER            PIC X(6) VALUE '21005C'.           
               10  FILLER            PIC X(6) VALUE '21007C'.           
               10  FILLER            PIC X(6) VALUE '21009C'.           
               10  FILLER            PIC X(6) VALUE '21011A'.           
               10  FILLER            PIC X(6) VALUE '21013A'.           
               10  FILLER            PIC X(6) VALUE '21021A'.           
               10  FILLER            PIC X(6) VALUE '21025A'.           
               10  FILLER            PIC X(6) VALUE '21027C'.           
               10  FILLER            PIC X(6) VALUE '21033C'.           
               10  FILLER            PIC X(6) VALUE '21035C'.           
               10  FILLER            PIC X(6) VALUE '21039C'.           
               10  FILLER            PIC X(6) VALUE '21041A'.           
               10  FILLER            PIC X(6) VALUE '21043C'.           
               10  FILLER            PIC X(6) VALUE '21045A'.           
               10  FILLER            PIC X(6) VALUE '21051A'.           
               10  FILLER            PIC X(6) VALUE '21053A'.           
               10  FILLER            PIC X(6) VALUE '21055C'.           
               10  FILLER            PIC X(6) VALUE '21057A'.           
               10  FILLER            PIC X(6) VALUE '21063C'.           
               10  FILLER            PIC X(6) VALUE '21065A'.           
               10  FILLER            PIC X(6) VALUE '21069C'.           
               10  FILLER            PIC X(6) VALUE '21071C'.           
               10  FILLER            PIC X(6) VALUE '21073C'.           
               10  FILLER            PIC X(6) VALUE '21075A'.           
               10  FILLER            PIC X(6) VALUE '21079A'.           
               10  FILLER            PIC X(6) VALUE '21083C'.           
               10  FILLER            PIC X(6) VALUE '21085A'.           
               10  FILLER            PIC X(6) VALUE '21087A'.           
               10  FILLER            PIC X(6) VALUE '21095C'.           
               10  FILLER            PIC X(6) VALUE '21097C'.           
               10  FILLER            PIC X(6) VALUE '21099C'.           
               10  FILLER            PIC X(6) VALUE '21105A'.           
               10  FILLER            PIC X(6) VALUE '21107C'.           
               10  FILLER            PIC X(6) VALUE '21109C'.           
               10  FILLER            PIC X(6) VALUE '21115C'.           
               10  FILLER            PIC X(6) VALUE '21119C'.           
               10  FILLER            PIC X(6) VALUE '21121A'.           
               10  FILLER            PIC X(6) VALUE '21125C'.           
               10  FILLER            PIC X(6) VALUE '21127A'.           
               10  FILLER            PIC X(6) VALUE '21129C'.           
               10  FILLER            PIC X(6) VALUE '21131C'.           
               10  FILLER            PIC X(6) VALUE '21133C'.           
               10  FILLER            PIC X(6) VALUE '21135C'.           
               10  FILLER            PIC X(6) VALUE '21137A'.           
               10  FILLER            PIC X(6) VALUE '21139C'.           
               10  FILLER            PIC X(6) VALUE '21141C'.           
               10  FILLER            PIC X(6) VALUE '21143C'.           
               10  FILLER            PIC X(6) VALUE '21145C'.           
               10  FILLER            PIC X(6) VALUE '21147A'.           
               10  FILLER            PIC X(6) VALUE '21151C'.           
               10  FILLER            PIC X(6) VALUE '21153C'.           
               10  FILLER            PIC X(6) VALUE '21155A'.           
               10  FILLER            PIC X(6) VALUE '21157C'.           
               10  FILLER            PIC X(6) VALUE '21159C'.           
               10  FILLER            PIC X(6) VALUE '21161C'.           
               10  FILLER            PIC X(6) VALUE '21165C'.           
               10  FILLER            PIC X(6) VALUE '21167A'.           
               10  FILLER            PIC X(6) VALUE '21169C'.           
               10  FILLER            PIC X(6) VALUE '21171C'.           
               10  FILLER            PIC X(6) VALUE '21173C'.           
               10  FILLER            PIC X(6) VALUE '21175C'.           
               10  FILLER            PIC X(6) VALUE '21177C'.           
               10  FILLER            PIC X(6) VALUE '21179A'.           
               10  FILLER            PIC X(6) VALUE '21181A'.           
               10  FILLER            PIC X(6) VALUE '21183C'.           
               10  FILLER            PIC X(6) VALUE '21187C'.           
               10  FILLER            PIC X(6) VALUE '21189C'.           
               10  FILLER            PIC X(6) VALUE '21193C'.           
               10  FILLER            PIC X(6) VALUE '21195C'.           
               10  FILLER            PIC X(6) VALUE '21197C'.           
               10  FILLER            PIC X(6) VALUE '21199C'.           
               10  FILLER            PIC X(6) VALUE '21201C'.           
               10  FILLER            PIC X(6) VALUE '21203C'.           
               10  FILLER            PIC X(6) VALUE '21205A'.           
               10  FILLER            PIC X(6) VALUE '21207A'.           
               10  FILLER            PIC X(6) VALUE '21213C'.           
               10  FILLER            PIC X(6) VALUE '21217A'.           
               10  FILLER            PIC X(6) VALUE '21219A'.           
               10  FILLER            PIC X(6) VALUE '21223A'.           
               10  FILLER            PIC X(6) VALUE '21225A'.           
               10  FILLER            PIC X(6) VALUE '21229A'.           
               10  FILLER            PIC X(6) VALUE '21231C'.           
               10  FILLER            PIC X(6) VALUE '21233C'.           
               10  FILLER            PIC X(6) VALUE '21235A'.           
               10  FILLER            PIC X(6) VALUE '21237C'.           
               10  FILLER            PIC X(6) VALUE '22003A'.           
               10  FILLER            PIC X(6) VALUE '22007A'.           
               10  FILLER            PIC X(6) VALUE '22009A'.           
               10  FILLER            PIC X(6) VALUE '22011A'.           
               10  FILLER            PIC X(6) VALUE '22013A'.           
               10  FILLER            PIC X(6) VALUE '22021A'.           
               10  FILLER            PIC X(6) VALUE '22025A'.           
               10  FILLER            PIC X(6) VALUE '22027A'.           
               10  FILLER            PIC X(6) VALUE '22029A'.           
               10  FILLER            PIC X(6) VALUE '22035A'.           
               10  FILLER            PIC X(6) VALUE '22039A'.           
               10  FILLER            PIC X(6) VALUE '22041A'.           
               10  FILLER            PIC X(6) VALUE '22049A'.           
               10  FILLER            PIC X(6) VALUE '22053A'.           
               10  FILLER            PIC X(6) VALUE '22059A'.           
               10  FILLER            PIC X(6) VALUE '22061A'.           
               10  FILLER            PIC X(6) VALUE '22065A'.           
               10  FILLER            PIC X(6) VALUE '22067A'.           
               10  FILLER            PIC X(6) VALUE '22069A'.           
               10  FILLER            PIC X(6) VALUE '22081A'.           
               10  FILLER            PIC X(6) VALUE '22083A'.           
               10  FILLER            PIC X(6) VALUE '22085A'.           
               10  FILLER            PIC X(6) VALUE '22097A'.           
               10  FILLER            PIC X(6) VALUE '22101A'.           
               10  FILLER            PIC X(6) VALUE '22107A'.           
               10  FILLER            PIC X(6) VALUE '22115A'.           
               10  FILLER            PIC X(6) VALUE '22117A'.           
               10  FILLER            PIC X(6) VALUE '22119A'.           
               10  FILLER            PIC X(6) VALUE '22123A'.           
               10  FILLER            PIC X(6) VALUE '22127A'.           
               10  FILLER            PIC X(6) VALUE '23003C'.           
               10  FILLER            PIC X(6) VALUE '23007C'.           
               10  FILLER            PIC X(6) VALUE '23009C'.           
               10  FILLER            PIC X(6) VALUE '23011C'.           
               10  FILLER            PIC X(6) VALUE '23013C'.           
               10  FILLER            PIC X(6) VALUE '23015C'.           
               10  FILLER            PIC X(6) VALUE '23017C'.           
               10  FILLER            PIC X(6) VALUE '23021B'.           
               10  FILLER            PIC X(6) VALUE '23025C'.           
               10  FILLER            PIC X(6) VALUE '23027C'.           
               10  FILLER            PIC X(6) VALUE '23029C'.           
               10  FILLER            PIC X(6) VALUE '24011C'.           
               10  FILLER            PIC X(6) VALUE '24019C'.           
               10  FILLER            PIC X(6) VALUE '24023C'.           
               10  FILLER            PIC X(6) VALUE '24029C'.           
               10  FILLER            PIC X(6) VALUE '24041C'.           
               10  FILLER            PIC X(6) VALUE '25007C'.           
               10  FILLER            PIC X(6) VALUE '25011C'.           
               10  FILLER            PIC X(6) VALUE '25019C'.           
               10  FILLER            PIC X(6) VALUE '26001C'.           
               10  FILLER            PIC X(6) VALUE '26003A'.           
               10  FILLER            PIC X(6) VALUE '26005C'.           
               10  FILLER            PIC X(6) VALUE '26007C'.           
               10  FILLER            PIC X(6) VALUE '26009C'.           
               10  FILLER            PIC X(6) VALUE '26011C'.           
               10  FILLER            PIC X(6) VALUE '26013C'.           
               10  FILLER            PIC X(6) VALUE '26015A'.           
               10  FILLER            PIC X(6) VALUE '26019C'.           
               10  FILLER            PIC X(6) VALUE '26023C'.           
               10  FILLER            PIC X(6) VALUE '26029C'.           
               10  FILLER            PIC X(6) VALUE '26031C'.           
               10  FILLER            PIC X(6) VALUE '26033C'.           
               10  FILLER            PIC X(6) VALUE '26035C'.           
               10  FILLER            PIC X(6) VALUE '26039C'.           
               10  FILLER            PIC X(6) VALUE '26041C'.           
               10  FILLER            PIC X(6) VALUE '26043C'.           
               10  FILLER            PIC X(6) VALUE '26047C'.           
               10  FILLER            PIC X(6) VALUE '26051C'.           
               10  FILLER            PIC X(6) VALUE '26053C'.           
               10  FILLER            PIC X(6) VALUE '26055C'.           
               10  FILLER            PIC X(6) VALUE '26057C'.           
               10  FILLER            PIC X(6) VALUE '26059C'.           
               10  FILLER            PIC X(6) VALUE '26061C'.           
               10  FILLER            PIC X(6) VALUE '26063C'.           
               10  FILLER            PIC X(6) VALUE '26067C'.           
               10  FILLER            PIC X(6) VALUE '26069C'.           
               10  FILLER            PIC X(6) VALUE '26071C'.           
               10  FILLER            PIC X(6) VALUE '26073C'.           
               10  FILLER            PIC X(6) VALUE '26079C'.           
               10  FILLER            PIC X(6) VALUE '26083B'.           
               10  FILLER            PIC X(6) VALUE '26085C'.           
               10  FILLER            PIC X(6) VALUE '26089C'.           
               10  FILLER            PIC X(6) VALUE '26091C'.           
               10  FILLER            PIC X(6) VALUE '26095A'.           
               10  FILLER            PIC X(6) VALUE '26097C'.           
               10  FILLER            PIC X(6) VALUE '26101C'.           
               10  FILLER            PIC X(6) VALUE '26103C'.           
               10  FILLER            PIC X(6) VALUE '26105C'.           
               10  FILLER            PIC X(6) VALUE '26107C'.           
               10  FILLER            PIC X(6) VALUE '26109C'.           
               10  FILLER            PIC X(6) VALUE '26113C'.           
               10  FILLER            PIC X(6) VALUE '26119C'.           
               10  FILLER            PIC X(6) VALUE '26123C'.           
               10  FILLER            PIC X(6) VALUE '26127C'.           
               10  FILLER            PIC X(6) VALUE '26129A'.           
               10  FILLER            PIC X(6) VALUE '26131B'.           
               10  FILLER            PIC X(6) VALUE '26133C'.           
               10  FILLER            PIC X(6) VALUE '26135C'.           
               10  FILLER            PIC X(6) VALUE '26137C'.           
               10  FILLER            PIC X(6) VALUE '26141C'.           
               10  FILLER            PIC X(6) VALUE '26143C'.           
               10  FILLER            PIC X(6) VALUE '26149C'.           
               10  FILLER            PIC X(6) VALUE '26151C'.           
               10  FILLER            PIC X(6) VALUE '26153A'.           
               10  FILLER            PIC X(6) VALUE '26155C'.           
               10  FILLER            PIC X(6) VALUE '26157C'.           
               10  FILLER            PIC X(6) VALUE '26159A'.           
               10  FILLER            PIC X(6) VALUE '26165C'.           
               10  FILLER            PIC X(6) VALUE '27001C'.           
               10  FILLER            PIC X(6) VALUE '27005C'.           
               10  FILLER            PIC X(6) VALUE '27007C'.           
               10  FILLER            PIC X(6) VALUE '27011C'.           
               10  FILLER            PIC X(6) VALUE '27015C'.           
               10  FILLER            PIC X(6) VALUE '27021C'.           
               10  FILLER            PIC X(6) VALUE '27023C'.           
               10  FILLER            PIC X(6) VALUE '27029C'.           
               10  FILLER            PIC X(6) VALUE '27031B'.           
               10  FILLER            PIC X(6) VALUE '27033C'.           
               10  FILLER            PIC X(6) VALUE '27035C'.           
               10  FILLER            PIC X(6) VALUE '27041A'.           
               10  FILLER            PIC X(6) VALUE '27043C'.           
               10  FILLER            PIC X(6) VALUE '27047C'.           
               10  FILLER            PIC X(6) VALUE '27049C'.           
               10  FILLER            PIC X(6) VALUE '27051C'.           
               10  FILLER            PIC X(6) VALUE '27057C'.           
               10  FILLER            PIC X(6) VALUE '27061C'.           
               10  FILLER            PIC X(6) VALUE '27063C'.           
               10  FILLER            PIC X(6) VALUE '27065C'.           
               10  FILLER            PIC X(6) VALUE '27067C'.           
               10  FILLER            PIC X(6) VALUE '27069B'.           
               10  FILLER            PIC X(6) VALUE '27071B'.           
               10  FILLER            PIC X(6) VALUE '27073C'.           
               10  FILLER            PIC X(6) VALUE '27075B'.           
               10  FILLER            PIC X(6) VALUE '27077B'.           
               10  FILLER            PIC X(6) VALUE '27081C'.           
               10  FILLER            PIC X(6) VALUE '27083C'.           
               10  FILLER            PIC X(6) VALUE '27085C'.           
               10  FILLER            PIC X(6) VALUE '27087C'.           
               10  FILLER            PIC X(6) VALUE '27089B'.           
               10  FILLER            PIC X(6) VALUE '27091C'.           
               10  FILLER            PIC X(6) VALUE '27093C'.           
               10  FILLER            PIC X(6) VALUE '27097C'.           
               10  FILLER            PIC X(6) VALUE '27099C'.           
               10  FILLER            PIC X(6) VALUE '27101C'.           
               10  FILLER            PIC X(6) VALUE '27105C'.           
               10  FILLER            PIC X(6) VALUE '27107C'.           
               10  FILLER            PIC X(6) VALUE '27111C'.           
               10  FILLER            PIC X(6) VALUE '27113C'.           
               10  FILLER            PIC X(6) VALUE '27115C'.           
               10  FILLER            PIC X(6) VALUE '27117C'.           
               10  FILLER            PIC X(6) VALUE '27121C'.           
               10  FILLER            PIC X(6) VALUE '27125C'.           
               10  FILLER            PIC X(6) VALUE '27127C'.           
               10  FILLER            PIC X(6) VALUE '27129C'.           
               10  FILLER            PIC X(6) VALUE '27131C'.           
               10  FILLER            PIC X(6) VALUE '27133C'.           
               10  FILLER            PIC X(6) VALUE '27135C'.           
               10  FILLER            PIC X(6) VALUE '27143A'.           
               10  FILLER            PIC X(6) VALUE '27147C'.           
               10  FILLER            PIC X(6) VALUE '27149C'.           
               10  FILLER            PIC X(6) VALUE '27151C'.           
               10  FILLER            PIC X(6) VALUE '27153C'.           
               10  FILLER            PIC X(6) VALUE '27155C'.           
               10  FILLER            PIC X(6) VALUE '27159C'.           
               10  FILLER            PIC X(6) VALUE '27161C'.           
               10  FILLER            PIC X(6) VALUE '27165C'.           
               10  FILLER            PIC X(6) VALUE '27167C'.           
               10  FILLER            PIC X(6) VALUE '27169C'.           
               10  FILLER            PIC X(6) VALUE '27173C'.           
               10  FILLER            PIC X(6) VALUE '28001A'.           
               10  FILLER            PIC X(6) VALUE '28003A'.           
               10  FILLER            PIC X(6) VALUE '28005A'.           
               10  FILLER            PIC X(6) VALUE '28007A'.           
               10  FILLER            PIC X(6) VALUE '28009A'.           
               10  FILLER            PIC X(6) VALUE '28011A'.           
               10  FILLER            PIC X(6) VALUE '28013A'.           
               10  FILLER            PIC X(6) VALUE '28015A'.           
               10  FILLER            PIC X(6) VALUE '28017A'.           
               10  FILLER            PIC X(6) VALUE '28019A'.           
               10  FILLER            PIC X(6) VALUE '28021A'.           
               10  FILLER            PIC X(6) VALUE '28023A'.           
               10  FILLER            PIC X(6) VALUE '28025A'.           
               10  FILLER            PIC X(6) VALUE '28027A'.           
               10  FILLER            PIC X(6) VALUE '28031A'.           
               10  FILLER            PIC X(6) VALUE '28037A'.           
               10  FILLER            PIC X(6) VALUE '28039A'.           
               10  FILLER            PIC X(6) VALUE '28041A'.           
               10  FILLER            PIC X(6) VALUE '28043A'.           
               10  FILLER            PIC X(6) VALUE '28051A'.           
               10  FILLER            PIC X(6) VALUE '28053A'.           
               10  FILLER            PIC X(6) VALUE '28055A'.           
               10  FILLER            PIC X(6) VALUE '28057A'.           
               10  FILLER            PIC X(6) VALUE '28061A'.           
               10  FILLER            PIC X(6) VALUE '28063A'.           
               10  FILLER            PIC X(6) VALUE '28065A'.           
               10  FILLER            PIC X(6) VALUE '28067A'.           
               10  FILLER            PIC X(6) VALUE '28069A'.           
               10  FILLER            PIC X(6) VALUE '28071C'.           
               10  FILLER            PIC X(6) VALUE '28075A'.           
               10  FILLER            PIC X(6) VALUE '28077A'.           
               10  FILLER            PIC X(6) VALUE '28079A'.           
               10  FILLER            PIC X(6) VALUE '28081A'.           
               10  FILLER            PIC X(6) VALUE '28083A'.           
               10  FILLER            PIC X(6) VALUE '28085A'.           
               10  FILLER            PIC X(6) VALUE '28087A'.           
               10  FILLER            PIC X(6) VALUE '28091A'.           
               10  FILLER            PIC X(6) VALUE '28095A'.           
               10  FILLER            PIC X(6) VALUE '28097A'.           
               10  FILLER            PIC X(6) VALUE '28099A'.           
               10  FILLER            PIC X(6) VALUE '28101A'.           
               10  FILLER            PIC X(6) VALUE '28103A'.           
               10  FILLER            PIC X(6) VALUE '28105A'.           
               10  FILLER            PIC X(6) VALUE '28107A'.           
               10  FILLER            PIC X(6) VALUE '28109A'.           
               10  FILLER            PIC X(6) VALUE '28113A'.           
               10  FILLER            PIC X(6) VALUE '28115C'.           
               10  FILLER            PIC X(6) VALUE '28117A'.           
               10  FILLER            PIC X(6) VALUE '28119A'.           
               10  FILLER            PIC X(6) VALUE '28123A'.           
               10  FILLER            PIC X(6) VALUE '28125A'.           
               10  FILLER            PIC X(6) VALUE '28129A'.           
               10  FILLER            PIC X(6) VALUE '28131A'.           
               10  FILLER            PIC X(6) VALUE '28133A'.           
               10  FILLER            PIC X(6) VALUE '28135A'.           
               10  FILLER            PIC X(6) VALUE '28139A'.           
               10  FILLER            PIC X(6) VALUE '28141A'.           
               10  FILLER            PIC X(6) VALUE '28145C'.           
               10  FILLER            PIC X(6) VALUE '28147A'.           
               10  FILLER            PIC X(6) VALUE '28149A'.           
               10  FILLER            PIC X(6) VALUE '28151A'.           
               10  FILLER            PIC X(6) VALUE '28153A'.           
               10  FILLER            PIC X(6) VALUE '28155A'.           
               10  FILLER            PIC X(6) VALUE '28157A'.           
               10  FILLER            PIC X(6) VALUE '28159A'.           
               10  FILLER            PIC X(6) VALUE '28161A'.           
               10  FILLER            PIC X(6) VALUE '29001C'.           
               10  FILLER            PIC X(6) VALUE '29005C'.           
               10  FILLER            PIC X(6) VALUE '29007C'.           
               10  FILLER            PIC X(6) VALUE '29009C'.           
               10  FILLER            PIC X(6) VALUE '29011C'.           
               10  FILLER            PIC X(6) VALUE '29015C'.           
               10  FILLER            PIC X(6) VALUE '29023C'.           
               10  FILLER            PIC X(6) VALUE '29029C'.           
               10  FILLER            PIC X(6) VALUE '29033C'.           
               10  FILLER            PIC X(6) VALUE '29035C'.           
               10  FILLER            PIC X(6) VALUE '29039C'.           
               10  FILLER            PIC X(6) VALUE '29041C'.           
               10  FILLER            PIC X(6) VALUE '29045C'.           
               10  FILLER            PIC X(6) VALUE '29053C'.           
               10  FILLER            PIC X(6) VALUE '29055C'.           
               10  FILLER            PIC X(6) VALUE '29057C'.           
               10  FILLER            PIC X(6) VALUE '29061C'.           
               10  FILLER            PIC X(6) VALUE '29065C'.           
               10  FILLER            PIC X(6) VALUE '29067C'.           
               10  FILLER            PIC X(6) VALUE '29069C'.           
               10  FILLER            PIC X(6) VALUE '29073C'.           
               10  FILLER            PIC X(6) VALUE '29075C'.           
               10  FILLER            PIC X(6) VALUE '29079C'.           
               10  FILLER            PIC X(6) VALUE '29081C'.           
               10  FILLER            PIC X(6) VALUE '29083C'.           
               10  FILLER            PIC X(6) VALUE '29085C'.           
               10  FILLER            PIC X(6) VALUE '29087C'.           
               10  FILLER            PIC X(6) VALUE '29089C'.           
               10  FILLER            PIC X(6) VALUE '29091C'.           
               10  FILLER            PIC X(6) VALUE '29093C'.           
               10  FILLER            PIC X(6) VALUE '29101C'.           
               10  FILLER            PIC X(6) VALUE '29103C'.           
               10  FILLER            PIC X(6) VALUE '29105C'.           
               10  FILLER            PIC X(6) VALUE '29109C'.           
               10  FILLER            PIC X(6) VALUE '29111C'.           
               10  FILLER            PIC X(6) VALUE '29115C'.           
               10  FILLER            PIC X(6) VALUE '29117C'.           
               10  FILLER            PIC X(6) VALUE '29119A'.           
               10  FILLER            PIC X(6) VALUE '29121C'.           
               10  FILLER            PIC X(6) VALUE '29123C'.           
               10  FILLER            PIC X(6) VALUE '29125C'.           
               10  FILLER            PIC X(6) VALUE '29127C'.           
               10  FILLER            PIC X(6) VALUE '29129C'.           
               10  FILLER            PIC X(6) VALUE '29131C'.           
               10  FILLER            PIC X(6) VALUE '29133C'.           
               10  FILLER            PIC X(6) VALUE '29137C'.           
               10  FILLER            PIC X(6) VALUE '29139C'.           
               10  FILLER            PIC X(6) VALUE '29141C'.           
               10  FILLER            PIC X(6) VALUE '29143C'.           
               10  FILLER            PIC X(6) VALUE '29147C'.           
               10  FILLER            PIC X(6) VALUE '29149C'.           
               10  FILLER            PIC X(6) VALUE '29153C'.           
               10  FILLER            PIC X(6) VALUE '29155C'.           
               10  FILLER            PIC X(6) VALUE '29157C'.           
               10  FILLER            PIC X(6) VALUE '29159C'.           
               10  FILLER            PIC X(6) VALUE '29161C'.           
               10  FILLER            PIC X(6) VALUE '29163C'.           
               10  FILLER            PIC X(6) VALUE '29169C'.           
               10  FILLER            PIC X(6) VALUE '29171C'.           
               10  FILLER            PIC X(6) VALUE '29173C'.           
               10  FILLER            PIC X(6) VALUE '29175C'.           
               10  FILLER            PIC X(6) VALUE '29179C'.           
               10  FILLER            PIC X(6) VALUE '29181A'.           
               10  FILLER            PIC X(6) VALUE '29185C'.           
               10  FILLER            PIC X(6) VALUE '29186C'.           
               10  FILLER            PIC X(6) VALUE '29187C'.           
               10  FILLER            PIC X(6) VALUE '29195C'.           
               10  FILLER            PIC X(6) VALUE '29197C'.           
               10  FILLER            PIC X(6) VALUE '29199C'.           
               10  FILLER            PIC X(6) VALUE '29201C'.           
               10  FILLER            PIC X(6) VALUE '29203C'.           
               10  FILLER            PIC X(6) VALUE '29205C'.           
               10  FILLER            PIC X(6) VALUE '29207C'.           
               10  FILLER            PIC X(6) VALUE '29209C'.           
               10  FILLER            PIC X(6) VALUE '29211C'.           
               10  FILLER            PIC X(6) VALUE '29213C'.           
               10  FILLER            PIC X(6) VALUE '29215C'.           
               10  FILLER            PIC X(6) VALUE '29217C'.           
               10  FILLER            PIC X(6) VALUE '29221C'.           
               10  FILLER            PIC X(6) VALUE '29223C'.           
               10  FILLER            PIC X(6) VALUE '29227C'.           
               10  FILLER            PIC X(6) VALUE '29229C'.           
               10  FILLER            PIC X(6) VALUE '30001B'.           
               10  FILLER            PIC X(6) VALUE '30003B'.           
               10  FILLER            PIC X(6) VALUE '30005B'.           
               10  FILLER            PIC X(6) VALUE '30007B'.           
               10  FILLER            PIC X(6) VALUE '30011B'.           
               10  FILLER            PIC X(6) VALUE '30015B'.           
               10  FILLER            PIC X(6) VALUE '30017B'.           
               10  FILLER            PIC X(6) VALUE '30019B'.           
               10  FILLER            PIC X(6) VALUE '30021B'.           
               10  FILLER            PIC X(6) VALUE '30023C'.           
               10  FILLER            PIC X(6) VALUE '30025B'.           
               10  FILLER            PIC X(6) VALUE '30027B'.           
               10  FILLER            PIC X(6) VALUE '30029C'.           
               10  FILLER            PIC X(6) VALUE '30031C'.           
               10  FILLER            PIC X(6) VALUE '30033B'.           
               10  FILLER            PIC X(6) VALUE '30035B'.           
               10  FILLER            PIC X(6) VALUE '30037A'.           
               10  FILLER            PIC X(6) VALUE '30039B'.           
               10  FILLER            PIC X(6) VALUE '30041B'.           
               10  FILLER            PIC X(6) VALUE '30043C'.           
               10  FILLER            PIC X(6) VALUE '30045B'.           
               10  FILLER            PIC X(6) VALUE '30047C'.           
               10  FILLER            PIC X(6) VALUE '30049C'.           
               10  FILLER            PIC X(6) VALUE '30051B'.           
               10  FILLER            PIC X(6) VALUE '30053B'.           
               10  FILLER            PIC X(6) VALUE '30055B'.           
               10  FILLER            PIC X(6) VALUE '30057B'.           
               10  FILLER            PIC X(6) VALUE '30059B'.           
               10  FILLER            PIC X(6) VALUE '30061B'.           
               10  FILLER            PIC X(6) VALUE '30065B'.           
               10  FILLER            PIC X(6) VALUE '30067B'.           
               10  FILLER            PIC X(6) VALUE '30069B'.           
               10  FILLER            PIC X(6) VALUE '30071B'.           
               10  FILLER            PIC X(6) VALUE '30073B'.           
               10  FILLER            PIC X(6) VALUE '30075B'.           
               10  FILLER            PIC X(6) VALUE '30077B'.           
               10  FILLER            PIC X(6) VALUE '30079B'.           
               10  FILLER            PIC X(6) VALUE '30081C'.           
               10  FILLER            PIC X(6) VALUE '30083B'.           
               10  FILLER            PIC X(6) VALUE '30085B'.           
               10  FILLER            PIC X(6) VALUE '30087B'.           
               10  FILLER            PIC X(6) VALUE '30089B'.           
               10  FILLER            PIC X(6) VALUE '30091B'.           
               10  FILLER            PIC X(6) VALUE '30093C'.           
               10  FILLER            PIC X(6) VALUE '30095B'.           
               10  FILLER            PIC X(6) VALUE '30097B'.           
               10  FILLER            PIC X(6) VALUE '30099B'.           
               10  FILLER            PIC X(6) VALUE '30101B'.           
               10  FILLER            PIC X(6) VALUE '30103B'.           
               10  FILLER            PIC X(6) VALUE '30105B'.           
               10  FILLER            PIC X(6) VALUE '30107B'.           
               10  FILLER            PIC X(6) VALUE '30109B'.           
               10  FILLER            PIC X(6) VALUE '31001C'.           
               10  FILLER            PIC X(6) VALUE '31003C'.           
               10  FILLER            PIC X(6) VALUE '31005B'.           
               10  FILLER            PIC X(6) VALUE '31007B'.           
               10  FILLER            PIC X(6) VALUE '31009B'.           
               10  FILLER            PIC X(6) VALUE '31011C'.           
               10  FILLER            PIC X(6) VALUE '31013C'.           
               10  FILLER            PIC X(6) VALUE '31015B'.           
               10  FILLER            PIC X(6) VALUE '31017B'.           
               10  FILLER            PIC X(6) VALUE '31019C'.           
               10  FILLER            PIC X(6) VALUE '31021C'.           
               10  FILLER            PIC X(6) VALUE '31023C'.           
               10  FILLER            PIC X(6) VALUE '31027C'.           
               10  FILLER            PIC X(6) VALUE '31029B'.           
               10  FILLER            PIC X(6) VALUE '31031B'.           
               10  FILLER            PIC X(6) VALUE '31033C'.           
               10  FILLER            PIC X(6) VALUE '31035C'.           
               10  FILLER            PIC X(6) VALUE '31037C'.           
               10  FILLER            PIC X(6) VALUE '31039C'.           
               10  FILLER            PIC X(6) VALUE '31041B'.           
               10  FILLER            PIC X(6) VALUE '31045C'.           
               10  FILLER            PIC X(6) VALUE '31047C'.           
               10  FILLER            PIC X(6) VALUE '31049B'.           
               10  FILLER            PIC X(6) VALUE '31053C'.           
               10  FILLER            PIC X(6) VALUE '31057B'.           
               10  FILLER            PIC X(6) VALUE '31059C'.           
               10  FILLER            PIC X(6) VALUE '31061B'.           
               10  FILLER            PIC X(6) VALUE '31063B'.           
               10  FILLER            PIC X(6) VALUE '31065C'.           
               10  FILLER            PIC X(6) VALUE '31067C'.           
               10  FILLER            PIC X(6) VALUE '31069B'.           
               10  FILLER            PIC X(6) VALUE '31071B'.           
               10  FILLER            PIC X(6) VALUE '31073B'.           
               10  FILLER            PIC X(6) VALUE '31075B'.           
               10  FILLER            PIC X(6) VALUE '31077B'.           
               10  FILLER            PIC X(6) VALUE '31081A'.           
               10  FILLER            PIC X(6) VALUE '31083C'.           
               10  FILLER            PIC X(6) VALUE '31085B'.           
               10  FILLER            PIC X(6) VALUE '31087B'.           
               10  FILLER            PIC X(6) VALUE '31089B'.           
               10  FILLER            PIC X(6) VALUE '31091B'.           
               10  FILLER            PIC X(6) VALUE '31095C'.           
               10  FILLER            PIC X(6) VALUE '31097C'.           
               10  FILLER            PIC X(6) VALUE '31099C'.           
               10  FILLER            PIC X(6) VALUE '31101C'.           
               10  FILLER            PIC X(6) VALUE '31103B'.           
               10  FILLER            PIC X(6) VALUE '31105B'.           
               10  FILLER            PIC X(6) VALUE '31107C'.           
               10  FILLER            PIC X(6) VALUE '31111C'.           
               10  FILLER            PIC X(6) VALUE '31113B'.           
               10  FILLER            PIC X(6) VALUE '31115B'.           
               10  FILLER            PIC X(6) VALUE '31117B'.           
               10  FILLER            PIC X(6) VALUE '31119C'.           
               10  FILLER            PIC X(6) VALUE '31123B'.           
               10  FILLER            PIC X(6) VALUE '31125C'.           
               10  FILLER            PIC X(6) VALUE '31127C'.           
               10  FILLER            PIC X(6) VALUE '31129C'.           
               10  FILLER            PIC X(6) VALUE '31131C'.           
               10  FILLER            PIC X(6) VALUE '31133C'.           
               10  FILLER            PIC X(6) VALUE '31135B'.           
               10  FILLER            PIC X(6) VALUE '31137C'.           
               10  FILLER            PIC X(6) VALUE '31139C'.           
               10  FILLER            PIC X(6) VALUE '31141C'.           
               10  FILLER            PIC X(6) VALUE '31143C'.           
               10  FILLER            PIC X(6) VALUE '31145C'.           
               10  FILLER            PIC X(6) VALUE '31147C'.           
               10  FILLER            PIC X(6) VALUE '31149B'.           
               10  FILLER            PIC X(6) VALUE '31151C'.           
               10  FILLER            PIC X(6) VALUE '31157C'.           
               10  FILLER            PIC X(6) VALUE '31161B'.           
               10  FILLER            PIC X(6) VALUE '31163B'.           
               10  FILLER            PIC X(6) VALUE '31165B'.           
               10  FILLER            PIC X(6) VALUE '31167C'.           
               10  FILLER            PIC X(6) VALUE '31169C'.           
               10  FILLER            PIC X(6) VALUE '31171B'.           
               10  FILLER            PIC X(6) VALUE '31173C'.           
               10  FILLER            PIC X(6) VALUE '31175C'.           
               10  FILLER            PIC X(6) VALUE '31179C'.           
               10  FILLER            PIC X(6) VALUE '31181C'.           
               10  FILLER            PIC X(6) VALUE '31183B'.           
               10  FILLER            PIC X(6) VALUE '31185C'.           
               10  FILLER            PIC X(6) VALUE '32001B'.           
               10  FILLER            PIC X(6) VALUE '32005C'.           
               10  FILLER            PIC X(6) VALUE '32007B'.           
               10  FILLER            PIC X(6) VALUE '32009B'.           
               10  FILLER            PIC X(6) VALUE '32011B'.           
               10  FILLER            PIC X(6) VALUE '32013B'.           
               10  FILLER            PIC X(6) VALUE '32015B'.           
               10  FILLER            PIC X(6) VALUE '32017A'.           
               10  FILLER            PIC X(6) VALUE '32019C'.           
               10  FILLER            PIC X(6) VALUE '32021B'.           
               10  FILLER            PIC X(6) VALUE '32023B'.           
               10  FILLER            PIC X(6) VALUE '32027B'.           
               10  FILLER            PIC X(6) VALUE '32033B'.           
               10  FILLER            PIC X(6) VALUE '33001C'.           
               10  FILLER            PIC X(6) VALUE '33003C'.           
               10  FILLER            PIC X(6) VALUE '33005C'.           
               10  FILLER            PIC X(6) VALUE '33007C'.           
               10  FILLER            PIC X(6) VALUE '33009C'.           
               10  FILLER            PIC X(6) VALUE '33013A'.           
               10  FILLER            PIC X(6) VALUE '33019C'.           
               10  FILLER            PIC X(6) VALUE '35003B'.           
               10  FILLER            PIC X(6) VALUE '35005A'.           
               10  FILLER            PIC X(6) VALUE '35006B'.           
               10  FILLER            PIC X(6) VALUE '35007B'.           
               10  FILLER            PIC X(6) VALUE '35009C'.           
               10  FILLER            PIC X(6) VALUE '35011B'.           
               10  FILLER            PIC X(6) VALUE '35015A'.           
               10  FILLER            PIC X(6) VALUE '35017C'.           
               10  FILLER            PIC X(6) VALUE '35019B'.           
               10  FILLER            PIC X(6) VALUE '35021B'.           
               10  FILLER            PIC X(6) VALUE '35023B'.           
               10  FILLER            PIC X(6) VALUE '35025A'.           
               10  FILLER            PIC X(6) VALUE '35027B'.           
               10  FILLER            PIC X(6) VALUE '35028C'.           
               10  FILLER            PIC X(6) VALUE '35029C'.           
               10  FILLER            PIC X(6) VALUE '35031C'.           
               10  FILLER            PIC X(6) VALUE '35033B'.           
               10  FILLER            PIC X(6) VALUE '35035C'.           
               10  FILLER            PIC X(6) VALUE '35037B'.           
               10  FILLER            PIC X(6) VALUE '35039C'.           
               10  FILLER            PIC X(6) VALUE '35041A'.           
               10  FILLER            PIC X(6) VALUE '35047C'.           
               10  FILLER            PIC X(6) VALUE '35051B'.           
               10  FILLER            PIC X(6) VALUE '35053B'.           
               10  FILLER            PIC X(6) VALUE '35055C'.           
               10  FILLER            PIC X(6) VALUE '35059B'.           
               10  FILLER            PIC X(6) VALUE '36003C'.           
               10  FILLER            PIC X(6) VALUE '36009C'.           
               10  FILLER            PIC X(6) VALUE '36011C'.           
               10  FILLER            PIC X(6) VALUE '36013C'.           
               10  FILLER            PIC X(6) VALUE '36017C'.           
               10  FILLER            PIC X(6) VALUE '36019C'.           
               10  FILLER            PIC X(6) VALUE '36021C'.           
               10  FILLER            PIC X(6) VALUE '36023C'.           
               10  FILLER            PIC X(6) VALUE '36025C'.           
               10  FILLER            PIC X(6) VALUE '36031C'.           
               10  FILLER            PIC X(6) VALUE '36033C'.           
               10  FILLER            PIC X(6) VALUE '36035C'.           
               10  FILLER            PIC X(6) VALUE '36037C'.           
               10  FILLER            PIC X(6) VALUE '36039C'.           
               10  FILLER            PIC X(6) VALUE '36041B'.           
               10  FILLER            PIC X(6) VALUE '36049C'.           
               10  FILLER            PIC X(6) VALUE '36057C'.           
               10  FILLER            PIC X(6) VALUE '36077C'.           
               10  FILLER            PIC X(6) VALUE '36089C'.           
               10  FILLER            PIC X(6) VALUE '36097C'.           
               10  FILLER            PIC X(6) VALUE '36099C'.           
               10  FILLER            PIC X(6) VALUE '36101C'.           
               10  FILLER            PIC X(6) VALUE '36105C'.           
               10  FILLER            PIC X(6) VALUE '36121C'.           
               10  FILLER            PIC X(6) VALUE '37005C'.           
               10  FILLER            PIC X(6) VALUE '37007C'.           
               10  FILLER            PIC X(6) VALUE '37009C'.           
               10  FILLER            PIC X(6) VALUE '37011A'.           
               10  FILLER            PIC X(6) VALUE '37013C'.           
               10  FILLER            PIC X(6) VALUE '37015C'.           
               10  FILLER            PIC X(6) VALUE '37017C'.           
               10  FILLER            PIC X(6) VALUE '37029C'.           
               10  FILLER            PIC X(6) VALUE '37031C'.           
               10  FILLER            PIC X(6) VALUE '37033C'.           
               10  FILLER            PIC X(6) VALUE '37039C'.           
               10  FILLER            PIC X(6) VALUE '37041C'.           
               10  FILLER            PIC X(6) VALUE '37043C'.           
               10  FILLER            PIC X(6) VALUE '37045A'.           
               10  FILLER            PIC X(6) VALUE '37047A'.           
               10  FILLER            PIC X(6) VALUE '37055C'.           
               10  FILLER            PIC X(6) VALUE '37061C'.           
               10  FILLER            PIC X(6) VALUE '37075C'.           
               10  FILLER            PIC X(6) VALUE '37077C'.           
               10  FILLER            PIC X(6) VALUE '37079C'.           
               10  FILLER            PIC X(6) VALUE '37083C'.           
               10  FILLER            PIC X(6) VALUE '37085C'.           
               10  FILLER            PIC X(6) VALUE '37091C'.           
               10  FILLER            PIC X(6) VALUE '37095C'.           
               10  FILLER            PIC X(6) VALUE '37099C'.           
               10  FILLER            PIC X(6) VALUE '37105C'.           
               10  FILLER            PIC X(6) VALUE '37107C'.           
               10  FILLER            PIC X(6) VALUE '37111C'.           
               10  FILLER            PIC X(6) VALUE '37113C'.           
               10  FILLER            PIC X(6) VALUE '37117C'.           
               10  FILLER            PIC X(6) VALUE '37121C'.           
               10  FILLER            PIC X(6) VALUE '37123C'.           
               10  FILLER            PIC X(6) VALUE '37125C'.           
               10  FILLER            PIC X(6) VALUE '37131C'.           
               10  FILLER            PIC X(6) VALUE '37139C'.           
               10  FILLER            PIC X(6) VALUE '37143C'.           
               10  FILLER            PIC X(6) VALUE '37149C'.           
               10  FILLER            PIC X(6) VALUE '37153C'.           
               10  FILLER            PIC X(6) VALUE '37155C'.           
               10  FILLER            PIC X(6) VALUE '37161C'.           
               10  FILLER            PIC X(6) VALUE '37163C'.           
               10  FILLER            PIC X(6) VALUE '37165C'.           
               10  FILLER            PIC X(6) VALUE '37167C'.           
               10  FILLER            PIC X(6) VALUE '37171C'.           
               10  FILLER            PIC X(6) VALUE '37173C'.           
               10  FILLER            PIC X(6) VALUE '37175C'.           
               10  FILLER            PIC X(6) VALUE '37177C'.           
               10  FILLER            PIC X(6) VALUE '37181C'.           
               10  FILLER            PIC X(6) VALUE '37185C'.           
               10  FILLER            PIC X(6) VALUE '37187C'.           
               10  FILLER            PIC X(6) VALUE '37189C'.           
               10  FILLER            PIC X(6) VALUE '37193C'.           
               10  FILLER            PIC X(6) VALUE '37195C'.           
               10  FILLER            PIC X(6) VALUE '37199C'.           
               10  FILLER            PIC X(6) VALUE '38001B'.           
               10  FILLER            PIC X(6) VALUE '38003C'.           
               10  FILLER            PIC X(6) VALUE '38005B'.           
               10  FILLER            PIC X(6) VALUE '38007B'.           
               10  FILLER            PIC X(6) VALUE '38009B'.           
               10  FILLER            PIC X(6) VALUE '38011B'.           
               10  FILLER            PIC X(6) VALUE '38013B'.           
               10  FILLER            PIC X(6) VALUE '38019B'.           
               10  FILLER            PIC X(6) VALUE '38021B'.           
               10  FILLER            PIC X(6) VALUE '38023B'.           
               10  FILLER            PIC X(6) VALUE '38025B'.           
               10  FILLER            PIC X(6) VALUE '38027B'.           
               10  FILLER            PIC X(6) VALUE '38029B'.           
               10  FILLER            PIC X(6) VALUE '38031B'.           
               10  FILLER            PIC X(6) VALUE '38033B'.           
               10  FILLER            PIC X(6) VALUE '38037B'.           
               10  FILLER            PIC X(6) VALUE '38039B'.           
               10  FILLER            PIC X(6) VALUE '38041B'.           
               10  FILLER            PIC X(6) VALUE '38043B'.           
               10  FILLER            PIC X(6) VALUE '38045B'.           
               10  FILLER            PIC X(6) VALUE '38047B'.           
               10  FILLER            PIC X(6) VALUE '38049B'.           
               10  FILLER            PIC X(6) VALUE '38051B'.           
               10  FILLER            PIC X(6) VALUE '38053B'.           
               10  FILLER            PIC X(6) VALUE '38055B'.           
               10  FILLER            PIC X(6) VALUE '38057C'.           
               10  FILLER            PIC X(6) VALUE '38061B'.           
               10  FILLER            PIC X(6) VALUE '38063B'.           
               10  FILLER            PIC X(6) VALUE '38067C'.           
               10  FILLER            PIC X(6) VALUE '38069B'.           
               10  FILLER            PIC X(6) VALUE '38071C'.           
               10  FILLER            PIC X(6) VALUE '38073C'.           
               10  FILLER            PIC X(6) VALUE '38075B'.           
               10  FILLER            PIC X(6) VALUE '38077C'.           
               10  FILLER            PIC X(6) VALUE '38079C'.           
               10  FILLER            PIC X(6) VALUE '38081B'.           
               10  FILLER            PIC X(6) VALUE '38083B'.           
               10  FILLER            PIC X(6) VALUE '38085A'.           
               10  FILLER            PIC X(6) VALUE '38087B'.           
               10  FILLER            PIC X(6) VALUE '38089C'.           
               10  FILLER            PIC X(6) VALUE '38091B'.           
               10  FILLER            PIC X(6) VALUE '38093C'.           
               10  FILLER            PIC X(6) VALUE '38095B'.           
               10  FILLER            PIC X(6) VALUE '38097C'.           
               10  FILLER            PIC X(6) VALUE '38099C'.           
               10  FILLER            PIC X(6) VALUE '38101C'.           
               10  FILLER            PIC X(6) VALUE '38103B'.           
               10  FILLER            PIC X(6) VALUE '38105C'.           
               10  FILLER            PIC X(6) VALUE '39001C'.           
               10  FILLER            PIC X(6) VALUE '39005C'.           
               10  FILLER            PIC X(6) VALUE '39007C'.           
               10  FILLER            PIC X(6) VALUE '39009C'.           
               10  FILLER            PIC X(6) VALUE '39011C'.           
               10  FILLER            PIC X(6) VALUE '39021C'.           
               10  FILLER            PIC X(6) VALUE '39027C'.           
               10  FILLER            PIC X(6) VALUE '39029C'.           
               10  FILLER            PIC X(6) VALUE '39031C'.           
               10  FILLER            PIC X(6) VALUE '39033C'.           
               10  FILLER            PIC X(6) VALUE '39037C'.           
               10  FILLER            PIC X(6) VALUE '39039C'.           
               10  FILLER            PIC X(6) VALUE '39043C'.           
               10  FILLER            PIC X(6) VALUE '39047C'.           
               10  FILLER            PIC X(6) VALUE '39053C'.           
               10  FILLER            PIC X(6) VALUE '39059C'.           
               10  FILLER            PIC X(6) VALUE '39063C'.           
               10  FILLER            PIC X(6) VALUE '39065C'.           
               10  FILLER            PIC X(6) VALUE '39067C'.           
               10  FILLER            PIC X(6) VALUE '39069C'.           
               10  FILLER            PIC X(6) VALUE '39071C'.           
               10  FILLER            PIC X(6) VALUE '39075C'.           
               10  FILLER            PIC X(6) VALUE '39077C'.           
               10  FILLER            PIC X(6) VALUE '39079A'.           
               10  FILLER            PIC X(6) VALUE '39083C'.           
               10  FILLER            PIC X(6) VALUE '39091C'.           
               10  FILLER            PIC X(6) VALUE '39101C'.           
               10  FILLER            PIC X(6) VALUE '39105A'.           
               10  FILLER            PIC X(6) VALUE '39107C'.           
               10  FILLER            PIC X(6) VALUE '39111C'.           
               10  FILLER            PIC X(6) VALUE '39115C'.           
               10  FILLER            PIC X(6) VALUE '39119C'.           
               10  FILLER            PIC X(6) VALUE '39121C'.           
               10  FILLER            PIC X(6) VALUE '39123C'.           
               10  FILLER            PIC X(6) VALUE '39125C'.           
               10  FILLER            PIC X(6) VALUE '39131C'.           
               10  FILLER            PIC X(6) VALUE '39135C'.           
               10  FILLER            PIC X(6) VALUE '39137C'.           
               10  FILLER            PIC X(6) VALUE '39141C'.           
               10  FILLER            PIC X(6) VALUE '39143C'.           
               10  FILLER            PIC X(6) VALUE '39145A'.           
               10  FILLER            PIC X(6) VALUE '39147C'.           
               10  FILLER            PIC X(6) VALUE '39149C'.           
               10  FILLER            PIC X(6) VALUE '39157C'.           
               10  FILLER            PIC X(6) VALUE '39161C'.           
               10  FILLER            PIC X(6) VALUE '39163C'.           
               10  FILLER            PIC X(6) VALUE '39167C'.           
               10  FILLER            PIC X(6) VALUE '39169C'.           
               10  FILLER            PIC X(6) VALUE '39171C'.           
               10  FILLER            PIC X(6) VALUE '39175C'.           
               10  FILLER            PIC X(6) VALUE '40001A'.           
               10  FILLER            PIC X(6) VALUE '40003C'.           
               10  FILLER            PIC X(6) VALUE '40005A'.           
               10  FILLER            PIC X(6) VALUE '40007B'.           
               10  FILLER            PIC X(6) VALUE '40009A'.           
               10  FILLER            PIC X(6) VALUE '40011A'.           
               10  FILLER            PIC X(6) VALUE '40013A'.           
               10  FILLER            PIC X(6) VALUE '40015A'.           
               10  FILLER            PIC X(6) VALUE '40019A'.           
               10  FILLER            PIC X(6) VALUE '40021A'.           
               10  FILLER            PIC X(6) VALUE '40023A'.           
               10  FILLER            PIC X(6) VALUE '40025B'.           
               10  FILLER            PIC X(6) VALUE '40029A'.           
               10  FILLER            PIC X(6) VALUE '40035A'.           
               10  FILLER            PIC X(6) VALUE '40039A'.           
               10  FILLER            PIC X(6) VALUE '40041A'.           
               10  FILLER            PIC X(6) VALUE '40043A'.           
               10  FILLER            PIC X(6) VALUE '40045B'.           
               10  FILLER            PIC X(6) VALUE '40049A'.           
               10  FILLER            PIC X(6) VALUE '40053B'.           
               10  FILLER            PIC X(6) VALUE '40055A'.           
               10  FILLER            PIC X(6) VALUE '40057A'.           
               10  FILLER            PIC X(6) VALUE '40059B'.           
               10  FILLER            PIC X(6) VALUE '40061A'.           
               10  FILLER            PIC X(6) VALUE '40063A'.           
               10  FILLER            PIC X(6) VALUE '40065A'.           
               10  FILLER            PIC X(6) VALUE '40067A'.           
               10  FILLER            PIC X(6) VALUE '40069A'.           
               10  FILLER            PIC X(6) VALUE '40071A'.           
               10  FILLER            PIC X(6) VALUE '40073A'.           
               10  FILLER            PIC X(6) VALUE '40075A'.           
               10  FILLER            PIC X(6) VALUE '40077A'.           
               10  FILLER            PIC X(6) VALUE '40079A'.           
               10  FILLER            PIC X(6) VALUE '40085A'.           
               10  FILLER            PIC X(6) VALUE '40089A'.           
               10  FILLER            PIC X(6) VALUE '40091A'.           
               10  FILLER            PIC X(6) VALUE '40093A'.           
               10  FILLER            PIC X(6) VALUE '40095A'.           
               10  FILLER            PIC X(6) VALUE '40097A'.           
               10  FILLER            PIC X(6) VALUE '40099A'.           
               10  FILLER            PIC X(6) VALUE '40101A'.           
               10  FILLER            PIC X(6) VALUE '40103C'.           
               10  FILLER            PIC X(6) VALUE '40105C'.           
               10  FILLER            PIC X(6) VALUE '40107A'.           
               10  FILLER            PIC X(6) VALUE '40115A'.           
               10  FILLER            PIC X(6) VALUE '40119A'.           
               10  FILLER            PIC X(6) VALUE '40121A'.           
               10  FILLER            PIC X(6) VALUE '40123A'.           
               10  FILLER            PIC X(6) VALUE '40125A'.           
               10  FILLER            PIC X(6) VALUE '40127A'.           
               10  FILLER            PIC X(6) VALUE '40129A'.           
               10  FILLER            PIC X(6) VALUE '40133A'.           
               10  FILLER            PIC X(6) VALUE '40137A'.           
               10  FILLER            PIC X(6) VALUE '40139C'.           
               10  FILLER            PIC X(6) VALUE '40141A'.           
               10  FILLER            PIC X(6) VALUE '40147A'.           
               10  FILLER            PIC X(6) VALUE '40149A'.           
               10  FILLER            PIC X(6) VALUE '40151C'.           
               10  FILLER            PIC X(6) VALUE '40153C'.           
               10  FILLER            PIC X(6) VALUE '41001B'.           
               10  FILLER            PIC X(6) VALUE '41007C'.           
               10  FILLER            PIC X(6) VALUE '41011C'.           
               10  FILLER            PIC X(6) VALUE '41013C'.           
               10  FILLER            PIC X(6) VALUE '41015C'.           
               10  FILLER            PIC X(6) VALUE '41019C'.           
               10  FILLER            PIC X(6) VALUE '41021B'.           
               10  FILLER            PIC X(6) VALUE '41023B'.           
               10  FILLER            PIC X(6) VALUE '41025B'.           
               10  FILLER            PIC X(6) VALUE '41027C'.           
               10  FILLER            PIC X(6) VALUE '41031C'.           
               10  FILLER            PIC X(6) VALUE '41035C'.           
               10  FILLER            PIC X(6) VALUE '41037B'.           
               10  FILLER            PIC X(6) VALUE '41041C'.           
               10  FILLER            PIC X(6) VALUE '41045B'.           
               10  FILLER            PIC X(6) VALUE '41049B'.           
               10  FILLER            PIC X(6) VALUE '41055B'.           
               10  FILLER            PIC X(6) VALUE '41057C'.           
               10  FILLER            PIC X(6) VALUE '41059C'.           
               10  FILLER            PIC X(6) VALUE '41061C'.           
               10  FILLER            PIC X(6) VALUE '41063B'.           
               10  FILLER            PIC X(6) VALUE '41065C'.           
               10  FILLER            PIC X(6) VALUE '41069B'.           
               10  FILLER            PIC X(6) VALUE '42009C'.           
               10  FILLER            PIC X(6) VALUE '42015C'.           
               10  FILLER            PIC X(6) VALUE '42023C'.           
               10  FILLER            PIC X(6) VALUE '42031C'.           
               10  FILLER            PIC X(6) VALUE '42033A'.           
               10  FILLER            PIC X(6) VALUE '42035C'.           
               10  FILLER            PIC X(6) VALUE '42039C'.           
               10  FILLER            PIC X(6) VALUE '42047A'.           
               10  FILLER            PIC X(6) VALUE '42053C'.           
               10  FILLER            PIC X(6) VALUE '42057C'.           
               10  FILLER            PIC X(6) VALUE '42059C'.           
               10  FILLER            PIC X(6) VALUE '42061C'.           
               10  FILLER            PIC X(6) VALUE '42063A'.           
               10  FILLER            PIC X(6) VALUE '42065A'.           
               10  FILLER            PIC X(6) VALUE '42067C'.           
               10  FILLER            PIC X(6) VALUE '42073C'.           
               10  FILLER            PIC X(6) VALUE '42083C'.           
               10  FILLER            PIC X(6) VALUE '42087C'.           
               10  FILLER            PIC X(6) VALUE '42097C'.           
               10  FILLER            PIC X(6) VALUE '42105C'.           
               10  FILLER            PIC X(6) VALUE '42107C'.           
               10  FILLER            PIC X(6) VALUE '42109C'.           
               10  FILLER            PIC X(6) VALUE '42111C'.           
               10  FILLER            PIC X(6) VALUE '42113C'.           
               10  FILLER            PIC X(6) VALUE '42115C'.           
               10  FILLER            PIC X(6) VALUE '42117C'.           
               10  FILLER            PIC X(6) VALUE '42119C'.           
               10  FILLER            PIC X(6) VALUE '42121C'.           
               10  FILLER            PIC X(6) VALUE '42123C'.           
               10  FILLER            PIC X(6) VALUE '42127C'.           
               10  FILLER            PIC X(6) VALUE '45001A'.           
               10  FILLER            PIC X(6) VALUE '45005C'.           
               10  FILLER            PIC X(6) VALUE '45009C'.           
               10  FILLER            PIC X(6) VALUE '45011C'.           
               10  FILLER            PIC X(6) VALUE '45021C'.           
               10  FILLER            PIC X(6) VALUE '45025C'.           
               10  FILLER            PIC X(6) VALUE '45027C'.           
               10  FILLER            PIC X(6) VALUE '45029C'.           
               10  FILLER            PIC X(6) VALUE '45033C'.           
               10  FILLER            PIC X(6) VALUE '45043C'.           
               10  FILLER            PIC X(6) VALUE '45047A'.           
               10  FILLER            PIC X(6) VALUE '45049C'.           
               10  FILLER            PIC X(6) VALUE '45061C'.           
               10  FILLER            PIC X(6) VALUE '45065C'.           
               10  FILLER            PIC X(6) VALUE '45067C'.           
               10  FILLER            PIC X(6) VALUE '45069C'.           
               10  FILLER            PIC X(6) VALUE '45071C'.           
               10  FILLER            PIC X(6) VALUE '45073C'.           
               10  FILLER            PIC X(6) VALUE '45075C'.           
               10  FILLER            PIC X(6) VALUE '45087A'.           
               10  FILLER            PIC X(6) VALUE '45089C'.           
               10  FILLER            PIC X(6) VALUE '46003B'.           
               10  FILLER            PIC X(6) VALUE '46005C'.           
               10  FILLER            PIC X(6) VALUE '46007B'.           
               10  FILLER            PIC X(6) VALUE '46009C'.           
               10  FILLER            PIC X(6) VALUE '46011C'.           
               10  FILLER            PIC X(6) VALUE '46013C'.           
               10  FILLER            PIC X(6) VALUE '46015C'.           
               10  FILLER            PIC X(6) VALUE '46017B'.           
               10  FILLER            PIC X(6) VALUE '46019B'.           
               10  FILLER            PIC X(6) VALUE '46021B'.           
               10  FILLER            PIC X(6) VALUE '46023C'.           
               10  FILLER            PIC X(6) VALUE '46025B'.           
               10  FILLER            PIC X(6) VALUE '46027C'.           
               10  FILLER            PIC X(6) VALUE '46029C'.           
               10  FILLER            PIC X(6) VALUE '46031B'.           
               10  FILLER            PIC X(6) VALUE '46033A'.           
               10  FILLER            PIC X(6) VALUE '46035C'.           
               10  FILLER            PIC X(6) VALUE '46037B'.           
               10  FILLER            PIC X(6) VALUE '46039C'.           
               10  FILLER            PIC X(6) VALUE '46041A'.           
               10  FILLER            PIC X(6) VALUE '46043C'.           
               10  FILLER            PIC X(6) VALUE '46045B'.           
               10  FILLER            PIC X(6) VALUE '46047B'.           
               10  FILLER            PIC X(6) VALUE '46049B'.           
               10  FILLER            PIC X(6) VALUE '46051C'.           
               10  FILLER            PIC X(6) VALUE '46053B'.           
               10  FILLER            PIC X(6) VALUE '46055B'.           
               10  FILLER            PIC X(6) VALUE '46057C'.           
               10  FILLER            PIC X(6) VALUE '46059B'.           
               10  FILLER            PIC X(6) VALUE '46061C'.           
               10  FILLER            PIC X(6) VALUE '46063B'.           
               10  FILLER            PIC X(6) VALUE '46065C'.           
               10  FILLER            PIC X(6) VALUE '46067C'.           
               10  FILLER            PIC X(6) VALUE '46069B'.           
               10  FILLER            PIC X(6) VALUE '46071B'.           
               10  FILLER            PIC X(6) VALUE '46073B'.           
               10  FILLER            PIC X(6) VALUE '46075B'.           
               10  FILLER            PIC X(6) VALUE '46077C'.           
               10  FILLER            PIC X(6) VALUE '46079C'.           
               10  FILLER            PIC X(6) VALUE '46081C'.           
               10  FILLER            PIC X(6) VALUE '46085B'.           
               10  FILLER            PIC X(6) VALUE '46089B'.           
               10  FILLER            PIC X(6) VALUE '46091B'.           
               10  FILLER            PIC X(6) VALUE '46095B'.           
               10  FILLER            PIC X(6) VALUE '46097B'.           
               10  FILLER            PIC X(6) VALUE '46101C'.           
               10  FILLER            PIC X(6) VALUE '46105B'.           
               10  FILLER            PIC X(6) VALUE '46107B'.           
               10  FILLER            PIC X(6) VALUE '46109C'.           
               10  FILLER            PIC X(6) VALUE '46111B'.           
               10  FILLER            PIC X(6) VALUE '46113C'.           
               10  FILLER            PIC X(6) VALUE '46115B'.           
               10  FILLER            PIC X(6) VALUE '46117B'.           
               10  FILLER            PIC X(6) VALUE '46119B'.           
               10  FILLER            PIC X(6) VALUE '46121C'.           
               10  FILLER            PIC X(6) VALUE '46123B'.           
               10  FILLER            PIC X(6) VALUE '46129C'.           
               10  FILLER            PIC X(6) VALUE '46135C'.           
               10  FILLER            PIC X(6) VALUE '46137B'.           
               10  FILLER            PIC X(6) VALUE '47003C'.           
               10  FILLER            PIC X(6) VALUE '47005A'.           
               10  FILLER            PIC X(6) VALUE '47007A'.           
               10  FILLER            PIC X(6) VALUE '47017A'.           
               10  FILLER            PIC X(6) VALUE '47025A'.           
               10  FILLER            PIC X(6) VALUE '47027C'.           
               10  FILLER            PIC X(6) VALUE '47029A'.           
               10  FILLER            PIC X(6) VALUE '47031A'.           
               10  FILLER            PIC X(6) VALUE '47035C'.           
               10  FILLER            PIC X(6) VALUE '47039A'.           
               10  FILLER            PIC X(6) VALUE '47041A'.           
               10  FILLER            PIC X(6) VALUE '47045A'.           
               10  FILLER            PIC X(6) VALUE '47049A'.           
               10  FILLER            PIC X(6) VALUE '47051A'.           
               10  FILLER            PIC X(6) VALUE '47053A'.           
               10  FILLER            PIC X(6) VALUE '47055A'.           
               10  FILLER            PIC X(6) VALUE '47059C'.           
               10  FILLER            PIC X(6) VALUE '47061A'.           
               10  FILLER            PIC X(6) VALUE '47067A'.           
               10  FILLER            PIC X(6) VALUE '47069A'.           
               10  FILLER            PIC X(6) VALUE '47071A'.           
               10  FILLER            PIC X(6) VALUE '47075A'.           
               10  FILLER            PIC X(6) VALUE '47077A'.           
               10  FILLER            PIC X(6) VALUE '47079A'.           
               10  FILLER            PIC X(6) VALUE '47081A'.           
               10  FILLER            PIC X(6) VALUE '47083A'.           
               10  FILLER            PIC X(6) VALUE '47085A'.           
               10  FILLER            PIC X(6) VALUE '47087A'.           
               10  FILLER            PIC X(6) VALUE '47091A'.           
               10  FILLER            PIC X(6) VALUE '47095A'.           
               10  FILLER            PIC X(6) VALUE '47097A'.           
               10  FILLER            PIC X(6) VALUE '47099A'.           
               10  FILLER            PIC X(6) VALUE '47101A'.           
               10  FILLER            PIC X(6) VALUE '47103A'.           
               10  FILLER            PIC X(6) VALUE '47107A'.           
               10  FILLER            PIC X(6) VALUE '47109A'.           
               10  FILLER            PIC X(6) VALUE '47117A'.           
               10  FILLER            PIC X(6) VALUE '47121A'.           
               10  FILLER            PIC X(6) VALUE '47123C'.           
               10  FILLER            PIC X(6) VALUE '47127A'.           
               10  FILLER            PIC X(6) VALUE '47131A'.           
               10  FILLER            PIC X(6) VALUE '47133A'.           
               10  FILLER            PIC X(6) VALUE '47135A'.           
               10  FILLER            PIC X(6) VALUE '47137A'.           
               10  FILLER            PIC X(6) VALUE '47141A'.           
               10  FILLER            PIC X(6) VALUE '47143C'.           
               10  FILLER            PIC X(6) VALUE '47151A'.           
               10  FILLER            PIC X(6) VALUE '47155C'.           
               10  FILLER            PIC X(6) VALUE '47161C'.           
               10  FILLER            PIC X(6) VALUE '47175A'.           
               10  FILLER            PIC X(6) VALUE '47177A'.           
               10  FILLER            PIC X(6) VALUE '47181A'.           
               10  FILLER            PIC X(6) VALUE '47183A'.           
               10  FILLER            PIC X(6) VALUE '47185A'.           
               10  FILLER            PIC X(6) VALUE '48001A'.           
               10  FILLER            PIC X(6) VALUE '48003A'.           
               10  FILLER            PIC X(6) VALUE '48005A'.           
               10  FILLER            PIC X(6) VALUE '48007A'.           
               10  FILLER            PIC X(6) VALUE '48017A'.           
               10  FILLER            PIC X(6) VALUE '48023A'.           
               10  FILLER            PIC X(6) VALUE '48025A'.           
               10  FILLER            PIC X(6) VALUE '48031A'.           
               10  FILLER            PIC X(6) VALUE '48033A'.           
               10  FILLER            PIC X(6) VALUE '48035C'.           
               10  FILLER            PIC X(6) VALUE '48043B'.           
               10  FILLER            PIC X(6) VALUE '48045A'.           
               10  FILLER            PIC X(6) VALUE '48047A'.           
               10  FILLER            PIC X(6) VALUE '48049A'.           
               10  FILLER            PIC X(6) VALUE '48053A'.           
               10  FILLER            PIC X(6) VALUE '48057A'.           
               10  FILLER            PIC X(6) VALUE '48063A'.           
               10  FILLER            PIC X(6) VALUE '48067A'.           
               10  FILLER            PIC X(6) VALUE '48069A'.           
               10  FILLER            PIC X(6) VALUE '48073A'.           
               10  FILLER            PIC X(6) VALUE '48075A'.           
               10  FILLER            PIC X(6) VALUE '48079A'.           
               10  FILLER            PIC X(6) VALUE '48081A'.           
               10  FILLER            PIC X(6) VALUE '48083A'.           
               10  FILLER            PIC X(6) VALUE '48087A'.           
               10  FILLER            PIC X(6) VALUE '48089A'.           
               10  FILLER            PIC X(6) VALUE '48093A'.           
               10  FILLER            PIC X(6) VALUE '48095A'.           
               10  FILLER            PIC X(6) VALUE '48097A'.           
               10  FILLER            PIC X(6) VALUE '48101A'.           
               10  FILLER            PIC X(6) VALUE '48103A'.           
               10  FILLER            PIC X(6) VALUE '48105A'.           
               10  FILLER            PIC X(6) VALUE '48109A'.           
               10  FILLER            PIC X(6) VALUE '48111A'.           
               10  FILLER            PIC X(6) VALUE '48115A'.           
               10  FILLER            PIC X(6) VALUE '48117A'.           
               10  FILLER            PIC X(6) VALUE '48119A'.           
               10  FILLER            PIC X(6) VALUE '48123A'.           
               10  FILLER            PIC X(6) VALUE '48125A'.           
               10  FILLER            PIC X(6) VALUE '48127A'.           
               10  FILLER            PIC X(6) VALUE '48129A'.           
               10  FILLER            PIC X(6) VALUE '48131A'.           
               10  FILLER            PIC X(6) VALUE '48133A'.           
               10  FILLER            PIC X(6) VALUE '48137A'.           
               10  FILLER            PIC X(6) VALUE '48143A'.           
               10  FILLER            PIC X(6) VALUE '48147A'.           
               10  FILLER            PIC X(6) VALUE '48149A'.           
               10  FILLER            PIC X(6) VALUE '48151A'.           
               10  FILLER            PIC X(6) VALUE '48153A'.           
               10  FILLER            PIC X(6) VALUE '48155A'.           
               10  FILLER            PIC X(6) VALUE '48159A'.           
               10  FILLER            PIC X(6) VALUE '48161A'.           
               10  FILLER            PIC X(6) VALUE '48163A'.           
               10  FILLER            PIC X(6) VALUE '48165A'.           
               10  FILLER            PIC X(6) VALUE '48169A'.           
               10  FILLER            PIC X(6) VALUE '48171C'.           
               10  FILLER            PIC X(6) VALUE '48173B'.           
               10  FILLER            PIC X(6) VALUE '48177A'.           
               10  FILLER            PIC X(6) VALUE '48179A'.           
               10  FILLER            PIC X(6) VALUE '48185A'.           
               10  FILLER            PIC X(6) VALUE '48189A'.           
               10  FILLER            PIC X(6) VALUE '48191A'.           
               10  FILLER            PIC X(6) VALUE '48193A'.           
               10  FILLER            PIC X(6) VALUE '48195A'.           
               10  FILLER            PIC X(6) VALUE '48197A'.           
               10  FILLER            PIC X(6) VALUE '48203A'.           
               10  FILLER            PIC X(6) VALUE '48205A'.           
               10  FILLER            PIC X(6) VALUE '48207A'.           
               10  FILLER            PIC X(6) VALUE '48211B'.           
               10  FILLER            PIC X(6) VALUE '48213A'.           
               10  FILLER            PIC X(6) VALUE '48217A'.           
               10  FILLER            PIC X(6) VALUE '48219A'.           
               10  FILLER            PIC X(6) VALUE '48221A'.           
               10  FILLER            PIC X(6) VALUE '48223A'.           
               10  FILLER            PIC X(6) VALUE '48225A'.           
               10  FILLER            PIC X(6) VALUE '48227A'.           
               10  FILLER            PIC X(6) VALUE '48233A'.           
               10  FILLER            PIC X(6) VALUE '48237A'.           
               10  FILLER            PIC X(6) VALUE '48239A'.           
               10  FILLER            PIC X(6) VALUE '48241A'.           
               10  FILLER            PIC X(6) VALUE '48243B'.           
               10  FILLER            PIC X(6) VALUE '48247A'.           
               10  FILLER            PIC X(6) VALUE '48249A'.           
               10  FILLER            PIC X(6) VALUE '48255A'.           
               10  FILLER            PIC X(6) VALUE '48261A'.           
               10  FILLER            PIC X(6) VALUE '48263A'.           
               10  FILLER            PIC X(6) VALUE '48265C'.           
               10  FILLER            PIC X(6) VALUE '48267A'.           
               10  FILLER            PIC X(6) VALUE '48269B'.           
               10  FILLER            PIC X(6) VALUE '48271B'.           
               10  FILLER            PIC X(6) VALUE '48273A'.           
               10  FILLER            PIC X(6) VALUE '48275A'.           
               10  FILLER            PIC X(6) VALUE '48277A'.           
               10  FILLER            PIC X(6) VALUE '48279A'.           
               10  FILLER            PIC X(6) VALUE '48283A'.           
               10  FILLER            PIC X(6) VALUE '48285A'.           
               10  FILLER            PIC X(6) VALUE '48287A'.           
               10  FILLER            PIC X(6) VALUE '48289A'.           
               10  FILLER            PIC X(6) VALUE '48293A'.           
               10  FILLER            PIC X(6) VALUE '48295B'.           
               10  FILLER            PIC X(6) VALUE '48297A'.           
               10  FILLER            PIC X(6) VALUE '48299A'.           
               10  FILLER            PIC X(6) VALUE '48301B'.           
               10  FILLER            PIC X(6) VALUE '48307A'.           
               10  FILLER            PIC X(6) VALUE '48311A'.           
               10  FILLER            PIC X(6) VALUE '48313A'.           
               10  FILLER            PIC X(6) VALUE '48315A'.           
               10  FILLER            PIC X(6) VALUE '48319A'.           
               10  FILLER            PIC X(6) VALUE '48321A'.           
               10  FILLER            PIC X(6) VALUE '48323A'.           
               10  FILLER            PIC X(6) VALUE '48327A'.           
               10  FILLER            PIC X(6) VALUE '48331A'.           
               10  FILLER            PIC X(6) VALUE '48333A'.           
               10  FILLER            PIC X(6) VALUE '48335A'.           
               10  FILLER            PIC X(6) VALUE '48337A'.           
               10  FILLER            PIC X(6) VALUE '48341A'.           
               10  FILLER            PIC X(6) VALUE '48343A'.           
               10  FILLER            PIC X(6) VALUE '48345A'.           
               10  FILLER            PIC X(6) VALUE '48347A'.           
               10  FILLER            PIC X(6) VALUE '48349A'.           
               10  FILLER            PIC X(6) VALUE '48351A'.           
               10  FILLER            PIC X(6) VALUE '48353A'.           
               10  FILLER            PIC X(6) VALUE '48357A'.           
               10  FILLER            PIC X(6) VALUE '48363A'.           
               10  FILLER            PIC X(6) VALUE '48365A'.           
               10  FILLER            PIC X(6) VALUE '48369A'.           
               10  FILLER            PIC X(6) VALUE '48371A'.           
               10  FILLER            PIC X(6) VALUE '48373A'.           
               10  FILLER            PIC X(6) VALUE '48377B'.           
               10  FILLER            PIC X(6) VALUE '48379A'.           
               10  FILLER            PIC X(6) VALUE '48383A'.           
               10  FILLER            PIC X(6) VALUE '48385A'.           
               10  FILLER            PIC X(6) VALUE '48387A'.           
               10  FILLER            PIC X(6) VALUE '48389A'.           
               10  FILLER            PIC X(6) VALUE '48391A'.           
               10  FILLER            PIC X(6) VALUE '48393A'.           
               10  FILLER            PIC X(6) VALUE '48399A'.           
               10  FILLER            PIC X(6) VALUE '48403A'.           
               10  FILLER            PIC X(6) VALUE '48405A'.           
               10  FILLER            PIC X(6) VALUE '48407A'.           
               10  FILLER            PIC X(6) VALUE '48411A'.           
               10  FILLER            PIC X(6) VALUE '48413A'.           
               10  FILLER            PIC X(6) VALUE '48415A'.           
               10  FILLER            PIC X(6) VALUE '48417A'.           
               10  FILLER            PIC X(6) VALUE '48419A'.           
               10  FILLER            PIC X(6) VALUE '48421A'.           
               10  FILLER            PIC X(6) VALUE '48425A'.           
               10  FILLER            PIC X(6) VALUE '48427A'.           
               10  FILLER            PIC X(6) VALUE '48429A'.           
               10  FILLER            PIC X(6) VALUE '48431A'.           
               10  FILLER            PIC X(6) VALUE '48433B'.           
               10  FILLER            PIC X(6) VALUE '48435A'.           
               10  FILLER            PIC X(6) VALUE '48437A'.           
               10  FILLER            PIC X(6) VALUE '48443A'.           
               10  FILLER            PIC X(6) VALUE '48445A'.           
               10  FILLER            PIC X(6) VALUE '48447A'.           
               10  FILLER            PIC X(6) VALUE '48449A'.           
               10  FILLER            PIC X(6) VALUE '48455A'.           
               10  FILLER            PIC X(6) VALUE '48457A'.           
               10  FILLER            PIC X(6) VALUE '48461A'.           
               10  FILLER            PIC X(6) VALUE '48463A'.           
               10  FILLER            PIC X(6) VALUE '48465A'.           
               10  FILLER            PIC X(6) VALUE '48467A'.           
               10  FILLER            PIC X(6) VALUE '48471A'.           
               10  FILLER            PIC X(6) VALUE '48475A'.           
               10  FILLER            PIC X(6) VALUE '48477A'.           
               10  FILLER            PIC X(6) VALUE '48481A'.           
               10  FILLER            PIC X(6) VALUE '48483A'.           
               10  FILLER            PIC X(6) VALUE '48487A'.           
               10  FILLER            PIC X(6) VALUE '48489A'.           
               10  FILLER            PIC X(6) VALUE '48495A'.           
               10  FILLER            PIC X(6) VALUE '48499A'.           
               10  FILLER            PIC X(6) VALUE '48501A'.           
               10  FILLER            PIC X(6) VALUE '48503A'.           
               10  FILLER            PIC X(6) VALUE '48505A'.           
               10  FILLER            PIC X(6) VALUE '48507A'.           
               10  FILLER            PIC X(6) VALUE '49001B'.           
               10  FILLER            PIC X(6) VALUE '49007C'.           
               10  FILLER            PIC X(6) VALUE '49009B'.           
               10  FILLER            PIC X(6) VALUE '49013B'.           
               10  FILLER            PIC X(6) VALUE '49015B'.           
               10  FILLER            PIC X(6) VALUE '49017B'.           
               10  FILLER            PIC X(6) VALUE '49019B'.           
               10  FILLER            PIC X(6) VALUE '49021C'.           
               10  FILLER            PIC X(6) VALUE '49025B'.           
               10  FILLER            PIC X(6) VALUE '49027B'.           
               10  FILLER            PIC X(6) VALUE '49031B'.           
               10  FILLER            PIC X(6) VALUE '49033A'.           
               10  FILLER            PIC X(6) VALUE '49037B'.           
               10  FILLER            PIC X(6) VALUE '49039C'.           
               10  FILLER            PIC X(6) VALUE '49041C'.           
               10  FILLER            PIC X(6) VALUE '49043C'.           
               10  FILLER            PIC X(6) VALUE '49047C'.           
               10  FILLER            PIC X(6) VALUE '49051C'.           
               10  FILLER            PIC X(6) VALUE '49055B'.           
               10  FILLER            PIC X(6) VALUE '50001A'.           
               10  FILLER            PIC X(6) VALUE '50003C'.           
               10  FILLER            PIC X(6) VALUE '50005C'.           
               10  FILLER            PIC X(6) VALUE '50009C'.           
               10  FILLER            PIC X(6) VALUE '50015C'.           
               10  FILLER            PIC X(6) VALUE '50017C'.           
               10  FILLER            PIC X(6) VALUE '50019C'.           
               10  FILLER            PIC X(6) VALUE '50021C'.           
               10  FILLER            PIC X(6) VALUE '50023C'.           
               10  FILLER            PIC X(6) VALUE '50025C'.           
               10  FILLER            PIC X(6) VALUE '50027C'.           
               10  FILLER            PIC X(6) VALUE '51001C'.           
               10  FILLER            PIC X(6) VALUE '51005C'.           
               10  FILLER            PIC X(6) VALUE '51017C'.           
               10  FILLER            PIC X(6) VALUE '51021C'.           
               10  FILLER            PIC X(6) VALUE '51025C'.           
               10  FILLER            PIC X(6) VALUE '51027A'.           
               10  FILLER            PIC X(6) VALUE '51029A'.           
               10  FILLER            PIC X(6) VALUE '51033A'.           
               10  FILLER            PIC X(6) VALUE '51035A'.           
               10  FILLER            PIC X(6) VALUE '51037C'.           
               10  FILLER            PIC X(6) VALUE '51049C'.           
               10  FILLER            PIC X(6) VALUE '51051A'.           
               10  FILLER            PIC X(6) VALUE '51057C'.           
               10  FILLER            PIC X(6) VALUE '51063A'.           
               10  FILLER            PIC X(6) VALUE '51077A'.           
               10  FILLER            PIC X(6) VALUE '51081A'.           
               10  FILLER            PIC X(6) VALUE '51083C'.           
               10  FILLER            PIC X(6) VALUE '51089C'.           
               10  FILLER            PIC X(6) VALUE '51091B'.           
               10  FILLER            PIC X(6) VALUE '51097C'.           
               10  FILLER            PIC X(6) VALUE '51099C'.           
               10  FILLER            PIC X(6) VALUE '51103C'.           
               10  FILLER            PIC X(6) VALUE '51105A'.           
               10  FILLER            PIC X(6) VALUE '51109C'.           
               10  FILLER            PIC X(6) VALUE '51111C'.           
               10  FILLER            PIC X(6) VALUE '51113C'.           
               10  FILLER            PIC X(6) VALUE '51117C'.           
               10  FILLER            PIC X(6) VALUE '51119C'.           
               10  FILLER            PIC X(6) VALUE '51131C'.           
               10  FILLER            PIC X(6) VALUE '51133C'.           
               10  FILLER            PIC X(6) VALUE '51135C'.           
               10  FILLER            PIC X(6) VALUE '51137C'.           
               10  FILLER            PIC X(6) VALUE '51139C'.           
               10  FILLER            PIC X(6) VALUE '51141C'.           
               10  FILLER            PIC X(6) VALUE '51143C'.           
               10  FILLER            PIC X(6) VALUE '51147C'.           
               10  FILLER            PIC X(6) VALUE '51159C'.           
               10  FILLER            PIC X(6) VALUE '51163C'.           
               10  FILLER            PIC X(6) VALUE '51167A'.           
               10  FILLER            PIC X(6) VALUE '51171C'.           
               10  FILLER            PIC X(6) VALUE '51173A'.           
               10  FILLER            PIC X(6) VALUE '51175C'.           
               10  FILLER            PIC X(6) VALUE '51181C'.           
               10  FILLER            PIC X(6) VALUE '51185A'.           
               10  FILLER            PIC X(6) VALUE '51193C'.           
               10  FILLER            PIC X(6) VALUE '51195A'.           
               10  FILLER            PIC X(6) VALUE '51197A'.           
               10  FILLER            PIC X(6) VALUE '51530C'.           
               10  FILLER            PIC X(6) VALUE '51580C'.           
               10  FILLER            PIC X(6) VALUE '51590C'.           
               10  FILLER            PIC X(6) VALUE '51595A'.           
               10  FILLER            PIC X(6) VALUE '51620C'.           
               10  FILLER            PIC X(6) VALUE '51640A'.           
               10  FILLER            PIC X(6) VALUE '51678C'.           
               10  FILLER            PIC X(6) VALUE '51690C'.           
               10  FILLER            PIC X(6) VALUE '51720A'.           
               10  FILLER            PIC X(6) VALUE '53001C'.           
               10  FILLER            PIC X(6) VALUE '53009C'.           
               10  FILLER            PIC X(6) VALUE '53013A'.           
               10  FILLER            PIC X(6) VALUE '53019B'.           
               10  FILLER            PIC X(6) VALUE '53023B'.           
               10  FILLER            PIC X(6) VALUE '53025C'.           
               10  FILLER            PIC X(6) VALUE '53027C'.           
               10  FILLER            PIC X(6) VALUE '53029C'.           
               10  FILLER            PIC X(6) VALUE '53031C'.           
               10  FILLER            PIC X(6) VALUE '53037C'.           
               10  FILLER            PIC X(6) VALUE '53039C'.           
               10  FILLER            PIC X(6) VALUE '53041C'.           
               10  FILLER            PIC X(6) VALUE '53043B'.           
               10  FILLER            PIC X(6) VALUE '53045C'.           
               10  FILLER            PIC X(6) VALUE '53047C'.           
               10  FILLER            PIC X(6) VALUE '53049C'.           
               10  FILLER            PIC X(6) VALUE '53051A'.           
               10  FILLER            PIC X(6) VALUE '53055C'.           
               10  FILLER            PIC X(6) VALUE '53069C'.           
               10  FILLER            PIC X(6) VALUE '53075C'.           
               10  FILLER            PIC X(6) VALUE '54001C'.           
               10  FILLER            PIC X(6) VALUE '54007C'.           
               10  FILLER            PIC X(6) VALUE '54013C'.           
               10  FILLER            PIC X(6) VALUE '54017C'.           
               10  FILLER            PIC X(6) VALUE '54021C'.           
               10  FILLER            PIC X(6) VALUE '54023C'.           
               10  FILLER            PIC X(6) VALUE '54025A'.           
               10  FILLER            PIC X(6) VALUE '54031C'.           
               10  FILLER            PIC X(6) VALUE '54033C'.           
               10  FILLER            PIC X(6) VALUE '54035C'.           
               10  FILLER            PIC X(6) VALUE '54041C'.           
               10  FILLER            PIC X(6) VALUE '54045C'.           
               10  FILLER            PIC X(6) VALUE '54047C'.           
               10  FILLER            PIC X(6) VALUE '54049C'.           
               10  FILLER            PIC X(6) VALUE '54053C'.           
               10  FILLER            PIC X(6) VALUE '54055C'.           
               10  FILLER            PIC X(6) VALUE '54059C'.           
               10  FILLER            PIC X(6) VALUE '54063C'.           
               10  FILLER            PIC X(6) VALUE '54065C'.           
               10  FILLER            PIC X(6) VALUE '54067C'.           
               10  FILLER            PIC X(6) VALUE '54071C'.           
               10  FILLER            PIC X(6) VALUE '54073C'.           
               10  FILLER            PIC X(6) VALUE '54075C'.           
               10  FILLER            PIC X(6) VALUE '54083C'.           
               10  FILLER            PIC X(6) VALUE '54085A'.           
               10  FILLER            PIC X(6) VALUE '54087C'.           
               10  FILLER            PIC X(6) VALUE '54089C'.           
               10  FILLER            PIC X(6) VALUE '54091C'.           
               10  FILLER            PIC X(6) VALUE '54093C'.           
               10  FILLER            PIC X(6) VALUE '54095C'.           
               10  FILLER            PIC X(6) VALUE '54097C'.           
               10  FILLER            PIC X(6) VALUE '54101C'.           
               10  FILLER            PIC X(6) VALUE '54103A'.           
               10  FILLER            PIC X(6) VALUE '54109C'.           
               10  FILLER            PIC X(6) VALUE '55001C'.           
               10  FILLER            PIC X(6) VALUE '55003C'.           
               10  FILLER            PIC X(6) VALUE '55005C'.           
               10  FILLER            PIC X(6) VALUE '55007C'.           
               10  FILLER            PIC X(6) VALUE '55011C'.           
               10  FILLER            PIC X(6) VALUE '55013C'.           
               10  FILLER            PIC X(6) VALUE '55019C'.           
               10  FILLER            PIC X(6) VALUE '55023C'.           
               10  FILLER            PIC X(6) VALUE '55027C'.           
               10  FILLER            PIC X(6) VALUE '55029C'.           
               10  FILLER            PIC X(6) VALUE '55033C'.           
               10  FILLER            PIC X(6) VALUE '55037C'.           
               10  FILLER            PIC X(6) VALUE '55041C'.           
               10  FILLER            PIC X(6) VALUE '55043C'.           
               10  FILLER            PIC X(6) VALUE '55047C'.           
               10  FILLER            PIC X(6) VALUE '55051C'.           
               10  FILLER            PIC X(6) VALUE '55053C'.           
               10  FILLER            PIC X(6) VALUE '55055C'.           
               10  FILLER            PIC X(6) VALUE '55057C'.           
               10  FILLER            PIC X(6) VALUE '55065C'.           
               10  FILLER            PIC X(6) VALUE '55067C'.           
               10  FILLER            PIC X(6) VALUE '55069C'.           
               10  FILLER            PIC X(6) VALUE '55071C'.           
               10  FILLER            PIC X(6) VALUE '55075C'.           
               10  FILLER            PIC X(6) VALUE '55077C'.           
               10  FILLER            PIC X(6) VALUE '55078C'.           
               10  FILLER            PIC X(6) VALUE '55081C'.           
               10  FILLER            PIC X(6) VALUE '55085C'.           
               10  FILLER            PIC X(6) VALUE '55091C'.           
               10  FILLER            PIC X(6) VALUE '55095C'.           
               10  FILLER            PIC X(6) VALUE '55097C'.           
               10  FILLER            PIC X(6) VALUE '55099C'.           
               10  FILLER            PIC X(6) VALUE '55103C'.           
               10  FILLER            PIC X(6) VALUE '55107C'.           
               10  FILLER            PIC X(6) VALUE '55111C'.           
               10  FILLER            PIC X(6) VALUE '55113C'.           
               10  FILLER            PIC X(6) VALUE '55115C'.           
               10  FILLER            PIC X(6) VALUE '55119C'.           
               10  FILLER            PIC X(6) VALUE '55121C'.           
               10  FILLER            PIC X(6) VALUE '55123C'.           
               10  FILLER            PIC X(6) VALUE '55125C'.           
               10  FILLER            PIC X(6) VALUE '55127C'.           
               10  FILLER            PIC X(6) VALUE '55129C'.           
               10  FILLER            PIC X(6) VALUE '55135C'.           
               10  FILLER            PIC X(6) VALUE '55137C'.           
               10  FILLER            PIC X(6) VALUE '55141C'.           
               10  FILLER            PIC X(6) VALUE '56001C'.           
               10  FILLER            PIC X(6) VALUE '56003B'.           
               10  FILLER            PIC X(6) VALUE '56005C'.           
               10  FILLER            PIC X(6) VALUE '56007B'.           
               10  FILLER            PIC X(6) VALUE '56009B'.           
               10  FILLER            PIC X(6) VALUE '56011B'.           
               10  FILLER            PIC X(6) VALUE '56013B'.           
               10  FILLER            PIC X(6) VALUE '56015B'.           
               10  FILLER            PIC X(6) VALUE '56017B'.           
               10  FILLER            PIC X(6) VALUE '56019B'.           
               10  FILLER            PIC X(6) VALUE '56023B'.           
               10  FILLER            PIC X(6) VALUE '56027B'.           
               10  FILLER            PIC X(6) VALUE '56029B'.           
               10  FILLER            PIC X(6) VALUE '56031B'.           
               10  FILLER            PIC X(6) VALUE '56033C'.           
               10  FILLER            PIC X(6) VALUE '56035B'.           
               10  FILLER            PIC X(6) VALUE '56037B'.           
               10  FILLER            PIC X(6) VALUE '56039B'.           
               10  FILLER            PIC X(6) VALUE '56041C'.           
               10  FILLER            PIC X(6) VALUE '56043B'.           
               10  FILLER            PIC X(6) VALUE '56045B'.           
               10  FILLER            PIC X(6) VALUE '66000C'.           
               10  FILLER            PIC X(6) VALUE '72001C'.           
               10  FILLER            PIC X(6) VALUE '72043C'.           
               10  FILLER            PIC X(6) VALUE '72049C'.           
               10  FILLER            PIC X(6) VALUE '72073C'.           
               10  FILLER            PIC X(6) VALUE '72083C'.           
               10  FILLER            PIC X(6) VALUE '72093C'.           
               10  FILLER            PIC X(6) VALUE '72123C'.           
               10  FILLER            PIC X(6) VALUE '72133C'.           
               10  FILLER            PIC X(6) VALUE '72147C'.           
               10  FILLER            PIC X(6) VALUE '78000C'.           
           05  FILLER     REDEFINES  T-STATE-COUNTY-CODE-DATA.          
               10  T-SCC-DATA         OCCURS    2018 TIMES              
                                      ASCENDING KEY IS T-SCC-CODE       
                                      INDEXED BY IX-SCC.                
                   15  T-SCC-CODE     PIC X(5).                         
                   15  T-SCC-CATEGORY PIC X(1).                         
                                                                        
