      ****************************************************
      * BLEND152 COPYBOOK: CONTAINS LTCH PROVIDERS WITH  *
      * THEIR BLENDED IPPS COMPARABLE WAGE INDEX.        *
      * FOR USE WITH LTCH PRICER VERSION 15.2            *
      ****************************************************
       01  W-IPPS-BLEND-WI-FILLS.
           03                          PIC X(36)   VALUE
               '012012008574072003012257072004011837'.
           03                          PIC X(36)   VALUE
               '072006011837092002010178092003010178'.
           03                          PIC X(36)   VALUE
               '142006010179192006008291192010008291'.
           03                          PIC X(36)   VALUE
               '192011008291192013007603192019007603'.
           03                          PIC X(36)   VALUE
               '192020007808192022007487192024007603'.
           03                          PIC X(36)   VALUE
               '192025008291192028007487192029007808'.
           03                          PIC X(36)   VALUE
               '192032007808192033007808192034007487'.
           03                          PIC X(36)   VALUE
               '192035007487192037007546192052007487'.
           03                          PIC X(36)   VALUE
               '232026008895232029008895252004007553'.
           03                          PIC X(36)   VALUE
               '252005007886252006007553252008007553'.
           03                          PIC X(36)   VALUE
               '252010007553252013007553312014011119'.
           03                          PIC X(36)   VALUE
               '312019012973312020011132312022011119'.
           03                          PIC X(36)   VALUE
               '312024011132332006012973332008012973'.
           03                          PIC X(36)   VALUE
               '332014012973332022012973342015008937'.
           03                          PIC X(36)   VALUE
               '342016008669342019007931392024008582'.
           03                          PIC X(36)   VALUE
               '392025008344392028008582392036008582'.
           03                          PIC X(36)   VALUE
               '392037008344392041008582392042008344'.
           03                          PIC X(36)   VALUE
               '392043008582392044008582392045008582'.
           03                          PIC X(36)   VALUE
               '392048010332392049008582412001011461'.
           03                          PIC X(36)   VALUE
               '422008008961422009008961442006008919'.
           03                          PIC X(36)   VALUE
               '442011008919442012007350442015007350'.
           03                          PIC X(36)   VALUE
               '442016007350512003008693522008011109'.
       01  W-IPPS-BLEND-WI-TBL REDEFINES W-IPPS-BLEND-WI-FILLS.
           03  IBW-ENTRY OCCURS 66 TIMES
                   ASCENDING KEY IS IBW-PROV
                   INDEXED BY IBW-INDX.
               05  IBW-PROV            PIC X(6).
               05  IBW-WAGE-INDEX      PIC S9(02)V9(04).
       01  IBW-MAX                     PIC S9(7)   COMP-3
                                       VALUE +66.
