       01  BUN-DATE-FILLER.
           05                               PIC X(44)  VALUE
               '20110101001201201010022013010100320140101004'.
           05                               PIC X(44)  VALUE
               '20150101005201601010062017010100720180101008'.
           05                               PIC X(33)  VALUE
               '201901010092020010101020210101011'.
       01  BUN-DATE-TABLE REDEFINES BUN-DATE-FILLER.
           05  BUN-DATE-ENTRY OCCURS 11 TIMES.
               10  BUN-DATE                 PIC  X(08).
               10  BUN-DATE-CODE            PIC  9(03).
       01  BUN-MAX-DATE                     PIC S9(07) COMP-3 VALUE +11.
       01  BUN-SUB                          PIC S9(07) COMP-3.
       01  BUN-CBSA-FILLER.
           05                               PIC  X(50) VALUE
               '     00000   0100011   0200022   0300033   0400044'.
           05                               PIC  X(50) VALUE
               '   0500055   0600066   0700077   0800081   1000092'.
           05                               PIC  X(50) VALUE
               '   1100103   1200114   1300125   1400136   1500147'.
           05                               PIC  X(50) VALUE
               '   1600158   1700169   1800180   1900191   2000202'.
           05                               PIC  X(50) VALUE
               '   2100213   2200224   2300235   2400246   2500257'.
           05                               PIC  X(50) VALUE
               '   2600268   2700279   2800290   2900301   3000312'.
           05                               PIC  X(50) VALUE
               '   3200323   3300334   3400345   3500356   3600367'.
           05                               PIC  X(50) VALUE
               '   3700378   3800389   3900400   4000411   4200422'.
           05                               PIC  X(50) VALUE
               '   4300433   4400444   4500455   4600466   4700477'.
           05                               PIC  X(50) VALUE
               '   4800488   4900499   5000510   5100521   5200532'.
           05                               PIC  X(50) VALUE
               '   5300543   5500545   6400553   6500561   6600569'.
           05                               PIC  X(50) VALUE
               '   6700571   6800573   6900575   7000577   7100579'.
           05                               PIC  X(50) VALUE
               '   7200581   7300583   7400585   7500587   7600589'.
           05                               PIC  X(50) VALUE
               '   7700591   7800593   800059510180006061038000617'.
           05                               PIC  X(50) VALUE
               '10420006281050000639105400064610580006571074000668'.
           05                               PIC  X(50) VALUE
               '10780006791090000690110200070111100007121118000723'.
           05                               PIC  X(50) VALUE
               '11244007301126000741113000074511340007491146000760'.
           05                               PIC  X(50) VALUE
               '11500007711154000782116400078911700008001202000811'.
           05                               PIC  X(50) VALUE
               '12060008221210000833122200084412260008551242000866'.
           05                               PIC  X(50) VALUE
               '12540008771258000888126200089912700009101294000921'.
           05                               PIC  X(50) VALUE
               '12980009321302000943131400095413220009611338000972'.
           05                               PIC  X(50) VALUE
               '13460009831364400987137400099813780010091382001020'.
           05                               PIC  X(50) VALUE
               '13900010311398001042140100104914020010601406001064'.
           05                               PIC  X(50) VALUE
               '14100010711426001082144540108914484010931450001104'.
           05                               PIC  X(50) VALUE
               '14540011151474001126148600113715180011481526001159'.
           05                               PIC  X(50) VALUE
               '15380011701550001181155400119215680011991576401210'.
           05                               PIC  X(50) VALUE
               '15804012211594001232159800124316020012541606001261'.
           05                               PIC  X(50) VALUE
               '16180012721622001283163000129416540013011658001312'.
           05                               PIC  X(50) VALUE
               '16620013231670001334167400134516820013561686001367'.
           05                               PIC  X(50) VALUE
               '16940013781697401388169840138917020014001714001411'.
           05                               PIC  X(50) VALUE
               '17300014221742001433174600144417660014551778001466'.
           05                               PIC  X(50) VALUE
               '17820014771786001488179000149917980015101802001521'.
           05                               PIC  X(50) VALUE
               '18140015321858001543187000155418880015651906001576'.
           05                               PIC  X(50) VALUE
               '19124015871914001598191800160919260016131930001620'.
           05                               PIC  X(50) VALUE
               '19340016311938001641194300164219460016531950001664'.
           05                               PIC  X(50) VALUE
               '19660016751974001686197800169719804017082002001719'.
           05                               PIC  X(50) VALUE
               '20100017302022001741202600175220500017632052401769'.
           05                               PIC  X(50) VALUE
               '20700017762074001787207640179120940018022099401809'.
           05                               PIC  X(50) VALUE
               '21060018202114001831213000184221340018532142001858'.
           05                               PIC  X(50) VALUE
               '21500018692166001880217800189121820019022194001906'.
           05                               PIC  X(50) VALUE
               '22020019172214001928221800193922220019502238001961'.
           05                               PIC  X(50) VALUE
               '22420019722250001983225200199422540020052266002016'.
           05                               PIC  X(50) VALUE
               '22744020272290002038230600204923104020602322402061'.
           05                               PIC  X(50) VALUE
               '23420020722346002083235400209423580021052384402116'.
           05                               PIC  X(50) VALUE
               '23900021232402002134241400214524220021562426002163'.
           05                               PIC  X(50) VALUE
               '24300021742434002185244200219224500022032454002214'.
           05                               PIC  X(50) VALUE
               '24580022252466002236247800224724860022582502002269'.
           05                               PIC  X(50) VALUE
               '25060022802518002291252200229825260023092542002320'.
           05                               PIC  X(50) VALUE
               '25500023312554002342256200235325860023642594002371'.
           05                               PIC  X(50) VALUE
               '25980023822610002386261400239326180023972630002408'.
           05                               PIC  X(50) VALUE
               '26380024192642002430265800244126620024522682002463'.
           05                               PIC  X(50) VALUE
               '26900024742698002485270600249627100025072714002518'.
           05                               PIC  X(50) VALUE
               '27180025292726002540273400255127500025622762002573'.
           05                               PIC  X(50) VALUE
               '27740025842778002595278600260627900026172798002624'.
           05                               PIC  X(50) VALUE
               '28020026352810002646281400265728420026682866002679'.
           05                               PIC  X(50) VALUE
               '28700026902874002701289400271229020027232910002734'.
           05                               PIC  X(50) VALUE
               '29140027382918002749292000275629340027672940402778'.
           05                               PIC  X(50) VALUE
               '29420027892946002800295400281129620028222970002833'.
           05                               PIC  X(50) VALUE
               '29740028442982002855299400286630020028773014002888'.
           05                               PIC  X(50) VALUE
               '30300028993034002910304600292130620029323070002943'.
           05                               PIC  X(50) VALUE
               '30780029543086002965309800297631020029873108402998'.
           05                               PIC  X(50) VALUE
               '31140030093118003020313400303131420030423146003053'.
           05                               PIC  X(50) VALUE
               '31540030643170003075317400308631860030973190003108'.
           05                               PIC  X(50) VALUE
               '32420031193258003130327800314132820031523290003163'.
           05                               PIC  X(50) VALUE
               '33124031743314003185332200319233260032033334003214'.
           05                               PIC  X(50) VALUE
               '33460032253354003236336600324733700032583374003269'.
           05                               PIC  X(50) VALUE
               '33780032803386003291338740329834060033093410003320'.
           05                               PIC  X(50) VALUE
               '34580033313462003342347400335334820033643490003375'.
           05                               PIC  X(50) VALUE
               '34940033863498003397350040340835084034193510003426'.
           05                               PIC  X(50) VALUE
               '35154034273530003438353800344935614034563564403460'.
           05                               PIC  X(50) VALUE
               '35660034713584003482359800349336084035043610003515'.
           05                               PIC  X(50) VALUE
               '36140035263622003537362600354836420035593650003570'.
           05                               PIC  X(50) VALUE
               '36540035813674003592367800360336980036143710003625'.
           05                               PIC  X(50) VALUE
               '37340036363738003640374600365137620036623770003666'.
           05                               PIC  X(50) VALUE
               '37764036703786003681379000369237964037033806003714'.
           05                               PIC  X(50) VALUE
               '38220037253830003736383400374738540037583866003769'.
           05                               PIC  X(50) VALUE
               '38860037803890003791389400380239100038073914003817'.
           05                               PIC  X(50) VALUE
               '39150038183930003829393400384039380038513946003862'.
           05                               PIC  X(50) VALUE
               '39540038733958003884396600389539740039063982003917'.
           05                               PIC  X(50) VALUE
               '39900039284006003939401400395040220039614034003972'.
           05                               PIC  X(50) VALUE
               '40380039834042003994404840400540580040164066004027'.
           05                               PIC  X(50) VALUE
               '40900040384098004049410600406041100040714114004082'.
           05                               PIC  X(50) VALUE
               '41180040934142004104415000411541540041264162004137'.
           05                               PIC  X(50) VALUE
               '41660041484170004159417400417041780041744188404185'.
           05                               PIC  X(50) VALUE
               '41900041964194004207419800421842020042294203404236'.
           05                               PIC  X(50) VALUE
               '42044042404206004244421000425542140042664220004273'.
           05                               PIC  X(50) VALUE
               '42220042844234004295425400430642644043174268004328'.
           05                               PIC  X(50) VALUE
               '42700043354310004346433000435743340043684342004375'.
           05                               PIC  X(50) VALUE
               '43524043814358004392436200440343780044144390004425'.
           05                               PIC  X(50) VALUE
               '44060044364410004447441400445844180044694422004480'.
           05                               PIC  X(50) VALUE
               '44300044914442004498446000450244700045134494004524'.
           05                               PIC  X(50) VALUE
               '45060045354510404546452200455745300045684546004579'.
           05                               PIC  X(50) VALUE
               '45500045904554004597457800460845820046194594004630'.
           05                               PIC  X(50) VALUE
               '46060046414614004652462200466346300046664634004677'.
           05                               PIC  X(50) VALUE
               '46520046844654004695466600470646700047174702004728'.
           05                               PIC  X(50) VALUE
               '47220047394726004750473000476147380047724746004779'.
           05                               PIC  X(50) VALUE
               '47580047904764404794476640480147894048124794004823'.
           05                               PIC  X(50) VALUE
               '48060048304814004841482600484848300048594842404870'.
           05                               PIC  X(50) VALUE
               '48540048814862004892486600490348700049144886404925'.
           05                               PIC  X(50) VALUE
               '48900049364902004947491800495849340049694942004980'.
           05                               PIC  X(50) VALUE
               '49500049854962004996496600500749700050184974005029'.
       01  BUN-CBSA-TABLE REDEFINES BUN-CBSA-FILLER.
           05  BUN-CBSA-ENTRY OCCURS 505 TIMES
                   ASCENDING KEY IS BUN-CBSA-VALUE
                   INDEXED BY BUN-INDX.
               10  BUN-CBSA-VALUE           PIC  X(05).
               10  BUN-PTR                  PIC  9(05).
       01  BUN-MAX                         PIC S9(07) COMP-3 VALUE +505.
       01  BUN-WAGE-INDEX-FILLER.
           05                               PIC  X(32) VALUE
               '00107380002072600030712100407147'.
           05                               PIC  X(32) VALUE
               '00506914006069100070687300806828'.
           05                               PIC  X(32) VALUE
               '00906731010066420110672400112626'.
           05                               PIC  X(32) VALUE
               '00212846003128070041366200513175'.
           05                               PIC  X(32) VALUE
               '00613214007143660081344300911963'.
           05                               PIC  X(32) VALUE
               '01012688011124960010909500208826'.
           05                               PIC  X(32) VALUE
               '00309182004091660050921900609034'.
           05                               PIC  X(32) VALUE
               '00708892008089020090918101009169'.
           05                               PIC  X(32) VALUE
               '01108756001072220020719400307350'.
           05                               PIC  X(32) VALUE
               '00407343005073110060721900707263'.
           05                               PIC  X(32) VALUE
               '00807079009070210100727801107102'.
           05                               PIC  X(32) VALUE
               '00112056002121940031256700412788'.
           05                               PIC  X(32) VALUE
               '00513215006132910071301500813002'.
           05                               PIC  X(32) VALUE
               '00912783010128900111305300109933'.
           05                               PIC  X(32) VALUE
               '00210126003102080040980200509646'.
           05                               PIC  X(32) VALUE
               '00609746007100030081012000910075'.
           05                               PIC  X(32) VALUE
               '01010081011100860011112800211287'.
           05                               PIC  X(32) VALUE
               '00311128004113110051129500611149'.
           05                               PIC  X(32) VALUE
               '00711145008109610091077501010301'.
           05                               PIC  X(32) VALUE
               '01110004001097570021000800310171'.
           05                               PIC  X(32) VALUE
               '00410092001084090020836100308062'.
           05                               PIC  X(32) VALUE
               '00407985005083710060829400708146'.
           05                               PIC  X(32) VALUE
               '00808242009082090100819001108259'.
           05                               PIC  X(32) VALUE
               '00107566002075470030742100407459'.
           05                               PIC  X(32) VALUE
               '00507439006074330070742000807355'.
           05                               PIC  X(32) VALUE
               '00907325010074040110718100111189'.
           05                               PIC  X(32) VALUE
               '00211200003107280041073900510872'.
           05                               PIC  X(32) VALUE
               '00610937007111430081142100911748'.
           05                               PIC  X(32) VALUE
               '01012238011125840010755600207531'.
           05                               PIC  X(32) VALUE
               '00307583004076050050739800606872'.
           05                               PIC  X(32) VALUE
               '00707320008075820090795301008009'.
           05                               PIC  X(32) VALUE
               '01107826001083430020842600308438'.
           05                               PIC  X(32) VALUE
               '00408434005083690060848800708524'.
           05                               PIC  X(32) VALUE
               '00808508009084910100824201108297'.
           05                               PIC  X(32) VALUE
               '00108391002085510030847200408513'.
           05                               PIC  X(32) VALUE
               '00508416006082970070816700808088'.
           05                               PIC  X(32) VALUE
               '00908237010083190110835400108545'.
           05                               PIC  X(32) VALUE
               '00208618003083510040843400508451'.
           05                               PIC  X(32) VALUE
               '00608412007082540080836000908342'.
           05                               PIC  X(32) VALUE
               '01008402011084030010798100208041'.
           05                               PIC  X(32) VALUE
               '00307997004079290050777900607688'.
           05                               PIC  X(32) VALUE
               '00707688008077260090778101007667'.
           05                               PIC  X(32) VALUE
               '01107776001078300020782500307877'.
           05                               PIC  X(32) VALUE
               '00407784005077480060774200707905'.
           05                               PIC  X(32) VALUE
               '00807825009079400100798101107915'.
           05                               PIC  X(32) VALUE
               '00107712002077490030771800407585'.
           05                               PIC  X(32) VALUE
               '00507108006069590070705000806972'.
           05                               PIC  X(32) VALUE
               '00907012010069560110696900108588'.
           05                               PIC  X(32) VALUE
               '00208581003083000040823800508583'.
           05                               PIC  X(32) VALUE
               '00608477007084060080846800908617'.
           05                               PIC  X(32) VALUE
               '01008411011084360010917500209291'.
           05                               PIC  X(32) VALUE
               '00308797004086960050874600608673'.
           05                               PIC  X(32) VALUE
               '00708738008088930090888301008846'.
           05                               PIC  X(32) VALUE
               '01108626001117690021396200313540'.
           05                               PIC  X(32) VALUE
               '00413614005115530061123500710836'.
           05                               PIC  X(32) VALUE
               '00811066009107600101105901112929'.
           05                               PIC  X(32) VALUE
               '00108555002082950030838700408270'.
           05                               PIC  X(32) VALUE
               '00508288006083800070838200808413'.
           05                               PIC  X(32) VALUE
               '00908430010083680110848200109038'.
           05                               PIC  X(32) VALUE
               '00209107003090530040913300509124'.
           05                               PIC  X(32) VALUE
               '00609020007090420080900100909008'.
           05                               PIC  X(32) VALUE
               '01009045011090850010762000207539'.
           05                               PIC  X(32) VALUE
               '00307537004075680050757000607420'.
           05                               PIC  X(32) VALUE
               '00707500008074810090732001007497'.
           05                               PIC  X(32) VALUE
               '01107464001076550020767300307622'.
           05                               PIC  X(32) VALUE
               '00407775005077250060773200707776'.
           05                               PIC  X(32) VALUE
               '00807755009077750100785501107778'.
           05                               PIC  X(32) VALUE
               '00108517002086150030860000409098'.
           05                               PIC  X(32) VALUE
               '00509024006092110070929300808953'.
           05                               PIC  X(32) VALUE
               '00908321010086920110856900108911'.
           05                               PIC  X(32) VALUE
               '00208872003087330040885500508877'.
           05                               PIC  X(32) VALUE
               '00608451007088590080884400908880'.
           05                               PIC  X(32) VALUE
               '01008934011088760010935000209637'.
           05                               PIC  X(32) VALUE
               '00309739004097810050951600609299'.
           05                               PIC  X(32) VALUE
               '00708979008078900090886501008988'.
           05                               PIC  X(32) VALUE
               '01110647001102070021044100310372'.
           05                               PIC  X(32) VALUE
               '00410339005103860061004100710212'.
           05                               PIC  X(32) VALUE
               '00810633009103570101005701110141'.
           05                               PIC  X(32) VALUE
               '00108911002088780030887900408922'.
           05                               PIC  X(32) VALUE
               '00508811006085130070848300808481'.
           05                               PIC  X(32) VALUE
               '00908624010087710110870100108185'.
           05                               PIC  X(32) VALUE
               '00208152003081990040822000508192'.
           05                               PIC  X(32) VALUE
               '00608247007084080080849900908499'.
           05                               PIC  X(32) VALUE
               '01008448011085950010835900208288'.
           05                               PIC  X(32) VALUE
               '00308271004081000050789900607963'.
           05                               PIC  X(32) VALUE
               '00707958008077970090783301007798'.
           05                               PIC  X(32) VALUE
               '01107926001068310020729500306891'.
           05                               PIC  X(32) VALUE
               '00406785005070990060740900707698'.
           05                               PIC  X(32) VALUE
               '00807941009084930100850401108368'.
           05                               PIC  X(32) VALUE
               '00108561002084550030847000408377'.
           05                               PIC  X(32) VALUE
               '00508348006083070070825100808053'.
           05                               PIC  X(32) VALUE
               '00908022010081040110809400107860'.
           05                               PIC  X(32) VALUE
               '00207848003077830040770400507799'.
           05                               PIC  X(32) VALUE
               '00607632007078380080772800907695'.
           05                               PIC  X(32) VALUE
               '01007703011077230011002900210337'.
           05                               PIC  X(32) VALUE
               '00309500004094350050994900610103'.
           05                               PIC  X(32) VALUE
               '00710499008105230091061201010561'.
           05                               PIC  X(32) VALUE
               '01110691001084800020845000308380'.
           05                               PIC  X(32) VALUE
               '00408430005080830060808700708048'.
           05                               PIC  X(32) VALUE
               '00807948009079620100798401108019'.
           05                               PIC  X(32) VALUE
               '00106000002055000030500000404500'.
           05                               PIC  X(32) VALUE
               '00504000006040000070400000804000'.
           05                               PIC  X(32) VALUE
               '00905000010050000110500000108413'.
           05                               PIC  X(32) VALUE
               '00208277003083380040832900508370'.
           05                               PIC  X(32) VALUE
               '00608242007081810080809800908150'.
           05                               PIC  X(32) VALUE
               '01008305011080650010853600208300'.
           05                               PIC  X(32) VALUE
               '00308124004081640050831200608032'.
           05                               PIC  X(32) VALUE
               '00708213008078150090780001007886'.
           05                               PIC  X(32) VALUE
               '01108030001078860020773400307559'.
           05                               PIC  X(32) VALUE
               '00407444005072770060732900707252'.
           05                               PIC  X(32) VALUE
               '00807207009071300100707601107146'.
           05                               PIC  X(32) VALUE
               '00107806002079340030797800407874'.
           05                               PIC  X(32) VALUE
               '00507847006077660070778300807884'.
           05                               PIC  X(32) VALUE
               '00908139010081310110821100108649'.
           05                               PIC  X(32) VALUE
               '00208719003085160040873200509005'.
           05                               PIC  X(32) VALUE
               '00609259007091300080909100908872'.
           05                               PIC  X(32) VALUE
               '01008896011087140010959100209709'.
           05                               PIC  X(32) VALUE
               '00309725004097400050952700609680'.
           05                               PIC  X(32) VALUE
               '00709641008098950090982001009611'.
           05                               PIC  X(32) VALUE
               '01109713001079930020750500307185'.
           05                               PIC  X(32) VALUE
               '00407060005070910060683800707108'.
           05                               PIC  X(32) VALUE
               '00806742009073980100696401107032'.
           05                               PIC  X(32) VALUE
               '00107841002078170030772800407758'.
           05                               PIC  X(32) VALUE
               '00507554006076090070759300807689'.
           05                               PIC  X(32) VALUE
               '00907661010076690110773400110184'.
           05                               PIC  X(32) VALUE
               '00210231003100920041052900510877'.
           05                               PIC  X(32) VALUE
               '00610878007106440081050700910402'.
           05                               PIC  X(32) VALUE
               '01010179011102920010747400207371'.
           05                               PIC  X(32) VALUE
               '00307333004074070050727400607368'.
           05                               PIC  X(32) VALUE
               '00707303008073500090735401007300'.
           05                               PIC  X(32) VALUE
               '01107387001091860020897700309142'.
           05                               PIC  X(32) VALUE
               '00408904005090870060888400709301'.
           05                               PIC  X(32) VALUE
               '00809073009089500100883201109218'.
           05                               PIC  X(32) VALUE
               '00109528002094330030923800409243'.
           05                               PIC  X(32) VALUE
               '00509291006091400070917900809416'.
           05                               PIC  X(32) VALUE
               '00909407010096020110945000112056'.
           05                               PIC  X(32) VALUE
               '00212194004096110050961100609611'.
           05                               PIC  X(32) VALUE
               '00709611008096110090961101009611'.
           05                               PIC  X(32) VALUE
               '01109611004096110050961100609611'.
           05                               PIC  X(32) VALUE
               '00709611008096110090961101009611'.
           05                               PIC  X(32) VALUE
               '01109611004096110050961100609611'.
           05                               PIC  X(32) VALUE
               '00709611008096110090961101009611'.
           05                               PIC  X(32) VALUE
               '01109611001078060020793400108409'.
           05                               PIC  X(32) VALUE
               '00208361001084090020836100107981'.
           05                               PIC  X(32) VALUE
               '00208041001077120020774900108561'.
           05                               PIC  X(32) VALUE
               '00208455001084800020845000107806'.
           05                               PIC  X(32) VALUE
               '00207934001120560021219400108545'.
           05                               PIC  X(32) VALUE
               '00208618001090380020910700108343'.
           05                               PIC  X(32) VALUE
               '00208426001091750020929100108003'.
           05                               PIC  X(32) VALUE
               '00208444003083240040822500507440'.
           05                               PIC  X(32) VALUE
               '00608205007082090080832800908214'.
           05                               PIC  X(32) VALUE
               '01008520011083370010600000205500'.
           05                               PIC  X(32) VALUE
               '00305000004045000050400000604000'.
           05                               PIC  X(32) VALUE
               '00704000008040000090500001005000'.
           05                               PIC  X(32) VALUE
               '01105000001088430020881400308729'.
           05                               PIC  X(32) VALUE
               '00408521005085390060848700708337'.
           05                               PIC  X(32) VALUE
               '00808259009082890100833201108237'.
           05                               PIC  X(32) VALUE
               '00109036002086870030843500408713'.
           05                               PIC  X(32) VALUE
               '00508128006091820070926700808863'.
           05                               PIC  X(32) VALUE
               '00908615010080700110820600510879'.
           05                               PIC  X(32) VALUE
               '00610764007106580081082600910890'.
           05                               PIC  X(32) VALUE
               '01010831011106910010865300208680'.
           05                               PIC  X(32) VALUE
               '00308647004086000050845300608400'.
           05                               PIC  X(32) VALUE
               '00708217008081650090811201008239'.
           05                               PIC  X(32) VALUE
               '01108259001094560020955000309542'.
           05                               PIC  X(32) VALUE
               '00409663005094780060926100709131'.
           05                               PIC  X(32) VALUE
               '00809073009091300100908101108699'.
           05                               PIC  X(32) VALUE
               '00107995002080260030785700407788'.
           05                               PIC  X(32) VALUE
               '00507813006081100070794800808355'.
           05                               PIC  X(32) VALUE
               '00908888010085540110852700109194'.
           05                               PIC  X(32) VALUE
               '00209260003090840040921500509121'.
           05                               PIC  X(32) VALUE
               '00609074007091760080923700909235'.
           05                               PIC  X(32) VALUE
               '01009470011095010010862000208917'.
           05                               PIC  X(32) VALUE
               '00308898004091010050934500610436'.
           05                               PIC  X(32) VALUE
               '00710620008106860091034501009346'.
           05                               PIC  X(32) VALUE
               '01108434001086440020871400308506'.
           05                               PIC  X(32) VALUE
               '00408302005082770060818900708216'.
           05                               PIC  X(32) VALUE
               '00808348009081570100841101108131'.
           05                               PIC  X(32) VALUE
               '00109970002100090030959500409425'.
           05                               PIC  X(32) VALUE
               '00509331006093760070933500809262'.
           05                               PIC  X(32) VALUE
               '00909418010091990110921400512010'.
           05                               PIC  X(32) VALUE
               '00611794007121530081239300912565'.
           05                               PIC  X(32) VALUE
               '01012578011126090011196400212133'.
           05                               PIC  X(32) VALUE
               '00312147004122210051241900613277'.
           05                               PIC  X(32) VALUE
               '00713162008125420091218301012290'.
           05                               PIC  X(32) VALUE
               '01112194001091920020926600309547'.
           05                               PIC  X(32) VALUE
               '00409654001086910020852400308929'.
           05                               PIC  X(32) VALUE
               '00408766001101240021012800310115'.
           05                               PIC  X(32) VALUE
               '00410086005102190060995900709909'.
           05                               PIC  X(32) VALUE
               '00809894009100190100996801109916'.
           05                               PIC  X(32) VALUE
               '00107918002079790030753900407402'.
           05                               PIC  X(32) VALUE
               '00507466006070730070725900806864'.
           05                               PIC  X(32) VALUE
               '00907301010075630110719000109361'.
           05                               PIC  X(32) VALUE
               '00209226003092680040944500509626'.
           05                               PIC  X(32) VALUE
               '00609390007092760080944900909264'.
           05                               PIC  X(32) VALUE
               '01009108011090300050421300604128'.
           05                               PIC  X(32) VALUE
               '00704000008042370090500001005000'.
           05                               PIC  X(32) VALUE
               '01105000001090010020891800308555'.
           05                               PIC  X(32) VALUE
               '00408511005085310060859300708678'.
           05                               PIC  X(32) VALUE
               '00808663009089490100878001108701'.
           05                               PIC  X(32) VALUE
               '00109659002096420030948800409244'.
           05                               PIC  X(32) VALUE
               '00508774006089860070906300808587'.
           05                               PIC  X(32) VALUE
               '00908689010088910110871400109549'.
           05                               PIC  X(32) VALUE
               '00209575003095170040945200509369'.
           05                               PIC  X(32) VALUE
               '00609281007093220080936700909490'.
           05                               PIC  X(32) VALUE
               '01009371011094630011112900211033'.
           05                               PIC  X(32) VALUE
               '00311977004122580051169200611679'.
           05                               PIC  X(32) VALUE
               '00711931008119140091256901012068'.
           05                               PIC  X(32) VALUE
               '01111734001071900020787700307437'.
           05                               PIC  X(32) VALUE
               '00407771005080710060763300707422'.
           05                               PIC  X(32) VALUE
               '00807452009075100100678201106996'.
           05                               PIC  X(32) VALUE
               '00109538002095290030937300409150'.
           05                               PIC  X(32) VALUE
               '00509225006093720070880500809055'.
           05                               PIC  X(32) VALUE
               '00908810010088260110865300109514'.
           05                               PIC  X(32) VALUE
               '00209535003097460040957600509545'.
           05                               PIC  X(32) VALUE
               '00609608007096750080988200909553'.
           05                               PIC  X(32) VALUE
               '01009396011094760011170700211817'.
           05                               PIC  X(32) VALUE
               '00311611004115790051194400612201'.
           05                               PIC  X(32) VALUE
               '00711899008119930091243601012417'.
           05                               PIC  X(32) VALUE
               '01112090001102550021015100310147'.
           05                               PIC  X(32) VALUE
               '00409873005099500060972500709583'.
           05                               PIC  X(32) VALUE
               '00809506009095680100958101109521'.
           05                               PIC  X(32) VALUE
               '00109777002099790031018400409710'.
           05                               PIC  X(32) VALUE
               '00509825006099800070999000810061'.
           05                               PIC  X(32) VALUE
               '00909769010102380111002200112823'.
           05                               PIC  X(32) VALUE
               '00212838003128430041300700513124'.
           05                               PIC  X(32) VALUE
               '00613393007127270081324800912989'.
           05                               PIC  X(32) VALUE
               '01012602011121450010858300208523'.
           05                               PIC  X(32) VALUE
               '00308147004080780050797600608061'.
           05                               PIC  X(32) VALUE
               '00707974008076780090796101007988'.
           05                               PIC  X(32) VALUE
               '01107988001096560020993500309912'.
           05                               PIC  X(32) VALUE
               '00409915005101120061050600710134'.
           05                               PIC  X(32) VALUE
               '00809002009095410100894801108986'.
           05                               PIC  X(32) VALUE
               '00109221002089270030918100409486'.
           05                               PIC  X(32) VALUE
               '00509630006097850070984100809886'.
           05                               PIC  X(32) VALUE
               '00909150010093320110924200108488'.
           05                               PIC  X(32) VALUE
               '00208723003085330040859800508508'.
           05                               PIC  X(32) VALUE
               '00608287007083890080856200908927'.
           05                               PIC  X(32) VALUE
               '01008529011086640050802400607921'.
           05                               PIC  X(32) VALUE
               '00707630008078110090778701007493'.
           05                               PIC  X(32) VALUE
               '01107723001113900021174800311415'.
           05                               PIC  X(32) VALUE
               '00411890005124030061269600713037'.
           05                               PIC  X(32) VALUE
               '00812092009121050101208901112149'.
           05                               PIC  X(32) VALUE
               '00111372002113950031111900411807'.
           05                               PIC  X(32) VALUE
               '00511710006119710071198000811947'.
           05                               PIC  X(32) VALUE
               '00911669010116250111144900110525'.
           05                               PIC  X(32) VALUE
               '00210305003103740041031900108674'.
           05                               PIC  X(32) VALUE
               '00208576003087370040869100508686'.
           05                               PIC  X(32) VALUE
               '00608757007088550080880000908996'.
           05                               PIC  X(32) VALUE
               '01009224011092870010871900208731'.
           05                               PIC  X(32) VALUE
               '00308707004086020050847600608158'.
           05                               PIC  X(32) VALUE
               '00708521008084450090835901008409'.
           05                               PIC  X(32) VALUE
               '01108343001086110020843600308516'.
           05                               PIC  X(32) VALUE
               '00408367005081890060824600708118'.
           05                               PIC  X(32) VALUE
               '00808168009081410100783201108147'.
           05                               PIC  X(32) VALUE
               '00107348002072320030726100407282'.
           05                               PIC  X(32) VALUE
               '00507216006071100070782000807903'.
           05                               PIC  X(32) VALUE
               '00908328010086470110856400108314'.
           05                               PIC  X(32) VALUE
               '00208281003083480040831900508473'.
           05                               PIC  X(32) VALUE
               '00608503007083880080839900908571'.
           05                               PIC  X(32) VALUE
               '01008669011087650050916500609086'.
           05                               PIC  X(32) VALUE
               '00709226008092550090936001009235'.
           05                               PIC  X(32) VALUE
               '01109114001089890020872500308752'.
           05                               PIC  X(32) VALUE
               '00409304005090620060916900708881'.
           05                               PIC  X(32) VALUE
               '00808561009094600100881001109302'.
           05                               PIC  X(32) VALUE
               '00109439002094770030950200409310'.
           05                               PIC  X(32) VALUE
               '00509347006089910070946200808782'.
           05                               PIC  X(32) VALUE
               '00909089010088910110854900109273'.
           05                               PIC  X(32) VALUE
               '00209279003088970040925900509205'.
           05                               PIC  X(32) VALUE
               '00609329007090850080887400909258'.
           05                               PIC  X(32) VALUE
               '01009242011092890051267900613028'.
           05                               PIC  X(32) VALUE
               '00713086008128970091255801012426'.
           05                               PIC  X(32) VALUE
               '01112220001121780021228300312378'.
           05                               PIC  X(32) VALUE
               '00412453001100650021008600310574'.
           05                               PIC  X(32) VALUE
               '00409850005099070060977400710303'.
           05                               PIC  X(32) VALUE
               '00810207009102960101022601110574'.
           05                               PIC  X(32) VALUE
               '00108666002085990030866500408573'.
           05                               PIC  X(32) VALUE
               '00508410006082440070829700808229'.
           05                               PIC  X(32) VALUE
               '00908125010081530110844000110667'.
           05                               PIC  X(32) VALUE
               '00211288003108290041026800510836'.
           05                               PIC  X(32) VALUE
               '00611100007111970081101500910748'.
           05                               PIC  X(32) VALUE
               '01010964011114510011254700212914'.
           05                               PIC  X(32) VALUE
               '00313170004132520051328900613346'.
           05                               PIC  X(32) VALUE
               '00713223008129250091261401012331'.
           05                               PIC  X(32) VALUE
               '01112070001091730020918300308612'.
           05                               PIC  X(32) VALUE
               '00408179005078760060837300708228'.
           05                               PIC  X(32) VALUE
               '00808454009085260100854701108471'.
           05                               PIC  X(32) VALUE
               '00109209002090680030879200408457'.
           05                               PIC  X(32) VALUE
               '00508486006085410070821300807980'.
           05                               PIC  X(32) VALUE
               '00908400010081010110759700109530'.
           05                               PIC  X(32) VALUE
               '00209750003099990041004500510240'.
           05                               PIC  X(32) VALUE
               '00610435007105060081059600910393'.
           05                               PIC  X(32) VALUE
               '01010487011104420010886300208665'.
           05                               PIC  X(32) VALUE
               '00308485004085290050859000608539'.
           05                               PIC  X(32) VALUE
               '00708462008084640090849901008434'.
           05                               PIC  X(32) VALUE
               '01108628001099470021002100309997'.
           05                               PIC  X(32) VALUE
               '00410130005101210061015400710256'.
           05                               PIC  X(32) VALUE
               '00810043009100180100975301110049'.
           05                               PIC  X(32) VALUE
               '00508593006093670070908300809200'.
           05                               PIC  X(32) VALUE
               '00908664010095000110870600111250'.
           05                               PIC  X(32) VALUE
               '00211210003112620041114600511159'.
           05                               PIC  X(32) VALUE
               '00611143007110110081094900911133'.
           05                               PIC  X(32) VALUE
               '01011025011108640011038600210202'.
           05                               PIC  X(32) VALUE
               '00310474004102540051028700610117'.
           05                               PIC  X(32) VALUE
               '00710997008107760091072001010629'.
           05                               PIC  X(32) VALUE
               '01110941001087490020893900308834'.
           05                               PIC  X(32) VALUE
               '00408730005085210060846900708407'.
           05                               PIC  X(32) VALUE
               '00808295009080600100820301108197'.
           05                               PIC  X(32) VALUE
               '00109195002093410030915300408683'.
           05                               PIC  X(32) VALUE
               '00509253006094560070940300809058'.
           05                               PIC  X(32) VALUE
               '00909175010093030110909900108983'.
           05                               PIC  X(32) VALUE
               '00208672003088600040917400509094'.
           05                               PIC  X(32) VALUE
               '00608628007083240080844600908102'.
           05                               PIC  X(32) VALUE
               '01008015011080190050832400608424'.
           05                               PIC  X(32) VALUE
               '00708398008084090090816501008221'.
           05                               PIC  X(32) VALUE
               '01108184001104650021059700310559'.
           05                               PIC  X(32) VALUE
               '00410721005106790061076100710526'.
           05                               PIC  X(32) VALUE
               '00810742009104990101007001109901'.
           05                               PIC  X(32) VALUE
               '00109655002101170031014300410111'.
           05                               PIC  X(32) VALUE
               '00510860006100780071022100810366'.
           05                               PIC  X(32) VALUE
               '00909084010096310110953600108844'.
           05                               PIC  X(32) VALUE
               '00208831003089440040896400508850'.
           05                               PIC  X(32) VALUE
               '00608712007086190080873300908653'.
           05                               PIC  X(32) VALUE
               '01008710011086240051095700611003'.
           05                               PIC  X(32) VALUE
               '00710861008110200091176401010989'.
           05                               PIC  X(32) VALUE
               '01111051001102350020989000309907'.
           05                               PIC  X(32) VALUE
               '00409416005090760060994800709246'.
           05                               PIC  X(32) VALUE
               '00808851009085860100870301108655'.
           05                               PIC  X(32) VALUE
               '00107895002081440030805000408119'.
           05                               PIC  X(32) VALUE
               '00507982006079920070818100808265'.
           05                               PIC  X(32) VALUE
               '00908300010080610110833000109354'.
           05                               PIC  X(32) VALUE
               '00209063003088200040897200508968'.
           05                               PIC  X(32) VALUE
               '00608884007088890080899400908990'.
           05                               PIC  X(32) VALUE
               '01008925011091410010942000209321'.
           05                               PIC  X(32) VALUE
               '00309215004094470050907300609073'.
           05                               PIC  X(32) VALUE
               '00709115008092750090939701009362'.
           05                               PIC  X(32) VALUE
               '01109337001093420020918800309195'.
           05                               PIC  X(32) VALUE
               '00409209005090530060947000709453'.
           05                               PIC  X(32) VALUE
               '00809799009092500100950201109607'.
           05                               PIC  X(32) VALUE
               '00108829002087400030867800408783'.
           05                               PIC  X(32) VALUE
               '00508711006088140070863600808581'.
           05                               PIC  X(32) VALUE
               '00908589010085250110836500109392'.
           05                               PIC  X(32) VALUE
               '00209844003097300040949400509798'.
           05                               PIC  X(32) VALUE
               '00609654007094890080962500909309'.
           05                               PIC  X(32) VALUE
               '01009188011090740011059300210600'.
           05                               PIC  X(32) VALUE
               '00310600004104180051041900610401'.
           05                               PIC  X(32) VALUE
               '00710460008105530091051101010405'.
           05                               PIC  X(32) VALUE
               '01110442001115330021109400311197'.
           05                               PIC  X(32) VALUE
               '00411616005116310061160500711646'.
           05                               PIC  X(32) VALUE
               '00811351009115540101124001111109'.
           05                               PIC  X(32) VALUE
               '00109699002094300030950800409470'.
           05                               PIC  X(32) VALUE
               '00509473006094390070938700809528'.
           05                               PIC  X(32) VALUE
               '00909396010093320110946100107888'.
           05                               PIC  X(32) VALUE
               '00208193003080820040780200507526'.
           05                               PIC  X(32) VALUE
               '00607479007073610080767500907256'.
           05                               PIC  X(32) VALUE
               '01007518011074800010773100207674'.
           05                               PIC  X(32) VALUE
               '00307592004074960050746800607544'.
           05                               PIC  X(32) VALUE
               '00707485008073570090711401007348'.
           05                               PIC  X(32) VALUE
               '01107155001090500020894100309082'.
           05                               PIC  X(32) VALUE
               '00409303005092330060937600709183'.
           05                               PIC  X(32) VALUE
               '00809044009088550100881901108847'.
           05                               PIC  X(32) VALUE
               '00109364002093670030921800409064'.
           05                               PIC  X(32) VALUE
               '00509125006089370070974200808989'.
           05                               PIC  X(32) VALUE
               '00909229010093030110924900109588'.
           05                               PIC  X(32) VALUE
               '00209690003095840040949700509289'.
           05                               PIC  X(32) VALUE
               '00609569007089580080896000908532'.
           05                               PIC  X(32) VALUE
               '01008764011086370010948100209846'.
           05                               PIC  X(32) VALUE
               '00309364004092820050944100609130'.
           05                               PIC  X(32) VALUE
               '00710060008095240090954001009513'.
           05                               PIC  X(32) VALUE
               '01109651001082820020810500308339'.
           05                               PIC  X(32) VALUE
               '00408196005083190060844000708234'.
           05                               PIC  X(32) VALUE
               '00808323009082200100839101108359'.
           05                               PIC  X(32) VALUE
               '00108733002087580030856000408601'.
           05                               PIC  X(32) VALUE
               '00508392006083870070826600808288'.
           05                               PIC  X(32) VALUE
               '00908296010084750110845600109027'.
           05                               PIC  X(32) VALUE
               '00209040003088570040817000508293'.
           05                               PIC  X(32) VALUE
               '00608355007082540080807200907896'.
           05                               PIC  X(32) VALUE
               '01007907011078660010943400209723'.
           05                               PIC  X(32) VALUE
               '00309564004098180050988100610305'.
           05                               PIC  X(32) VALUE
               '00709799008102540091007601010244'.
           05                               PIC  X(32) VALUE
               '01110027001101410020999400309763'.
           05                               PIC  X(32) VALUE
               '00409803005095390060967800709605'.
           05                               PIC  X(32) VALUE
               '00809792009096790100945701109536'.
           05                               PIC  X(32) VALUE
               '00108585002086770030859100408433'.
           05                               PIC  X(32) VALUE
               '00508740006085330070857500809251'.
           05                               PIC  X(32) VALUE
               '00909377010093620110954500110455'.
           05                               PIC  X(32) VALUE
               '00210898003107150041059600511404'.
           05                               PIC  X(32) VALUE
               '00611289007107310081069200910661'.
           05                               PIC  X(32) VALUE
               '01010962011106850010884200208961'.
           05                               PIC  X(32) VALUE
               '00308916004089110050815600608583'.
           05                               PIC  X(32) VALUE
               '00708888008088110090879301008798'.
           05                               PIC  X(32) VALUE
               '01108966001081860020782500308836'.
           05                               PIC  X(32) VALUE
               '00408054005083740060878800707417'.
           05                               PIC  X(32) VALUE
               '00808393009085040100865601109002'.
           05                               PIC  X(32) VALUE
               '00109860002098440030983500409831'.
           05                               PIC  X(32) VALUE
               '00509703006098470070989500809848'.
           05                               PIC  X(32) VALUE
               '00909862010097470110974400108622'.
           05                               PIC  X(32) VALUE
               '00208374003088280040862500508386'.
           05                               PIC  X(32) VALUE
               '00608373007083380080839400908617'.
           05                               PIC  X(32) VALUE
               '01008730011088470010969300209832'.
           05                               PIC  X(32) VALUE
               '00309977004094600050975100609588'.
           05                               PIC  X(32) VALUE
               '00709327008088940090933901008993'.
           05                               PIC  X(32) VALUE
               '01109032001081680020789600308218'.
           05                               PIC  X(32) VALUE
               '00407888005072480060728700707246'.
           05                               PIC  X(32) VALUE
               '00807566009071170100735701107161'.
           05                               PIC  X(32) VALUE
               '00108400002090560030914500409306'.
           05                               PIC  X(32) VALUE
               '00509717006097300070946600809439'.
           05                               PIC  X(32) VALUE
               '00909535010090590110852000109140'.
           05                               PIC  X(32) VALUE
               '00209281003091360040903400508938'.
           05                               PIC  X(32) VALUE
               '00609035007090230080886300908928'.
           05                               PIC  X(32) VALUE
               '01009378011093280010762100207334'.
           05                               PIC  X(32) VALUE
               '00307261004071650050702900607284'.
           05                               PIC  X(32) VALUE
               '00706782008068830090664201006610'.
           05                               PIC  X(32) VALUE
               '01106859001079160020800800307993'.
           05                               PIC  X(32) VALUE
               '00408151005079080060818800708054'.
           05                               PIC  X(32) VALUE
               '00808147009083130100838701108326'.
           05                               PIC  X(32) VALUE
               '00108736002088650030871600408560'.
           05                               PIC  X(32) VALUE
               '00508376006085190070801400808185'.
           05                               PIC  X(32) VALUE
               '00907869010078910110812900110718'.
           05                               PIC  X(32) VALUE
               '00210647003104690041039500510429'.
           05                               PIC  X(32) VALUE
               '00610198007103340081035500910245'.
           05                               PIC  X(32) VALUE
               '01010183011100200010962100209801'.
           05                               PIC  X(32) VALUE
               '00309616004093930050916800609331'.
           05                               PIC  X(32) VALUE
               '00709384008093070090925701009217'.
           05                               PIC  X(32) VALUE
               '01108889001096990020951100309361'.
           05                               PIC  X(32) VALUE
               '00409237005092960060913500709016'.
           05                               PIC  X(32) VALUE
               '00808947009089400100889601108820'.
           05                               PIC  X(32) VALUE
               '00107435002073900030739800407108'.
           05                               PIC  X(32) VALUE
               '00507163006069080070677600806631'.
           05                               PIC  X(32) VALUE
               '00906800010070020110679900109921'.
           05                               PIC  X(32) VALUE
               '00209909003098930040993900510291'.
           05                               PIC  X(32) VALUE
               '00610222007102340081075100910135'.
           05                               PIC  X(32) VALUE
               '01009921011100070010877400208698'.
           05                               PIC  X(32) VALUE
               '00308662004087900050894200608866'.
           05                               PIC  X(32) VALUE
               '00708571008089920090880401008855'.
           05                               PIC  X(32) VALUE
               '01108608001105650021033500310741'.
           05                               PIC  X(32) VALUE
               '00410123005101070061033300710098'.
           05                               PIC  X(32) VALUE
               '00810198009096870100968301109715'.
           05                               PIC  X(32) VALUE
               '00109664002096990030952500409669'.
           05                               PIC  X(32) VALUE
               '00509808006098160070970200809797'.
           05                               PIC  X(32) VALUE
               '00909869010097100110965800511345'.
           05                               PIC  X(32) VALUE
               '00611472007113300081120500912263'.
           05                               PIC  X(32) VALUE
               '01012553005093720060912400709175'.
           05                               PIC  X(32) VALUE
               '00809022009088940100952501109037'.
           05                               PIC  X(32) VALUE
               '00109639002095970030970500410103'.
           05                               PIC  X(32) VALUE
               '00509724006096960070972700809971'.
           05                               PIC  X(32) VALUE
               '00909892010099910110964900111006'.
           05                               PIC  X(32) VALUE
               '00210868003108060041098500109258'.
           05                               PIC  X(32) VALUE
               '00209601003086020040884800509162'.
           05                               PIC  X(32) VALUE
               '00608408007086900080880900909341'.
           05                               PIC  X(32) VALUE
               '01009088011090850051029900610306'.
           05                               PIC  X(32) VALUE
               '00710323008100870091049101010502'.
           05                               PIC  X(32) VALUE
               '01110559001084490020871900308294'.
           05                               PIC  X(32) VALUE
               '00407894005077010060742600707004'.
           05                               PIC  X(32) VALUE
               '00806959009076700100759001107656'.
           05                               PIC  X(32) VALUE
               '00109465002094050030909700409337'.
           05                               PIC  X(32) VALUE
               '00509013006092360070930100809036'.
           05                               PIC  X(32) VALUE
               '00908852010093170110975900108445'.
           05                               PIC  X(32) VALUE
               '00208522003082050040872500508690'.
           05                               PIC  X(32) VALUE
               '00608596007087940080850200908652'.
           05                               PIC  X(32) VALUE
               '01008572011087100010847500208515'.
           05                               PIC  X(32) VALUE
               '00308426004084040050813900608030'.
           05                               PIC  X(32) VALUE
               '00707979008079070090796601007889'.
           05                               PIC  X(32) VALUE
               '01107996007086730080915800909113'.
           05                               PIC  X(32) VALUE
               '01008959011085800010836000208147'.
           05                               PIC  X(32) VALUE
               '00307823004079400050778500607768'.
           05                               PIC  X(32) VALUE
               '00708024008078850090758701007669'.
           05                               PIC  X(32) VALUE
               '01107734001113840021158700311454'.
           05                               PIC  X(32) VALUE
               '00411723005116220061187100711640'.
           05                               PIC  X(32) VALUE
               '00811507009118870101222001111666'.
           05                               PIC  X(32) VALUE
               '00108433002086790030840100408381'.
           05                               PIC  X(32) VALUE
               '00508537006088750070896700808979'.
           05                               PIC  X(32) VALUE
               '00909078010091380110925600111080'.
           05                               PIC  X(32) VALUE
               '00211322003108160041099700511092'.
           05                               PIC  X(32) VALUE
               '00611064007106670081099800910874'.
           05                               PIC  X(32) VALUE
               '01010763011103840010600000205500'.
           05                               PIC  X(32) VALUE
               '00305000004045000010806400208136'.
           05                               PIC  X(32) VALUE
               '00308108004078020050764000607705'.
           05                               PIC  X(32) VALUE
               '00707848008079110090790101008000'.
           05                               PIC  X(32) VALUE
               '01108027001093390020979500309323'.
           05                               PIC  X(32) VALUE
               '00409735005097780060956100709334'.
           05                               PIC  X(32) VALUE
               '00809088009094760100938201109110'.
           05                               PIC  X(32) VALUE
               '00109323002092130030897100408601'.
           05                               PIC  X(32) VALUE
               '00508042006088780070825000808015'.
           05                               PIC  X(32) VALUE
               '00907983010084340110782200108616'.
           05                               PIC  X(32) VALUE
               '00209263003092880040895500508598'.
           05                               PIC  X(32) VALUE
               '00608503007084580080844500908138'.
           05                               PIC  X(32) VALUE
               '01008323011084050011244300212427'.
           05                               PIC  X(32) VALUE
               '00312369004127860051242300612223'.
           05                               PIC  X(32) VALUE
               '00711723008118160091158701011007'.
           05                               PIC  X(32) VALUE
               '01110444001114960021113700311257'.
           05                               PIC  X(32) VALUE
               '00411238005111480061132700711258'.
           05                               PIC  X(32) VALUE
               '00811026009108650101079001110656'.
           05                               PIC  X(32) VALUE
               '00108252002082170030808700407999'.
           05                               PIC  X(32) VALUE
               '00508016006077530070774100807954'.
           05                               PIC  X(32) VALUE
               '00907802010079590110795200108144'.
           05                               PIC  X(32) VALUE
               '00207738003076790040768400507577'.
           05                               PIC  X(32) VALUE
               '00606802007069160080691100906735'.
           05                               PIC  X(32) VALUE
               '01006563011064130010922300209291'.
           05                               PIC  X(32) VALUE
               '00309158004094770050908400609012'.
           05                               PIC  X(32) VALUE
               '00708963008091220090890301008835'.
           05                               PIC  X(32) VALUE
               '01108935001098920020987600309833'.
           05                               PIC  X(32) VALUE
               '00409704005094540061014900710368'.
           05                               PIC  X(32) VALUE
               '00810091009098860100982601109775'.
           05                               PIC  X(32) VALUE
               '00110160002101600031036300410378'.
           05                               PIC  X(32) VALUE
               '00509952006097760070977100809632'.
           05                               PIC  X(32) VALUE
               '00909778010095680110947400107599'.
           05                               PIC  X(32) VALUE
               '00207620003078480040756100507593'.
           05                               PIC  X(32) VALUE
               '00607382007073390080701700907532'.
           05                               PIC  X(32) VALUE
               '01007635011082750010936200209368'.
           05                               PIC  X(32) VALUE
               '00309633004090100050942300608898'.
           05                               PIC  X(32) VALUE
               '00708813008085060090863301008789'.
           05                               PIC  X(32) VALUE
               '01109172001094740020952500309516'.
           05                               PIC  X(32) VALUE
               '00409535005093860060952600709485'.
           05                               PIC  X(32) VALUE
               '00809590009097030100979201109697'.
           05                               PIC  X(32) VALUE
               '01109834001114220021128100311593'.
           05                               PIC  X(32) VALUE
               '00411768005117540061100900711097'.
           05                               PIC  X(32) VALUE
               '00810898009107210101148401109474'.
           05                               PIC  X(32) VALUE
               '00107180002079340030769700407983'.
           05                               PIC  X(32) VALUE
               '00507517006073010070715700806926'.
           05                               PIC  X(32) VALUE
               '00906666010067640110678200109160'.
           05                               PIC  X(32) VALUE
               '00209375003096310040971000508891'.
           05                               PIC  X(32) VALUE
               '00609672007101240080907100909227'.
           05                               PIC  X(32) VALUE
               '01009194011090210010922300209010'.
           05                               PIC  X(32) VALUE
               '00309327004092530050918500609007'.
           05                               PIC  X(32) VALUE
               '00709124008090170090874101008816'.
           05                               PIC  X(32) VALUE
               '01109183001090840020919300309259'.
           05                               PIC  X(32) VALUE
               '00409418005094430060951300709357'.
           05                               PIC  X(32) VALUE
               '00809618009093220100933901109158'.
           05                               PIC  X(32) VALUE
               '00510104006103150071037200810587'.
           05                               PIC  X(32) VALUE
               '00910552010104440111058800108507'.
           05                               PIC  X(32) VALUE
               '00208504003083400040836700508450'.
           05                               PIC  X(32) VALUE
               '00608138007080420080835600908520'.
           05                               PIC  X(32) VALUE
               '01008036011077400010906700208690'.
           05                               PIC  X(32) VALUE
               '00308560004085500050873300608625'.
           05                               PIC  X(32) VALUE
               '00708721008086150090857401008502'.
           05                               PIC  X(32) VALUE
               '01109059001077170020757300307250'.
           05                               PIC  X(32) VALUE
               '00407290005070470060735100707274'.
           05                               PIC  X(32) VALUE
               '00807927009072980100802901108416'.
           05                               PIC  X(32) VALUE
               '00509219006087260070876600809355'.
           05                               PIC  X(32) VALUE
               '00909652010095810110958500109850'.
           05                               PIC  X(32) VALUE
               '00209394003094150040927000509768'.
           05                               PIC  X(32) VALUE
               '00609615007092980080960500909582'.
           05                               PIC  X(32) VALUE
               '01009348011094810010916900209145'.
           05                               PIC  X(32) VALUE
               '00309125004090910050879900608848'.
           05                               PIC  X(32) VALUE
               '00709200008088210090879401008816'.
           05                               PIC  X(32) VALUE
               '01109198005100860061067600710603'.
           05                               PIC  X(32) VALUE
               '00809870009099970101006101110168'.
           05                               PIC  X(32) VALUE
               '00108289002084620030792700409235'.
           05                               PIC  X(32) VALUE
               '00509102006098180070777000807828'.
           05                               PIC  X(32) VALUE
               '00908097010083030110817300109496'.
           05                               PIC  X(32) VALUE
               '00209553003095930040965300509649'.
           05                               PIC  X(32) VALUE
               '00609403007091530080930300909058'.
           05                               PIC  X(32) VALUE
               '01008988011089310010958600209824'.
           05                               PIC  X(32) VALUE
               '00309793004095870050942600609361'.
           05                               PIC  X(32) VALUE
               '00709482008092320090927401009346'.
           05                               PIC  X(32) VALUE
               '01109282001088820020879800308638'.
           05                               PIC  X(32) VALUE
               '00408320005085350060853000708503'.
           05                               PIC  X(32) VALUE
               '00808561009087530100895201109121'.
           05                               PIC  X(32) VALUE
               '00109370002096370030969400409343'.
           05                               PIC  X(32) VALUE
               '00509371006094480070935100809246'.
           05                               PIC  X(32) VALUE
               '00909375010093530110918300109644'.
           05                               PIC  X(32) VALUE
               '00209620003097370040960400509161'.
           05                               PIC  X(32) VALUE
               '00609014007093750080924300908973'.
           05                               PIC  X(32) VALUE
               '01008887011089860010600000205500'.
           05                               PIC  X(32) VALUE
               '00305000004045000050400000604000'.
           05                               PIC  X(32) VALUE
               '00704000008040000090500001005000'.
           05                               PIC  X(32) VALUE
               '01105000001088770020850500308544'.
           05                               PIC  X(32) VALUE
               '00408575005078960060783000707635'.
           05                               PIC  X(32) VALUE
               '00808264009079200100764701107541'.
           05                               PIC  X(32) VALUE
               '00109254002091680030942200409234'.
           05                               PIC  X(32) VALUE
               '00509080006090930070889500808896'.
           05                               PIC  X(32) VALUE
               '00908931010090720110845200509452'.
           05                               PIC  X(32) VALUE
               '00608167007086270080863500908423'.
           05                               PIC  X(32) VALUE
               '01008396011083260011120500210700'.
           05                               PIC  X(32) VALUE
               '00310992004111240051125100611170'.
           05                               PIC  X(32) VALUE
               '00711158008107490091079701010496'.
           05                               PIC  X(32) VALUE
               '01110837001092960020940000309525'.
           05                               PIC  X(32) VALUE
               '00409533005097340060954200709380'.
           05                               PIC  X(32) VALUE
               '00809361009093850100957201109229'.
           05                               PIC  X(32) VALUE
               '00109158002087730030908700409090'.
           05                               PIC  X(32) VALUE
               '00508946006088800070895500808974'.
           05                               PIC  X(32) VALUE
               '00908942010095630110942100110927'.
           05                               PIC  X(32) VALUE
               '00210700003108690041105000511119'.
           05                               PIC  X(32) VALUE
               '00611110007108890081092000910925'.
           05                               PIC  X(32) VALUE
               '01010740011107160010771400207940'.
           05                               PIC  X(32) VALUE
               '00308035004079380050776100607521'.
           05                               PIC  X(32) VALUE
               '00707916008077700090765501007470'.
           05                               PIC  X(32) VALUE
               '01107438001086930020885900308677'.
           05                               PIC  X(32) VALUE
               '00408492005085170060845500708545'.
           05                               PIC  X(32) VALUE
               '00808546009087110100878001108666'.
           05                               PIC  X(32) VALUE
               '00508708006086450070853600808082'.
           05                               PIC  X(32) VALUE
               '00908108010078860110804700108958'.
           05                               PIC  X(32) VALUE
               '00208926003088430040870000508568'.
           05                               PIC  X(32) VALUE
               '00608666007086150080847200908453'.
           05                               PIC  X(32) VALUE
               '01008322011083880010863200208523'.
           05                               PIC  X(32) VALUE
               '00308024004080160050762500607173'.
           05                               PIC  X(32) VALUE
               '00706952008074130090798001008221'.
           05                               PIC  X(32) VALUE
               '01108597001118070021169800312156'.
           05                               PIC  X(32) VALUE
               '00412321001091510020907600308944'.
           05                               PIC  X(32) VALUE
               '00408474005087000060843200708461'.
           05                               PIC  X(32) VALUE
               '00808580009089170100846601108197'.
           05                               PIC  X(32) VALUE
               '00107852002078410030792800407525'.
           05                               PIC  X(32) VALUE
               '00507381006070150070713800806985'.
           05                               PIC  X(32) VALUE
               '00907131010072300110694100109824'.
           05                               PIC  X(32) VALUE
               '00209945003099330040991500509734'.
           05                               PIC  X(32) VALUE
               '00609674007096870080975000909812'.
           05                               PIC  X(32) VALUE
               '01010018011100490010895300208893'.
           05                               PIC  X(32) VALUE
               '00308635004089440050884600608838'.
           05                               PIC  X(32) VALUE
               '00708535008085890090843401008432'.
           05                               PIC  X(32) VALUE
               '01108505001091910020899600308667'.
           05                               PIC  X(32) VALUE
               '00408455005086090060870600708468'.
           05                               PIC  X(32) VALUE
               '00807998009079150100809901108175'.
           05                               PIC  X(32) VALUE
               '00109663002093360030911400409312'.
           05                               PIC  X(32) VALUE
               '00508933006089760070899000808999'.
           05                               PIC  X(32) VALUE
               '00908782010087800110863900109672'.
           05                               PIC  X(32) VALUE
               '00209662003098700041010800510133'.
           05                               PIC  X(32) VALUE
               '00610050007102340081015000910295'.
           05                               PIC  X(32) VALUE
               '01010106011099540010965700210070'.
           05                               PIC  X(32) VALUE
               '00310120004098540050988200609852'.
           05                               PIC  X(32) VALUE
               '00709542008095700090994401009780'.
           05                               PIC  X(32) VALUE
               '01109819001098420020881900309249'.
           05                               PIC  X(32) VALUE
               '00409326005094410060933200709455'.
           05                               PIC  X(32) VALUE
               '00809419009091700100916501109547'.
           05                               PIC  X(32) VALUE
               '00109155002089380030851100408944'.
           05                               PIC  X(32) VALUE
               '00509345006089290070899200808862'.
           05                               PIC  X(32) VALUE
               '00909474010088160110863000108042'.
           05                               PIC  X(32) VALUE
               '00208172003081770040816200507891'.
           05                               PIC  X(32) VALUE
               '00607963007079020080814800908259'.
           05                               PIC  X(32) VALUE
               '01008122011082770010840400208149'.
           05                               PIC  X(32) VALUE
               '00307672004077290050774700607586'.
           05                               PIC  X(32) VALUE
               '00707267008076470090767801007680'.
           05                               PIC  X(32) VALUE
               '01107524001088840020888200308883'.
           05                               PIC  X(32) VALUE
               '00408956005091170060908200709078'.
           05                               PIC  X(32) VALUE
               '00808957009090340100870301108657'.
           05                               PIC  X(32) VALUE
               '00107807002080740030795700407861'.
           05                               PIC  X(32) VALUE
               '00507549006076140070742800808226'.
           05                               PIC  X(32) VALUE
               '00907877010074410110782200109415'.
           05                               PIC  X(32) VALUE
               '00209234003094580040907100509079'.
           05                               PIC  X(32) VALUE
               '00609035007086800080908600908932'.
           05                               PIC  X(32) VALUE
               '01008914011090130010843400208222'.
           05                               PIC  X(32) VALUE
               '00308263004084650050835900608567'.
           05                               PIC  X(32) VALUE
               '00708538008084800090850301008411'.
           05                               PIC  X(32) VALUE
               '01108270001081050020779600307359'.
           05                               PIC  X(32) VALUE
               '00407226005074360060725000707235'.
           05                               PIC  X(32) VALUE
               '00807373009070820100712201107201'.
           05                               PIC  X(32) VALUE
               '00108090002087150030811600408450'.
           05                               PIC  X(32) VALUE
               '00508540006083450070886100808379'.
           05                               PIC  X(32) VALUE
               '00907999010080150110809600107757'.
           05                               PIC  X(32) VALUE
               '00207718003080840040798300507786'.
           05                               PIC  X(32) VALUE
               '00607818007077920080785500907820'.
           05                               PIC  X(32) VALUE
               '01007952011079770010821400208227'.
           05                               PIC  X(32) VALUE
               '00307828004079830050830600608008'.
           05                               PIC  X(32) VALUE
               '00707969008077450090760701007576'.
           05                               PIC  X(32) VALUE
               '01107687005105610061068200711123'.
           05                               PIC  X(32) VALUE
               '00811580009118130101257801112196'.
           05                               PIC  X(32) VALUE
               '00110292002099390030983400409959'.
           05                               PIC  X(32) VALUE
               '00510048006103950071009200809602'.
           05                               PIC  X(32) VALUE
               '00909859010099300110941500110619'.
           05                               PIC  X(32) VALUE
               '00209807003101270040965700509568'.
           05                               PIC  X(32) VALUE
               '00608751007093270080894000908743'.
           05                               PIC  X(32) VALUE
               '01009038011090680010965200209637'.
           05                               PIC  X(32) VALUE
               '00309614004094470050943000609462'.
           05                               PIC  X(32) VALUE
               '00709326008092590090928001009351'.
           05                               PIC  X(32) VALUE
               '01109125001099760020958200309708'.
           05                               PIC  X(32) VALUE
               '00409459005096170060978100709466'.
           05                               PIC  X(32) VALUE
               '00809801009099440100967601109819'.
           05                               PIC  X(32) VALUE
               '00108798002095010030910200408925'.
           05                               PIC  X(32) VALUE
               '00509133006090650070914500809007'.
           05                               PIC  X(32) VALUE
               '00909492010096180110922000107588'.
           05                               PIC  X(32) VALUE
               '00207399003073250040719200507192'.
           05                               PIC  X(32) VALUE
               '00607290007069880080702800906871'.
           05                               PIC  X(32) VALUE
               '01006719011069960010907500209170'.
           05                               PIC  X(32) VALUE
               '00308953004090660050903400608987'.
           05                               PIC  X(32) VALUE
               '00709106008088930090881901008878'.
           05                               PIC  X(32) VALUE
               '01109306001078420020783800307575'.
           05                               PIC  X(32) VALUE
               '00407432005070150060752200707248'.
           05                               PIC  X(32) VALUE
               '00807356009072080100716901107179'.
           05                               PIC  X(32) VALUE
               '00109130002091860030875600409061'.
           05                               PIC  X(32) VALUE
               '00508990006089580070904800809386'.
           05                               PIC  X(32) VALUE
               '00909270010094340110952300109803'.
           05                               PIC  X(32) VALUE
               '00209685003100700041020500509533'.
           05                               PIC  X(32) VALUE
               '00609893007094670080972400909284'.
           05                               PIC  X(32) VALUE
               '01009570011090240010928900209507'.
           05                               PIC  X(32) VALUE
               '00309316004099540010848900208319'.
           05                               PIC  X(32) VALUE
               '00308565004082310050786900607972'.
           05                               PIC  X(32) VALUE
               '00707820008077740090790401007834'.
           05                               PIC  X(32) VALUE
               '01107670005096380060988500709765'.
           05                               PIC  X(32) VALUE
               '00809799009095870100961301109830'.
           05                               PIC  X(32) VALUE
               '00108196002079980030781300407765'.
           05                               PIC  X(32) VALUE
               '00507536006075940070754100807447'.
           05                               PIC  X(32) VALUE
               '00907731010076260110761700110781'.
           05                               PIC  X(32) VALUE
               '00210311003105580041065800510465'.
           05                               PIC  X(32) VALUE
               '00610376007103670081036700910445'.
           05                               PIC  X(32) VALUE
               '01010177011101920011023500209967'.
           05                               PIC  X(32) VALUE
               '00309760004099120050919900609075'.
           05                               PIC  X(32) VALUE
               '00709200008093030090921401009887'.
           05                               PIC  X(32) VALUE
               '01109103001084470020843200308262'.
           05                               PIC  X(32) VALUE
               '00408283005082460060807800707990'.
           05                               PIC  X(32) VALUE
               '00808032009078830100801101107957'.
           05                               PIC  X(32) VALUE
               '00109344002094390030945200409695'.
           05                               PIC  X(32) VALUE
               '00509514006094400070936500809520'.
           05                               PIC  X(32) VALUE
               '00909176010090310110913400110298'.
           05                               PIC  X(32) VALUE
               '00210477003100650041061800510778'.
           05                               PIC  X(32) VALUE
               '00610683007105200081035200909988'.
           05                               PIC  X(32) VALUE
               '01009835011094700010791400207730'.
           05                               PIC  X(32) VALUE
               '00307486004075860050747100607726'.
           05                               PIC  X(32) VALUE
               '00707795008079040090792701008029'.
           05                               PIC  X(32) VALUE
               '01107833001092960020910600309044'.
           05                               PIC  X(32) VALUE
               '00409265005087390060870700708684'.
           05                               PIC  X(32) VALUE
               '00808773009085640100900401109028'.
           05                               PIC  X(32) VALUE
               '00112099002120500031207600411627'.
           05                               PIC  X(32) VALUE
               '00511900006120800071209700812269'.
           05                               PIC  X(32) VALUE
               '00912085010119240111182500108533'.
           05                               PIC  X(32) VALUE
               '00208853003086760040866400508890'.
           05                               PIC  X(32) VALUE
               '00609046007090490080902500908803'.
           05                               PIC  X(32) VALUE
               '01008676011086280010828500208545'.
           05                               PIC  X(32) VALUE
               '00308351004078930050791800607367'.
           05                               PIC  X(32) VALUE
               '00708049008072890090754501007438'.
           05                               PIC  X(32) VALUE
               '01106435001078070020804200307994'.
           05                               PIC  X(32) VALUE
               '00408157005084530060817600708224'.
           05                               PIC  X(32) VALUE
               '00808566009094420100933501109797'.
           05                               PIC  X(32) VALUE
               '00109358002090670030932600409215'.
           05                               PIC  X(32) VALUE
               '00509430006096360070941000808800'.
           05                               PIC  X(32) VALUE
               '00908426010085790110800800108903'.
           05                               PIC  X(32) VALUE
               '00209038003091780040904800508740'.
           05                               PIC  X(32) VALUE
               '00608481007084390080852700908410'.
           05                               PIC  X(32) VALUE
               '01008479011087250010881700208833'.
           05                               PIC  X(32) VALUE
               '00309023004089020050897200608865'.
           05                               PIC  X(32) VALUE
               '00709195008089030090903001009045'.
           05                               PIC  X(32) VALUE
               '01108849001092710020937100309226'.
           05                               PIC  X(32) VALUE
               '00409158005093420060911000709004'.
           05                               PIC  X(32) VALUE
               '00809203009088200100870101108635'.
           05                               PIC  X(32) VALUE
               '00109617002096120030972600409465'.
           05                               PIC  X(32) VALUE
               '00509704006095710070954200809721'.
           05                               PIC  X(32) VALUE
               '00909820010097080110974400108546'.
           05                               PIC  X(32) VALUE
               '00208558003085950040863200508374'.
           05                               PIC  X(32) VALUE
               '00608361007080940080833800908088'.
           05                               PIC  X(32) VALUE
               '01008020011082880010879400208592'.
           05                               PIC  X(32) VALUE
               '00308456004087540050881900608916'.
           05                               PIC  X(32) VALUE
               '00708790008087240090885701009004'.
           05                               PIC  X(32) VALUE
               '01109026001085630020853000308550'.
           05                               PIC  X(32) VALUE
               '00408933005082110060831100708200'.
           05                               PIC  X(32) VALUE
               '00807999009076910100810601108292'.
           05                               PIC  X(32) VALUE
               '00110296002099890031008100410460'.
           05                               PIC  X(32) VALUE
               '00509824006108100071100100810367'.
           05                               PIC  X(32) VALUE
               '00911501010109980111051000112130'.
           05                               PIC  X(32) VALUE
               '00212287003122930041241700512424'.
           05                               PIC  X(32) VALUE
               '00612664007127210081278100913055'.
           05                               PIC  X(32) VALUE
               '01013093011131210010889600208900'.
           05                               PIC  X(32) VALUE
               '00308862004088520050860500608756'.
           05                               PIC  X(32) VALUE
               '00708859008086890090875301008844'.
           05                               PIC  X(32) VALUE
               '01108697001088470020879400308870'.
           05                               PIC  X(32) VALUE
               '00408956005088300060845700708579'.
           05                               PIC  X(32) VALUE
               '00808689009086390100842001108575'.
           05                               PIC  X(32) VALUE
               '00108694002087680030861500408771'.
           05                               PIC  X(32) VALUE
               '00508830006089420070917800808836'.
           05                               PIC  X(32) VALUE
               '00908642010087370110859700109202'.
           05                               PIC  X(32) VALUE
               '00209122003085840040901400509129'.
           05                               PIC  X(32) VALUE
               '00608935007091920080924700908955'.
           05                               PIC  X(32) VALUE
               '01008513011091360010798600208114'.
           05                               PIC  X(32) VALUE
               '00308050004083170050778900607491'.
           05                               PIC  X(32) VALUE
               '00707759008075200090747501007576'.
           05                               PIC  X(32) VALUE
               '01107301001112940021123400311264'.
           05                               PIC  X(32) VALUE
               '00411414005111300061104200710956'.
           05                               PIC  X(32) VALUE
               '00811174009107310101057301110274'.
           05                               PIC  X(32) VALUE
               '00109869002100830031004200410057'.
           05                               PIC  X(32) VALUE
               '00510049006100740070986500809928'.
           05                               PIC  X(32) VALUE
               '00909605010094180110927100107847'.
           05                               PIC  X(32) VALUE
               '00207912003078390040784300509271'.
           05                               PIC  X(32) VALUE
               '00608432007082730080845800908889'.
           05                               PIC  X(32) VALUE
               '01009179011081750010908300209346'.
           05                               PIC  X(32) VALUE
               '00309413004092770050908400609097'.
           05                               PIC  X(32) VALUE
               '00709293008097190091044201010407'.
           05                               PIC  X(32) VALUE
               '01110287001089180020921500308993'.
           05                               PIC  X(32) VALUE
               '00408509005087710060840100707956'.
           05                               PIC  X(32) VALUE
               '00808215009085060100883901108562'.
           05                               PIC  X(32) VALUE
               '00106000002055000030500000404500'.
           05                               PIC  X(32) VALUE
               '00504000006040000070400000804000'.
           05                               PIC  X(32) VALUE
               '00905000010050000110500000108837'.
           05                               PIC  X(32) VALUE
               '00208878003086030040839300508175'.
           05                               PIC  X(32) VALUE
               '00608057007080780080832900908106'.
           05                               PIC  X(32) VALUE
               '01008264011080800011006100210318'.
           05                               PIC  X(32) VALUE
               '00310400004106900051049200611130'.
           05                               PIC  X(32) VALUE
               '00711131008105800091070701010695'.
           05                               PIC  X(32) VALUE
               '01110828001092680020927500309049'.
           05                               PIC  X(32) VALUE
               '00409038005089910060881500708791'.
           05                               PIC  X(32) VALUE
               '00808860009088220100875301108670'.
           05                               PIC  X(32) VALUE
               '00112359002124240031299600412734'.
           05                               PIC  X(32) VALUE
               '00512713006135540071337500813447'.
           05                               PIC  X(32) VALUE
               '00913862010137770111346600110128'.
           05                               PIC  X(32) VALUE
               '00210085003101300040987000509673'.
           05                               PIC  X(32) VALUE
               '00609653007095190080934900909236'.
           05                               PIC  X(32) VALUE
               '01009489011093900010947000209358'.
           05                               PIC  X(32) VALUE
               '00309694004092160050947200609513'.
           05                               PIC  X(32) VALUE
               '00709693008094850090907901009319'.
           05                               PIC  X(32) VALUE
               '01109284005079350060861800709127'.
           05                               PIC  X(32) VALUE
               '00809523009094690100923501109203'.
           05                               PIC  X(32) VALUE
               '00109711002105140031064000410049'.
           05                               PIC  X(32) VALUE
               '00508940006091960070912300809114'.
           05                               PIC  X(32) VALUE
               '00908890010099320110897500110183'.
           05                               PIC  X(32) VALUE
               '00209961003099310040985600509892'.
           05                               PIC  X(32) VALUE
               '00609768007098930080982200909680'.
           05                               PIC  X(32) VALUE
               '01009529011097720011114300211105'.
           05                               PIC  X(32) VALUE
               '00311336004112130051119600611144'.
           05                               PIC  X(32) VALUE
               '00711147008112950091120601011356'.
           05                               PIC  X(32) VALUE
               '01111091001089210020915400309001'.
           05                               PIC  X(32) VALUE
               '00409142005088600060945000709246'.
           05                               PIC  X(32) VALUE
               '00809484009091660100927801109320'.
           05                               PIC  X(32) VALUE
               '00107960002080020030746700407507'.
           05                               PIC  X(32) VALUE
               '00507539006073460070753400807300'.
           05                               PIC  X(32) VALUE
               '00907456010075060110741800112104'.
           05                               PIC  X(32) VALUE
               '00212670003128410041362900513136'.
           05                               PIC  X(32) VALUE
               '00613230007130510081274700912845'.
           05                               PIC  X(32) VALUE
               '01013195011133950010799300207964'.
           05                               PIC  X(32) VALUE
               '00307717004075300050743400607645'.
           05                               PIC  X(32) VALUE
               '00707707008081420090791401007796'.
           05                               PIC  X(32) VALUE
               '01107683001086840020872700308472'.
           05                               PIC  X(32) VALUE
               '00408718005092170060876600708121'.
           05                               PIC  X(32) VALUE
               '00808228009085220100892701109560'.
           05                               PIC  X(32) VALUE
               '00108442002081030030785800407475'.
           05                               PIC  X(32) VALUE
               '00507678006075660070747100807309'.
           05                               PIC  X(32) VALUE
               '00907489010075670110763200510157'.
           05                               PIC  X(32) VALUE
               '00610279007101240081009000910102'.
           05                               PIC  X(32) VALUE
               '01009900011099140010813700208197'.
           05                               PIC  X(32) VALUE
               '00308284004083390050827000608008'.
           05                               PIC  X(32) VALUE
               '00708044008079090090823501008237'.
           05                               PIC  X(32) VALUE
               '01108107001070410020703100306768'.
           05                               PIC  X(32) VALUE
               '00406861005069830060728200707328'.
           05                               PIC  X(32) VALUE
               '00807087009069680100697401106901'.
           05                               PIC  X(32) VALUE
               '00110363002102350031034000410652'.
           05                               PIC  X(32) VALUE
               '00509792006094260070934100809444'.
           05                               PIC  X(32) VALUE
               '00909673010096060111001100108206'.
           05                               PIC  X(32) VALUE
               '00207817003087340040874300509174'.
           05                               PIC  X(32) VALUE
               '00609372007100560081006700909810'.
           05                               PIC  X(32) VALUE
               '01008941011099270010980900209967'.
           05                               PIC  X(32) VALUE
               '00311007004110760050967000609150'.
           05                               PIC  X(32) VALUE
               '00709218008093550090913301009102'.
           05                               PIC  X(32) VALUE
               '01108794001087380020865300308717'.
           05                               PIC  X(32) VALUE
               '00408700005086200060849600708366'.
           05                               PIC  X(32) VALUE
               '00808388009084680100847701108535'.
           05                               PIC  X(32) VALUE
               '00114604002145110031604500415375'.
           05                               PIC  X(32) VALUE
               '00516066006158030071584000815144'.
           05                               PIC  X(32) VALUE
               '00915542010158230111584100109698'.
           05                               PIC  X(32) VALUE
               '00209740003092650040910800508752'.
           05                               PIC  X(32) VALUE
               '00608603007084610080859200908412'.
           05                               PIC  X(32) VALUE
               '01008611011084820010945700209340'.
           05                               PIC  X(32) VALUE
               '00309061004091410050896900608913'.
           05                               PIC  X(32) VALUE
               '00709296008089600090889201008841'.
           05                               PIC  X(32) VALUE
               '01108834001123150021241600312698'.
           05                               PIC  X(32) VALUE
               '00412755005126550061296700712701'.
           05                               PIC  X(32) VALUE
               '00812781009128760101287401113088'.
           05                               PIC  X(32) VALUE
               '00111460002113220031122300411268'.
           05                               PIC  X(32) VALUE
               '00511233006111740071108200811443'.
           05                               PIC  X(32) VALUE
               '00911418010111130111114200508994'.
           05                               PIC  X(32) VALUE
               '00608795007085390080828200908217'.
           05                               PIC  X(32) VALUE
               '01008278011080980111062300111515'.
           05                               PIC  X(32) VALUE
               '00211556003120610041188300512207'.
           05                               PIC  X(32) VALUE
               '00612456007121890081185200911770'.
           05                               PIC  X(32) VALUE
               '01011702011116170010907000209026'.
           05                               PIC  X(32) VALUE
               '00308932004087520050882100608651'.
           05                               PIC  X(32) VALUE
               '00708201008082820090832401008201'.
           05                               PIC  X(32) VALUE
               '01108357005128370061296100712888'.
           05                               PIC  X(32) VALUE
               '00812813009127760101274501113384'.
           05                               PIC  X(32) VALUE
               '00112955002130520031291400413089'.
           05                               PIC  X(32) VALUE
               '00108872002086530030823700408444'.
           05                               PIC  X(32) VALUE
               '00508705006081870070801200808228'.
           05                               PIC  X(32) VALUE
               '00908125010085000110831500109481'.
           05                               PIC  X(32) VALUE
               '00209435003093750040942800509478'.
           05                               PIC  X(32) VALUE
               '00609690007097080080988600909717'.
           05                               PIC  X(32) VALUE
               '01009341011092450011121500211227'.
           05                               PIC  X(32) VALUE
               '00311376004118210051181300612005'.
           05                               PIC  X(32) VALUE
               '00711762008121560091181801011709'.
           05                               PIC  X(32) VALUE
               '01110992001163540021608000316654'.
           05                               PIC  X(32) VALUE
               '00417048005171090061759800717894'.
           05                               PIC  X(32) VALUE
               '00817250009174910101789501117935'.
           05                               PIC  X(32) VALUE
               '00108468002084490030845500408425'.
           05                               PIC  X(32) VALUE
               '00508302006081910070829800808287'.
           05                               PIC  X(32) VALUE
               '00908614010083010110852400110879'.
           05                               PIC  X(32) VALUE
               '00210641003103070041058400510584'.
           05                               PIC  X(32) VALUE
               '00610629007108560081101200911137'.
           05                               PIC  X(32) VALUE
               '01010876011105880010943600209809'.
           05                               PIC  X(32) VALUE
               '00309741004096610050986700609507'.
           05                               PIC  X(32) VALUE
               '00709138008092580090901501008590'.
           05                               PIC  X(32) VALUE
               '01108752001092670020922000309031'.
           05                               PIC  X(32) VALUE
               '00409170005092250060922800709144'.
           05                               PIC  X(32) VALUE
               '00809191009091100100900401108962'.
           05                               PIC  X(32) VALUE
               '00108877002089340030881000408879'.
           05                               PIC  X(32) VALUE
               '00508955006087870070908400809098'.
           05                               PIC  X(32) VALUE
               '00909020010089000110894400111269'.
           05                               PIC  X(32) VALUE
               '00211339003113970041160100512018'.
           05                               PIC  X(32) VALUE
               '00612306007117160081171000911603'.
           05                               PIC  X(32) VALUE
               '01011482011113630010958300209864'.
           05                               PIC  X(32) VALUE
               '00310037004097560050966100609576'.
           05                               PIC  X(32) VALUE
               '00709571008094330090938901009289'.
           05                               PIC  X(32) VALUE
               '01109505001091630020912800309082'.
           05                               PIC  X(32) VALUE
               '00409063005091150060898600709025'.
           05                               PIC  X(32) VALUE
               '00809022009089480100871701108752'.
           05                               PIC  X(32) VALUE
               '00109566002093190030943300409398'.
           05                               PIC  X(32) VALUE
               '00509656006094510070934900809422'.
           05                               PIC  X(32) VALUE
               '00909357010091290110918500108370'.
           05                               PIC  X(32) VALUE
               '00208202003081170040779000507348'.
           05                               PIC  X(32) VALUE
               '00607964007079350080815700908783'.
           05                               PIC  X(32) VALUE
               '01008787011085350011237700212830'.
           05                               PIC  X(32) VALUE
               '00313079004131130051282200612710'.
           05                               PIC  X(32) VALUE
               '00713360008132530091332401013514'.
           05                               PIC  X(32) VALUE
               '01113349001092110020904200308838'.
           05                               PIC  X(32) VALUE
               '00408790005089710060888500708645'.
           05                               PIC  X(32) VALUE
               '00808887009089680100903601108807'.
           05                               PIC  X(32) VALUE
               '00108405002093730030988000408174'.
           05                               PIC  X(32) VALUE
               '00107954002083880030797600407876'.
           05                               PIC  X(32) VALUE
               '00507906006086940070830400808079'.
           05                               PIC  X(32) VALUE
               '00908029010081080110829500107455'.
           05                               PIC  X(32) VALUE
               '00207647003074870040756900507556'.
           05                               PIC  X(32) VALUE
               '00606747007071280080695800907284'.
           05                               PIC  X(32) VALUE
               '01007248011077710010829900207885'.
           05                               PIC  X(32) VALUE
               '00307662004075420011097900210698'.
           05                               PIC  X(32) VALUE
               '00310551004105530010825400208013'.
           05                               PIC  X(32) VALUE
               '00307819004077670050789800607537'.
           05                               PIC  X(32) VALUE
               '00707915008083150090823001008366'.
           05                               PIC  X(32) VALUE
               '01108202001091490020883000308882'.
           05                               PIC  X(32) VALUE
               '00408434005085660060874900708918'.
           05                               PIC  X(32) VALUE
               '00809066009090440100860401108644'.
           05                               PIC  X(32) VALUE
               '00110803002107600031080600410849'.
           05                               PIC  X(32) VALUE
               '00511187006111330071114500810938'.
           05                               PIC  X(32) VALUE
               '00911036010110980111092800110642'.
           05                               PIC  X(32) VALUE
               '00210566003104770041046500510383'.
           05                               PIC  X(32) VALUE
               '00610304007101360081008300909909'.
           05                               PIC  X(32) VALUE
               '01009905011097390010801200207700'.
           05                               PIC  X(32) VALUE
               '00307847004080690050802100607750'.
           05                               PIC  X(32) VALUE
               '00707931008077790090831201008147'.
           05                               PIC  X(32) VALUE
               '01107685001086050020866900308585'.
           05                               PIC  X(32) VALUE
               '00408669005086390060858400708670'.
           05                               PIC  X(32) VALUE
               '00808754009085130100856301108496'.
           05                               PIC  X(32) VALUE
               '00110371002106160031072100410920'.
           05                               PIC  X(32) VALUE
               '00510807006108020071062700810681'.
           05                               PIC  X(32) VALUE
               '00911017010108530111048600109507'.
           05                               PIC  X(32) VALUE
               '00209426003095550040975400509672'.
           05                               PIC  X(32) VALUE
               '00609708007096660080878600908769'.
           05                               PIC  X(32) VALUE
               '01008934011094590010600000205500'.
           05                               PIC  X(32) VALUE
               '00305000004045940050415400604297'.
           05                               PIC  X(32) VALUE
               '00704054008040560090500001005000'.
           05                               PIC  X(32) VALUE
               '01105000001098990020966100309975'.
           05                               PIC  X(32) VALUE
               '00409981005100530061007300710203'.
           05                               PIC  X(32) VALUE
               '00810078009101990101021701110391'.
           05                               PIC  X(32) VALUE
               '00111476002114540031167300411766'.
           05                               PIC  X(32) VALUE
               '00511936006123150071221600812065'.
           05                               PIC  X(32) VALUE
               '00912139010119210111220200110723'.
           05                               PIC  X(32) VALUE
               '00209784003095770040935200509159'.
           05                               PIC  X(32) VALUE
               '00609350007094080080914900908975'.
           05                               PIC  X(32) VALUE
               '01009068011089790011135400211339'.
           05                               PIC  X(32) VALUE
               '00311325004115440111204600112234'.
           05                               PIC  X(32) VALUE
               '00212261003120090041016100510922'.
           05                               PIC  X(32) VALUE
               '00610911007109090081038900910573'.
           05                               PIC  X(32) VALUE
               '01009866011099930011071400210639'.
           05                               PIC  X(32) VALUE
               '00310699004105390051063400610617'.
           05                               PIC  X(32) VALUE
               '00710578008106850091046501010360'.
           05                               PIC  X(32) VALUE
               '01110190001093210020940400309133'.
           05                               PIC  X(32) VALUE
               '00409461005095030060959200709607'.
           05                               PIC  X(32) VALUE
               '00809628009094890100940001109340'.
           05                               PIC  X(32) VALUE
               '00108721002086680030851800408215'.
           05                               PIC  X(32) VALUE
               '00508434006083010070826700808530'.
           05                               PIC  X(32) VALUE
               '00908398010083640110813100108759'.
           05                               PIC  X(32) VALUE
               '00208801003085900040873400508821'.
           05                               PIC  X(32) VALUE
               '00609125007087850080879800908403'.
           05                               PIC  X(32) VALUE
               '01008561011086480011058000208630'.
           05                               PIC  X(32) VALUE
               '00309158004089030050959700610708'.
           05                               PIC  X(32) VALUE
               '00709042008088990090878401009093'.
           05                               PIC  X(32) VALUE
               '01109563001098110020964800309488'.
           05                               PIC  X(32) VALUE
               '00409304005090030060955600709411'.
           05                               PIC  X(32) VALUE
               '00809318009093640100940701109426'.
           05                               PIC  X(32) VALUE
               '00110442002102030030982300409568'.
           05                               PIC  X(32) VALUE
               '00508989006088410070835200808581'.
           05                               PIC  X(32) VALUE
               '00908470010086400110833200108904'.
           05                               PIC  X(32) VALUE
               '00209212003090720040922000508706'.
           05                               PIC  X(32) VALUE
               '00609005007096270080942600909815'.
           05                               PIC  X(32) VALUE
               '01010075011100660011413400215584'.
           05                               PIC  X(32) VALUE
               '00314555004149900051479100614869'.
           05                               PIC  X(32) VALUE
               '00714968008147490091452301014128'.
           05                               PIC  X(32) VALUE
               '01114011001104190021059600310328'.
           05                               PIC  X(32) VALUE
               '00410326005102660060960500709548'.
           05                               PIC  X(32) VALUE
               '00809455009092690100921001109335'.
           05                               PIC  X(32) VALUE
               '00109661002097910030969500409723'.
           05                               PIC  X(32) VALUE
               '00509625006096340070934800809295'.
           05                               PIC  X(32) VALUE
               '00909281010092280110939000111570'.
           05                               PIC  X(32) VALUE
               '00211463003113960041149700511554'.
           05                               PIC  X(32) VALUE
               '00611684007117240081193000912130'.
           05                               PIC  X(32) VALUE
               '01012152011120480010882700209166'.
           05                               PIC  X(32) VALUE
               '00309088004091950050923300609187'.
           05                               PIC  X(32) VALUE
               '00709034008088490090842601008891'.
           05                               PIC  X(32) VALUE
               '01108761001109420021080200310708'.
           05                               PIC  X(32) VALUE
               '00411662005113980061121900710959'.
           05                               PIC  X(32) VALUE
               '00811395009107710101068601110530'.
           05                               PIC  X(32) VALUE
               '00108595002086020030870400408749'.
           05                               PIC  X(32) VALUE
               '00508750006086330070849100808782'.
           05                               PIC  X(32) VALUE
               '00908579010084660110892200110033'.
           05                               PIC  X(32) VALUE
               '00209938003099350040975100509768'.
           05                               PIC  X(32) VALUE
               '00609898007099970080999800909862'.
           05                               PIC  X(32) VALUE
               '01009749011096930011002600210185'.
           05                               PIC  X(32) VALUE
               '00310234004101720051016800609946'.
           05                               PIC  X(32) VALUE
               '00709865008098030090990801010115'.
           05                               PIC  X(32) VALUE
               '01110287001090340020901800308898'.
           05                               PIC  X(32) VALUE
               '00408750005087810060876700709007'.
           05                               PIC  X(32) VALUE
               '00808586009084990100829601108264'.
           05                               PIC  X(32) VALUE
               '00108635002088380030884400408924'.
           05                               PIC  X(32) VALUE
               '00508577006085530070872300808877'.
           05                               PIC  X(32) VALUE
               '00908893010087550110881200114053'.
           05                               PIC  X(32) VALUE
               '00213777003147520041549800515885'.
           05                               PIC  X(32) VALUE
               '00616314007166010081642400916508'.
           05                               PIC  X(32) VALUE
               '01016823011169230010872800208512'.
           05                               PIC  X(32) VALUE
               '00308820004088490050863800608557'.
           05                               PIC  X(32) VALUE
               '00708803008087710090873001008629'.
           05                               PIC  X(32) VALUE
               '01108787001110420021072400311010'.
           05                               PIC  X(32) VALUE
               '00410658005105240061027500709923'.
           05                               PIC  X(32) VALUE
               '00809863009096260100948901109779'.
           05                               PIC  X(32) VALUE
               '00109133002090700030887000409345'.
           05                               PIC  X(32) VALUE
               '00509569006096300070954300809456'.
           05                               PIC  X(32) VALUE
               '00909315010093140110935100110302'.
           05                               PIC  X(32) VALUE
               '00210255003098560040983400509837'.
           05                               PIC  X(32) VALUE
               '00609505007095400080951000909369'.
           05                               PIC  X(32) VALUE
               '01009491011094720010909000209165'.
           05                               PIC  X(32) VALUE
               '00309420004093360050936600609256'.
           05                               PIC  X(32) VALUE
               '00709214008092270090927201009389'.
           05                               PIC  X(32) VALUE
               '01109317001111330021122400311069'.
           05                               PIC  X(32) VALUE
               '00411148005112750061072400710489'.
           05                               PIC  X(32) VALUE
               '00810715009107560101085301111023'.
           05                               PIC  X(32) VALUE
               '00115686002156040031607400415820'.
           05                               PIC  X(32) VALUE
               '00515715006162130071722500817144'.
           05                               PIC  X(32) VALUE
               '00918162010178660111792800109005'.
           05                               PIC  X(32) VALUE
               '00209227003092600040894800509289'.
           05                               PIC  X(32) VALUE
               '00609309007099420080949100909280'.
           05                               PIC  X(32) VALUE
               '01009330011092470010926600209415'.
           05                               PIC  X(32) VALUE
               '00309063004093500050950100609496'.
           05                               PIC  X(32) VALUE
               '00709579008096350090956801009728'.
           05                               PIC  X(32) VALUE
               '01109728001083030020827300308221'.
           05                               PIC  X(32) VALUE
               '00408169005084160060888800708455'.
           05                               PIC  X(32) VALUE
               '00807798009079800100811001107778'.
           05                               PIC  X(32) VALUE
               '00108998002090060030893600408911'.
           05                               PIC  X(32) VALUE
               '00508858006086600070859600808524'.
           05                               PIC  X(32) VALUE
               '00908618010084320110849600111979'.
           05                               PIC  X(32) VALUE
               '00211950003119220041221300512355'.
           05                               PIC  X(32) VALUE
               '00612060007126050081252000912744'.
           05                               PIC  X(32) VALUE
               '01012562011127370010868600208167'.
           05                               PIC  X(32) VALUE
               '00308347004077880011573300215904'.
           05                               PIC  X(32) VALUE
               '00316327004167430051726000617354'.
           05                               PIC  X(32) VALUE
               '00717676008176290091762201018174'.
           05                               PIC  X(32) VALUE
               '01118661001060000020550000305000'.
           05                               PIC  X(32) VALUE
               '00404550005047230060465600704636'.
           05                               PIC  X(32) VALUE
               '00804647009050000100500001105000'.
           05                               PIC  X(32) VALUE
               '00116703002168780031739600417086'.
           05                               PIC  X(32) VALUE
               '00517840006177920071793400817921'.
           05                               PIC  X(32) VALUE
               '00918419010191260111857300106000'.
           05                               PIC  X(32) VALUE
               '00205500003050000040450000504438'.
           05                               PIC  X(32) VALUE
               '00604272007042410080426700905000'.
           05                               PIC  X(32) VALUE
               '01005000011050000011291500213072'.
           05                               PIC  X(32) VALUE
               '00313081004130360051314400613351'.
           05                               PIC  X(32) VALUE
               '00713197008134650091368401013499'.
           05                               PIC  X(32) VALUE
               '01113689005172600061741800717876'.
           05                               PIC  X(32) VALUE
               '00817896009179100101816901118259'.
           05                               PIC  X(32) VALUE
               '00112162002120420031203800412111'.
           05                               PIC  X(32) VALUE
               '00111909002122460031267000412825'.
           05                               PIC  X(32) VALUE
               '00116740002171110031806200417937'.
           05                               PIC  X(32) VALUE
               '00517908006185630071878700818674'.
           05                               PIC  X(32) VALUE
               '00918746010184480111880700110847'.
           05                               PIC  X(32) VALUE
               '00210660003104000041013600509894'.
           05                               PIC  X(32) VALUE
               '00610235007101350081097700911145'.
           05                               PIC  X(32) VALUE
               '01010591011105320051289500613235'.
           05                               PIC  X(32) VALUE
               '00713095008136440091394901014379'.
           05                               PIC  X(32) VALUE
               '01114354001161430021610200316440'.
           05                               PIC  X(32) VALUE
               '00416679005167780061709900716635'.
           05                               PIC  X(32) VALUE
               '00816716009167040101723001117091'.
           05                               PIC  X(32) VALUE
               '00108907002090950030896800408757'.
           05                               PIC  X(32) VALUE
               '00508770006087240070835200807996'.
           05                               PIC  X(32) VALUE
               '00907955010079160110792100108238'.
           05                               PIC  X(32) VALUE
               '00208328003082600040833100508049'.
           05                               PIC  X(32) VALUE
               '00608321007083500080836800908535'.
           05                               PIC  X(32) VALUE
               '01008387011085310011155600211541'.
           05                               PIC  X(32) VALUE
               '00311771004117330051177100611965'.
           05                               PIC  X(32) VALUE
               '00711549008116530091176901011718'.
           05                               PIC  X(32) VALUE
               '01111767001090970020903200308850'.
           05                               PIC  X(32) VALUE
               '00408760005088210060883800708645'.
           05                               PIC  X(32) VALUE
               '00808512009084230100798401107954'.
           05                               PIC  X(32) VALUE
               '00507982006078460070778500807906'.
           05                               PIC  X(32) VALUE
               '00907957010079860110785700109233'.
           05                               PIC  X(32) VALUE
               '00209303003095150040920300509421'.
           05                               PIC  X(32) VALUE
               '00609235007095180080932500909389'.
           05                               PIC  X(32) VALUE
               '01009382011094590010827900208011'.
           05                               PIC  X(32) VALUE
               '00308544004087230050863300608906'.
           05                               PIC  X(32) VALUE
               '00708993008092070090824001008973'.
           05                               PIC  X(32) VALUE
               '01108032001085360020850500308412'.
           05                               PIC  X(32) VALUE
               '00408262005083250060828200709278'.
           05                               PIC  X(32) VALUE
               '00808686009084650100804701108217'.
           05                               PIC  X(32) VALUE
               '00508937006090440070879500809064'.
           05                               PIC  X(32) VALUE
               '00908695010083910110788800510198'.
           05                               PIC  X(32) VALUE
               '00609640007097970080986900909880'.
           05                               PIC  X(32) VALUE
               '01009853001090910020953800309010'.
           05                               PIC  X(32) VALUE
               '00409163005089150060862200708753'.
           05                               PIC  X(32) VALUE
               '00808447009085080100848201108440'.
           05                               PIC  X(32) VALUE
               '00109299002091530030833800408275'.
           05                               PIC  X(32) VALUE
               '00508347006078840070806800808184'.
           05                               PIC  X(32) VALUE
               '00908259010079090110807800109948'.
           05                               PIC  X(32) VALUE
               '00209426003095310040942500509172'.
           05                               PIC  X(32) VALUE
               '00609240007095650080918500908959'.
           05                               PIC  X(32) VALUE
               '01009269011096750010938300209325'.
           05                               PIC  X(32) VALUE
               '00309186004087820050827700608447'.
           05                               PIC  X(32) VALUE
               '00708387008086780090851201008561'.
           05                               PIC  X(32) VALUE
               '01108622001105710021050400310824'.
           05                               PIC  X(32) VALUE
               '00411174005114250061202400711301'.
           05                               PIC  X(32) VALUE
               '00811373009114140101110901111045'.
           05                               PIC  X(32) VALUE
               '00109130002089580030917900409165'.
           05                               PIC  X(32) VALUE
               '00509119006090810070923300809302'.
           05                               PIC  X(32) VALUE
               '00909149010094610110925600110251'.
           05                               PIC  X(32) VALUE
               '00210247003103770041038300510226'.
           05                               PIC  X(32) VALUE
               '00610242007100170080997500909924'.
           05                               PIC  X(32) VALUE
               '01010140011099270010837100208680'.
           05                               PIC  X(32) VALUE
               '00308581004084400050833400608046'.
           05                               PIC  X(32) VALUE
               '00708143008084090090789501007934'.
           05                               PIC  X(32) VALUE
               '01107806001092340020898100309236'.
           05                               PIC  X(32) VALUE
               '00408447005086920060851700708668'.
           05                               PIC  X(32) VALUE
               '00809127009086760100902701109147'.
           05                               PIC  X(32) VALUE
               '00108779002092510030951000409575'.
           05                               PIC  X(32) VALUE
               '00509833006098050071012300810201'.
           05                               PIC  X(32) VALUE
               '00910007010102470111071100508326'.
           05                               PIC  X(32) VALUE
               '00608339007085120080860000909339'.
           05                               PIC  X(32) VALUE
               '01008909011094120010731500207054'.
           05                               PIC  X(32) VALUE
               '00307640004075980011264400213052'.
           05                               PIC  X(32) VALUE
               '00313356004137340051390200613273'.
           05                               PIC  X(32) VALUE
               '00714510008144180091450801014956'.
           05                               PIC  X(32) VALUE
               '01115313001078600020755100307454'.
           05                               PIC  X(32) VALUE
               '00407594005072930060719200707088'.
           05                               PIC  X(32) VALUE
               '00806865009067790100658501107283'.
           05                               PIC  X(32) VALUE
               '00109905002097760030982900409897'.
           05                               PIC  X(32) VALUE
               '00509999006098180070989900810021'.
           05                               PIC  X(32) VALUE
               '00910053010101560110985900111343'.
           05                               PIC  X(32) VALUE
               '00211384003117410041157400511544'.
           05                               PIC  X(32) VALUE
               '00611776007119980081176000911571'.
           05                               PIC  X(32) VALUE
               '01011561011114030010880600208593'.
           05                               PIC  X(32) VALUE
               '00308521004083910050791100608397'.
           05                               PIC  X(32) VALUE
               '00708403008082880090832501008097'.
           05                               PIC  X(32) VALUE
               '01108189001090540020907200309032'.
           05                               PIC  X(32) VALUE
               '00409075005090760060898000709044'.
           05                               PIC  X(32) VALUE
               '00809031009089420100883501108913'.
           05                               PIC  X(32) VALUE
               '00109205002092090030911300409706'.
           05                               PIC  X(32) VALUE
               '00509145006091400070927700809558'.
           05                               PIC  X(32) VALUE
               '00909157010091970110894900107748'.
           05                               PIC  X(32) VALUE
               '00207937003079670040742800507362'.
           05                               PIC  X(32) VALUE
               '00607488007077730080830500908916'.
           05                               PIC  X(32) VALUE
               '01008540011085580050809500608173'.
           05                               PIC  X(32) VALUE
               '00708122008080320090799001008187'.
           05                               PIC  X(32) VALUE
               '01107888001094320020914800309034'.
           05                               PIC  X(32) VALUE
               '00409013005091290060913900708961'.
           05                               PIC  X(32) VALUE
               '00808998009087720100909501109013'.
           05                               PIC  X(32) VALUE
               '00108952002088180030896900408974'.
           05                               PIC  X(32) VALUE
               '00508756006082950070864900809037'.
           05                               PIC  X(32) VALUE
               '00908851010089590110867200110150'.
           05                               PIC  X(32) VALUE
               '00210062003103600041064800510241'.
           05                               PIC  X(32) VALUE
               '00609964007097380081030100910210'.
           05                               PIC  X(32) VALUE
               '01010091011103580010948000209318'.
           05                               PIC  X(32) VALUE
               '00309065004089530050860400608876'.
           05                               PIC  X(32) VALUE
               '00708778008085640090833701008708'.
           05                               PIC  X(32) VALUE
               '01108644001087930020836200308139'.
           05                               PIC  X(32) VALUE
               '00408145005079430060779900707982'.
           05                               PIC  X(32) VALUE
               '00808300009086230100841601108365'.
           05                               PIC  X(32) VALUE
               '00108843002086640030853300408500'.
           05                               PIC  X(32) VALUE
               '00508337006082450070758300807718'.
           05                               PIC  X(32) VALUE
               '00907921010077300110727400908334'.
           05                               PIC  X(32) VALUE
               '01008291011086680010806500208335'.
           05                               PIC  X(32) VALUE
               '00308361004085260050829300608326'.
           05                               PIC  X(32) VALUE
               '00708373008078840090830201008278'.
           05                               PIC  X(32) VALUE
               '01108498005124680061224300712308'.
           05                               PIC  X(32) VALUE
               '00812745009125620101244401112485'.
           05                               PIC  X(32) VALUE
               '00108471002084410030865300408769'.
           05                               PIC  X(32) VALUE
               '00508980006090170070910000809321'.
           05                               PIC  X(32) VALUE
               '00908885010092240110902600107941'.
           05                               PIC  X(32) VALUE
               '00207997003079180040752700507379'.
           05                               PIC  X(32) VALUE
               '00607600007077840080729100907369'.
           05                               PIC  X(32) VALUE
               '01007079011072480011493100214636'.
           05                               PIC  X(32) VALUE
               '00315844004162860051670300616777'.
           05                               PIC  X(32) VALUE
               '00717457008171420091732501018629'.
           05                               PIC  X(32) VALUE
               '01117961001082190020843400308992'.
           05                               PIC  X(32) VALUE
               '00408949005084730060844900708522'.
           05                               PIC  X(32) VALUE
               '00808524009089260100877601108891'.
           05                               PIC  X(32) VALUE
               '00110534002102220031059600410759'.
           05                               PIC  X(32) VALUE
               '00510503006108200071067800810491'.
           05                               PIC  X(32) VALUE
               '00910521010111470111108700108961'.
           05                               PIC  X(32) VALUE
               '00209001003092080040912100509223'.
           05                               PIC  X(32) VALUE
               '00609201007089910080900900908901'.
           05                               PIC  X(32) VALUE
               '01008841011087960011073800210343'.
           05                               PIC  X(32) VALUE
               '00310349004099470050968200609620'.
           05                               PIC  X(32) VALUE
               '00709550008095130090976701009457'.
           05                               PIC  X(32) VALUE
               '01109278001084030020855900308458'.
           05                               PIC  X(32) VALUE
               '00408213005081370060803500708254'.
           05                               PIC  X(32) VALUE
               '00808457009089570100909901109218'.
           05                               PIC  X(32) VALUE
               '00510934006116450071089200810815'.
           05                               PIC  X(32) VALUE
               '00910427010105930111079500108028'.
           05                               PIC  X(32) VALUE
               '00208245003081970040773200507542'.
           05                               PIC  X(32) VALUE
               '00607600007075380080728100907327'.
           05                               PIC  X(32) VALUE
               '01007002011074220010964800209625'.
           05                               PIC  X(32) VALUE
               '00309543004094320050943300609445'.
           05                               PIC  X(32) VALUE
               '00709419008094560090945701009470'.
           05                               PIC  X(32) VALUE
               '01109368001107230021080700310659'.
           05                               PIC  X(32) VALUE
               '00410533005104030061038400710325'.
           05                               PIC  X(32) VALUE
               '00810347009101370101019701110152'.
           05                               PIC  X(32) VALUE
               '00108462002083720030842200408331'.
           05                               PIC  X(32) VALUE
               '00508473006083980070834000808223'.
           05                               PIC  X(32) VALUE
               '00908238010080700110789000508386'.
           05                               PIC  X(32) VALUE
               '00609142007092240080905500909105'.
           05                               PIC  X(32) VALUE
               '01009111011088760010956300208962'.
           05                               PIC  X(32) VALUE
               '00308921004088020050919100609075'.
           05                               PIC  X(32) VALUE
               '00708770008089620090903801008869'.
           05                               PIC  X(32) VALUE
               '01108807005077290060749200707506'.
           05                               PIC  X(32) VALUE
               '00807782009077250100796301107981'.
           05                               PIC  X(32) VALUE
               '00109615002101680031003700410109'.
           05                               PIC  X(32) VALUE
               '00509843006099750071004700810076'.
           05                               PIC  X(32) VALUE
               '00909635010094000110959400109934'.
           05                               PIC  X(32) VALUE
               '00209823003096610040959700509277'.
           05                               PIC  X(32) VALUE
               '00609376007092030080915000909179'.
           05                               PIC  X(32) VALUE
               '01009138011090810010667500206735'.
           05                               PIC  X(32) VALUE
               '00306863004066730050639000606620'.
           05                               PIC  X(32) VALUE
               '00706604008067170090659801006526'.
           05                               PIC  X(32) VALUE
               '01106598001088980020869600308681'.
           05                               PIC  X(32) VALUE
               '00408674005084720060847800708618'.
           05                               PIC  X(32) VALUE
               '00808605009085240100854901108500'.
           05                               PIC  X(32) VALUE
               '00109566002100970030904800409537'.
           05                               PIC  X(32) VALUE
               '00509075006090500070888200809016'.
           05                               PIC  X(32) VALUE
               '00908674010091850110928700107256'.
           05                               PIC  X(32) VALUE
               '00208084003082300040826800508517'.
           05                               PIC  X(32) VALUE
               '00608661007085370080846400908782'.
           05                               PIC  X(32) VALUE
               '01008740011090300011058000210662'.
           05                               PIC  X(32) VALUE
               '00310687004105930051043200610642'.
           05                               PIC  X(32) VALUE
               '00710873008109200091129501011279'.
           05                               PIC  X(32) VALUE
               '01110928001092020020910700309155'.
           05                               PIC  X(32) VALUE
               '00408862005088800060844500708751'.
           05                               PIC  X(32) VALUE
               '00808627009087270100894101108891'.
           05                               PIC  X(32) VALUE
               '00110002002091060030924900409034'.
           05                               PIC  X(32) VALUE
               '00508864006086990070841000808991'.
           05                               PIC  X(32) VALUE
               '00908886010089410110897100108939'.
           05                               PIC  X(32) VALUE
               '00208343003086600040856000508679'.
           05                               PIC  X(32) VALUE
               '00608539007085310080873900909001'.
           05                               PIC  X(32) VALUE
               '01009124011092490011101200211076'.
           05                               PIC  X(32) VALUE
               '00311205004115840051149300611618'.
           05                               PIC  X(32) VALUE
               '00711459008117630091168601011577'.
           05                               PIC  X(32) VALUE
               '01111233001100670021043300310097'.
           05                               PIC  X(32) VALUE
               '00410355005102940060976700709952'.
           05                               PIC  X(32) VALUE
               '00809962009101300100995001108962'.
           05                               PIC  X(32) VALUE
               '00106000002055000030500000404500'.
           05                               PIC  X(32) VALUE
               '01105000001099830020967500309557'.
           05                               PIC  X(32) VALUE
               '00409540005097460061003500709931'.
           05                               PIC  X(32) VALUE
               '00809850009095950100926201109439'.
           05                               PIC  X(32) VALUE
               '00108625002083280030828300408262'.
           05                               PIC  X(32) VALUE
               '00507986006079420070782500807809'.
           05                               PIC  X(32) VALUE
               '00907905010080520110788800111043'.
           05                               PIC  X(32) VALUE
               '00211808003120040041175900511793'.
           05                               PIC  X(32) VALUE
               '00611978007120720081280700912403'.
           05                               PIC  X(32) VALUE
               '01013023011135170010928300209350'.
           05                               PIC  X(32) VALUE
               '00309517004096740051002900610282'.
           05                               PIC  X(32) VALUE
               '00710471008101190090998501009538'.
           05                               PIC  X(8)  VALUE
               '01110018'.
       01  BUN-WAGE-INDEX-TABLE REDEFINES BUN-WAGE-INDEX-FILLER.
           05  BUN-WI-ENTRY OCCURS 5029 TIMES.
               10  BUN-WI-DATE-CODE         PIC  9(03).
               10  BUN-WAGE-INDEX           PIC  9V9(04).
