       01  BUN-DATE-FILLER.
           05                               PIC X(44)  VALUE
               '20110101001201201010022013010100320140101004'.
           05                               PIC X(44)  VALUE
               '20150101005201601010062017010100720180101008'.
           05                               PIC X(22)  VALUE
               '2019010100920200101010'.
       01  BUN-DATE-TABLE REDEFINES BUN-DATE-FILLER.
           05  BUN-DATE-ENTRY OCCURS 10 TIMES.
               10  BUN-DATE                 PIC  X(08).
               10  BUN-DATE-CODE            PIC  9(03).
       01  BUN-MAX-DATE                     PIC S9(07) COMP-3 VALUE +10.
       01  BUN-SUB                          PIC S9(07) COMP-3.
       01  BUN-CBSA-FILLER.
           05                               PIC  X(50) VALUE
               '     00000   0100010   0200020   0300030   0400040'.
           05                               PIC  X(50) VALUE
               '   0500050   0600060   0700070   0800074   1000084'.
           05                               PIC  X(50) VALUE
               '   1100094   1200104   1300114   1400124   1500134'.
           05                               PIC  X(50) VALUE
               '   1600144   1700154   1800164   1900174   2000184'.
           05                               PIC  X(50) VALUE
               '   2100194   2200204   2300214   2400224   2500234'.
           05                               PIC  X(50) VALUE
               '   2600244   2700254   2800264   2900274   3000284'.
           05                               PIC  X(50) VALUE
               '   3200294   3300304   3400314   3500324   3600334'.
           05                               PIC  X(50) VALUE
               '   3700344   3800354   3900364   4000374   4200384'.
           05                               PIC  X(50) VALUE
               '   4300394   4400404   4500414   4600424   4700434'.
           05                               PIC  X(50) VALUE
               '   4800444   4900454   5000464   5100474   5200484'.
           05                               PIC  X(50) VALUE
               '   5300494   5500496   6400503   6500510   6600517'.
           05                               PIC  X(50) VALUE
               '   6700519   6800521   6900523   7000525   7100527'.
           05                               PIC  X(50) VALUE
               '   7200529   7300531   7400533   7500535   7600537'.
           05                               PIC  X(50) VALUE
               '   7700539   7800541   800054310180005531038000563'.
           05                               PIC  X(50) VALUE
               '10420005731050000583105400058910580005991074000609'.
           05                               PIC  X(50) VALUE
               '10780006191090000629110200063911100006491118000659'.
           05                               PIC  X(50) VALUE
               '11244006651126000675113000067911340006831146000693'.
           05                               PIC  X(50) VALUE
               '11500007031154000713116400071911700007291202000739'.
           05                               PIC  X(50) VALUE
               '12060007491210000759122200076912260007791242000789'.
           05                               PIC  X(50) VALUE
               '12540007991258000809126200081912700008291294000839'.
           05                               PIC  X(50) VALUE
               '12980008491302000859131400086913220008751338000885'.
           05                               PIC  X(50) VALUE
               '13460008951364400899137400090913780009191382000929'.
           05                               PIC  X(50) VALUE
               '13900009391398000949140100095514020009651406000969'.
           05                               PIC  X(50) VALUE
               '14100009751426000985144540099114484009951450001005'.
           05                               PIC  X(50) VALUE
               '14540010151474001025148600103515180010451526001055'.
           05                               PIC  X(50) VALUE
               '15380010651550001075155400108515680010911576401101'.
           05                               PIC  X(50) VALUE
               '15804011111594001121159800113116020011411606001147'.
           05                               PIC  X(50) VALUE
               '16180011571622001167163000117716540011831658001193'.
           05                               PIC  X(50) VALUE
               '16620012031670001213167400122316820012331686001243'.
           05                               PIC  X(50) VALUE
               '16940012531697401263170200127317140012831730001293'.
           05                               PIC  X(50) VALUE
               '17420013031746001313176600132317780013331782001343'.
           05                               PIC  X(50) VALUE
               '17860013531790001363179800137318020013831814001393'.
           05                               PIC  X(50) VALUE
               '18580014031870001413188800142319060014331912401443'.
           05                               PIC  X(50) VALUE
               '19140014531918001463192600146719300014731934001483'.
           05                               PIC  X(50) VALUE
               '19380014931946001503195000151319660015231974001533'.
           05                               PIC  X(50) VALUE
               '19780015431980401553200200156320100015732022001583'.
           05                               PIC  X(50) VALUE
               '20260015932050001603205240160920700016152074001625'.
           05                               PIC  X(50) VALUE
               '20764016292094001639209940164521060016552114001665'.
           05                               PIC  X(50) VALUE
               '21300016752134001685214200168921500016992166001709'.
           05                               PIC  X(50) VALUE
               '21780017192182001729219400173322020017432214001753'.
           05                               PIC  X(50) VALUE
               '22180017632222001773223800178322420017932250001803'.
           05                               PIC  X(50) VALUE
               '22520018132254001823226600183322744018432290001853'.
           05                               PIC  X(50) VALUE
               '23060018632310401873234200188323460018932354001903'.
           05                               PIC  X(50) VALUE
               '23580019132384401923239000192924020019392414001949'.
           05                               PIC  X(50) VALUE
               '24220019592426001965243000197524340019852442001991'.
           05                               PIC  X(50) VALUE
               '24500020012454002011245800202124660020312478002041'.
           05                               PIC  X(50) VALUE
               '24860020512502002061250600207125180020812522002087'.
           05                               PIC  X(50) VALUE
               '25260020972542002107255000211725540021272562002137'.
           05                               PIC  X(50) VALUE
               '25860021472594002153259800216326100021672614002173'.
           05                               PIC  X(50) VALUE
               '26180021772630002187263800219726420022072658002217'.
           05                               PIC  X(50) VALUE
               '26620022272682002237269000224726980022572706002267'.
           05                               PIC  X(50) VALUE
               '27100022772714002287271800229727260023072734002317'.
           05                               PIC  X(50) VALUE
               '27500023272762002337277400234727780023572786002367'.
           05                               PIC  X(50) VALUE
               '27900023772798002383280200239328100024032814002413'.
           05                               PIC  X(50) VALUE
               '28420024232866002433287000244328740024532894002463'.
           05                               PIC  X(50) VALUE
               '29020024732910002483291400248729180024972920002503'.
           05                               PIC  X(50) VALUE
               '29340025132940402523294200253329460025432954002553'.
           05                               PIC  X(50) VALUE
               '29620025632970002573297400258329820025932994002603'.
           05                               PIC  X(50) VALUE
               '30020026133014002623303000263330340026433046002653'.
           05                               PIC  X(50) VALUE
               '30620026633070002673307800268330860026933098002703'.
           05                               PIC  X(50) VALUE
               '31020027133108402723311400273331180027433134002753'.
           05                               PIC  X(50) VALUE
               '31420027633146002773315400278331700027933174002803'.
           05                               PIC  X(50) VALUE
               '31860028133190002823324200283332580028433278002853'.
           05                               PIC  X(50) VALUE
               '32820028633290002873331240288333140028933322002899'.
           05                               PIC  X(50) VALUE
               '33260029093334002919334600292933540029393366002949'.
           05                               PIC  X(50) VALUE
               '33700029593374002969337800297933860029893387402995'.
           05                               PIC  X(50) VALUE
               '34060030053410003015345800302534620030353474003045'.
           05                               PIC  X(50) VALUE
               '34820030553490003065349400307534980030853500403095'.
           05                               PIC  X(50) VALUE
               '35084031053510003111353000312135380031313561403137'.
           05                               PIC  X(50) VALUE
               '35644031413566003151358400316135980031713608403181'.
           05                               PIC  X(50) VALUE
               '36100031913614003201362200321136260032213642003231'.
           05                               PIC  X(50) VALUE
               '36500032413654003251367400326136780032713698003281'.
           05                               PIC  X(50) VALUE
               '37100032913734003301373800330537460033153762003325'.
           05                               PIC  X(50) VALUE
               '37700033293776403333378600334337900033533796403363'.
           05                               PIC  X(50) VALUE
               '38060033733822003383383000339338340034033854003413'.
           05                               PIC  X(50) VALUE
               '38660034233886003433389000344338940034533910003457'.
           05                               PIC  X(50) VALUE
               '39140034673930003477393400348739380034973946003507'.
           05                               PIC  X(50) VALUE
               '39540035173958003527396600353739740035473982003557'.
           05                               PIC  X(50) VALUE
               '39900035674006003577401400358740220035974034003607'.
           05                               PIC  X(50) VALUE
               '40380036174042003627404840363740580036474066003657'.
           05                               PIC  X(50) VALUE
               '40900036674098003677410600368741100036974114003707'.
           05                               PIC  X(50) VALUE
               '41180037174142003727415000373741540037474162003757'.
           05                               PIC  X(50) VALUE
               '41660037674170003777417400378741780037914188403801'.
           05                               PIC  X(50) VALUE
               '41900038114194003821419800383142020038414203403847'.
           05                               PIC  X(50) VALUE
               '42044038514206003855421000386542140038754220003881'.
           05                               PIC  X(50) VALUE
               '42220038914234003901425400391142644039214268003931'.
           05                               PIC  X(50) VALUE
               '42700039374310003947433000395743340039674342003973'.
           05                               PIC  X(50) VALUE
               '43524039794358003989436200399943780040094390004019'.
           05                               PIC  X(50) VALUE
               '44060040294410004039441400404944180040594422004069'.
           05                               PIC  X(50) VALUE
               '44300040794442004085446000408944700040994494004109'.
           05                               PIC  X(50) VALUE
               '45060041194510404129452200413945300041494546004159'.
           05                               PIC  X(50) VALUE
               '45500041694554004175457800418545820041954594004205'.
           05                               PIC  X(50) VALUE
               '46060042154614004225462200423546300042374634004247'.
           05                               PIC  X(50) VALUE
               '46520042534654004263466600427346700042834702004293'.
           05                               PIC  X(50) VALUE
               '47220043034726004313473000432347380043334746004339'.
           05                               PIC  X(50) VALUE
               '47580043494764404353476640435947894043694794004379'.
           05                               PIC  X(50) VALUE
               '48060043854814004395482600440148300044114842404421'.
           05                               PIC  X(50) VALUE
               '48540044314862004441486600445148700044614886404471'.
           05                               PIC  X(50) VALUE
               '48900044814902004491491800450149340045114942004521'.
           05                               PIC  X(50) VALUE
               '49500045254962004535496600454549700045554974004565'.
       01  BUN-CBSA-TABLE REDEFINES BUN-CBSA-FILLER.
           05  BUN-CBSA-ENTRY OCCURS 500 TIMES
                   ASCENDING KEY IS BUN-CBSA-VALUE
                   INDEXED BY BUN-INDX.
               10  BUN-CBSA-VALUE           PIC  X(05).
               10  BUN-PTR                  PIC  9(05).
       01  BUN-MAX                         PIC S9(07) COMP-3 VALUE +500.
       01  BUN-WAGE-INDEX-FILLER.
           05                               PIC  X(32) VALUE
               '00107380002072600030712100407147'.
           05                               PIC  X(32) VALUE
               '00506914006069100070687300806828'.
           05                               PIC  X(32) VALUE
               '00906731010066420011262600212846'.
           05                               PIC  X(32) VALUE
               '00312807004136620051317500613214'.
           05                               PIC  X(32) VALUE
               '00714366008134430091196301012688'.
           05                               PIC  X(32) VALUE
               '00109095002088260030918200409166'.
           05                               PIC  X(32) VALUE
               '00509219006090340070889200808902'.
           05                               PIC  X(32) VALUE
               '00909181010091690010722200207194'.
           05                               PIC  X(32) VALUE
               '00307350004073430050731100607219'.
           05                               PIC  X(32) VALUE
               '00707263008070790090702101007278'.
           05                               PIC  X(32) VALUE
               '00112056002121940031256700412788'.
           05                               PIC  X(32) VALUE
               '00513215006132910071301500813002'.
           05                               PIC  X(32) VALUE
               '00912783010128900010993300210126'.
           05                               PIC  X(32) VALUE
               '00310208004098020050964600609746'.
           05                               PIC  X(32) VALUE
               '00710003008101200091007501010081'.
           05                               PIC  X(32) VALUE
               '00111128002112870031112800411311'.
           05                               PIC  X(32) VALUE
               '00511295006111490071114500810961'.
           05                               PIC  X(32) VALUE
               '00910775010103010010975700210008'.
           05                               PIC  X(32) VALUE
               '00310171004100920010840900208361'.
           05                               PIC  X(32) VALUE
               '00308062004079850050837100608294'.
           05                               PIC  X(32) VALUE
               '00708146008082420090820901008190'.
           05                               PIC  X(32) VALUE
               '00107566002075470030742100407459'.
           05                               PIC  X(32) VALUE
               '00507439006074330070742000807355'.
           05                               PIC  X(32) VALUE
               '00907325010074040011118900211200'.
           05                               PIC  X(32) VALUE
               '00310728004107390051087200610937'.
           05                               PIC  X(32) VALUE
               '00711143008114210091174801012238'.
           05                               PIC  X(32) VALUE
               '00107556002075310030758300407605'.
           05                               PIC  X(32) VALUE
               '00507398006068720070732000807582'.
           05                               PIC  X(32) VALUE
               '00907953010080090010834300208426'.
           05                               PIC  X(32) VALUE
               '00308438004084340050836900608488'.
           05                               PIC  X(32) VALUE
               '00708524008085080090849101008242'.
           05                               PIC  X(32) VALUE
               '00108391002085510030847200408513'.
           05                               PIC  X(32) VALUE
               '00508416006082970070816700808088'.
           05                               PIC  X(32) VALUE
               '00908237010083190010854500208618'.
           05                               PIC  X(32) VALUE
               '00308351004084340050845100608412'.
           05                               PIC  X(32) VALUE
               '00708254008083600090834201008402'.
           05                               PIC  X(32) VALUE
               '00107981002080410030799700407929'.
           05                               PIC  X(32) VALUE
               '00507779006076880070768800807726'.
           05                               PIC  X(32) VALUE
               '00907781010076670010783000207825'.
           05                               PIC  X(32) VALUE
               '00307877004077840050774800607742'.
           05                               PIC  X(32) VALUE
               '00707905008078250090794001007981'.
           05                               PIC  X(32) VALUE
               '00107712002077490030771800407585'.
           05                               PIC  X(32) VALUE
               '00507108006069590070705000806972'.
           05                               PIC  X(32) VALUE
               '00907012010069560010858800208581'.
           05                               PIC  X(32) VALUE
               '00308300004082380050858300608477'.
           05                               PIC  X(32) VALUE
               '00708406008084680090861701008411'.
           05                               PIC  X(32) VALUE
               '00109175002092910030879700408696'.
           05                               PIC  X(32) VALUE
               '00508746006086730070873800808893'.
           05                               PIC  X(32) VALUE
               '00908883010088460011176900213962'.
           05                               PIC  X(32) VALUE
               '00313540004136140051155300611235'.
           05                               PIC  X(32) VALUE
               '00710836008110660091076001011059'.
           05                               PIC  X(32) VALUE
               '00108555002082950030838700408270'.
           05                               PIC  X(32) VALUE
               '00508288006083800070838200808413'.
           05                               PIC  X(32) VALUE
               '00908430010083680010903800209107'.
           05                               PIC  X(32) VALUE
               '00309053004091330050912400609020'.
           05                               PIC  X(32) VALUE
               '00709042008090010090900801009045'.
           05                               PIC  X(32) VALUE
               '00107620002075390030753700407568'.
           05                               PIC  X(32) VALUE
               '00507570006074200070750000807481'.
           05                               PIC  X(32) VALUE
               '00907320010074970010765500207673'.
           05                               PIC  X(32) VALUE
               '00307622004077750050772500607732'.
           05                               PIC  X(32) VALUE
               '00707776008077550090777501007855'.
           05                               PIC  X(32) VALUE
               '00108517002086150030860000409098'.
           05                               PIC  X(32) VALUE
               '00509024006092110070929300808953'.
           05                               PIC  X(32) VALUE
               '00908321010086920010891100208872'.
           05                               PIC  X(32) VALUE
               '00308733004088550050887700608451'.
           05                               PIC  X(32) VALUE
               '00708859008088440090888001008934'.
           05                               PIC  X(32) VALUE
               '00109350002096370030973900409781'.
           05                               PIC  X(32) VALUE
               '00509516006092990070897900807890'.
           05                               PIC  X(32) VALUE
               '00908865010089880011020700210441'.
           05                               PIC  X(32) VALUE
               '00310372004103390051038600610041'.
           05                               PIC  X(32) VALUE
               '00710212008106330091035701010057'.
           05                               PIC  X(32) VALUE
               '00108911002088780030887900408922'.
           05                               PIC  X(32) VALUE
               '00508811006085130070848300808481'.
           05                               PIC  X(32) VALUE
               '00908624010087710010818500208152'.
           05                               PIC  X(32) VALUE
               '00308199004082200050819200608247'.
           05                               PIC  X(32) VALUE
               '00708408008084990090849901008448'.
           05                               PIC  X(32) VALUE
               '00108359002082880030827100408100'.
           05                               PIC  X(32) VALUE
               '00507899006079630070795800807797'.
           05                               PIC  X(32) VALUE
               '00907833010077980010683100207295'.
           05                               PIC  X(32) VALUE
               '00306891004067850050709900607409'.
           05                               PIC  X(32) VALUE
               '00707698008079410090849301008504'.
           05                               PIC  X(32) VALUE
               '00108561002084550030847000408377'.
           05                               PIC  X(32) VALUE
               '00508348006083070070825100808053'.
           05                               PIC  X(32) VALUE
               '00908022010081040010786000207848'.
           05                               PIC  X(32) VALUE
               '00307783004077040050779900607632'.
           05                               PIC  X(32) VALUE
               '00707838008077280090769501007703'.
           05                               PIC  X(32) VALUE
               '00110029002103370030950000409435'.
           05                               PIC  X(32) VALUE
               '00509949006101030071049900810523'.
           05                               PIC  X(32) VALUE
               '00910612010105610010848000208450'.
           05                               PIC  X(32) VALUE
               '00308380004084300050808300608087'.
           05                               PIC  X(32) VALUE
               '00708048008079480090796201007984'.
           05                               PIC  X(32) VALUE
               '00106000002055000030500000404500'.
           05                               PIC  X(32) VALUE
               '00504000006040000070400000804000'.
           05                               PIC  X(32) VALUE
               '00905000010050000010841300208277'.
           05                               PIC  X(32) VALUE
               '00308338004083290050837000608242'.
           05                               PIC  X(32) VALUE
               '00708181008080980090815001008305'.
           05                               PIC  X(32) VALUE
               '00108536002083000030812400408164'.
           05                               PIC  X(32) VALUE
               '00508312006080320070821300807815'.
           05                               PIC  X(32) VALUE
               '00907800010078860010788600207734'.
           05                               PIC  X(32) VALUE
               '00307559004074440050727700607329'.
           05                               PIC  X(32) VALUE
               '00707252008072070090713001007076'.
           05                               PIC  X(32) VALUE
               '00107806002079340030797800407874'.
           05                               PIC  X(32) VALUE
               '00507847006077660070778300807884'.
           05                               PIC  X(32) VALUE
               '00908139010081310010864900208719'.
           05                               PIC  X(32) VALUE
               '00308516004087320050900500609259'.
           05                               PIC  X(32) VALUE
               '00709130008090910090887201008896'.
           05                               PIC  X(32) VALUE
               '00109591002097090030972500409740'.
           05                               PIC  X(32) VALUE
               '00509527006096800070964100809895'.
           05                               PIC  X(32) VALUE
               '00909820010096110010799300207505'.
           05                               PIC  X(32) VALUE
               '00307185004070600050709100606838'.
           05                               PIC  X(32) VALUE
               '00707108008067420090739801006964'.
           05                               PIC  X(32) VALUE
               '00107841002078170030772800407758'.
           05                               PIC  X(32) VALUE
               '00507554006076090070759300807689'.
           05                               PIC  X(32) VALUE
               '00907661010076690011018400210231'.
           05                               PIC  X(32) VALUE
               '00310092004105290051087700610878'.
           05                               PIC  X(32) VALUE
               '00710644008105070091040201010179'.
           05                               PIC  X(32) VALUE
               '00107474002073710030733300407407'.
           05                               PIC  X(32) VALUE
               '00507274006073680070730300807350'.
           05                               PIC  X(32) VALUE
               '00907354010073000010918600208977'.
           05                               PIC  X(32) VALUE
               '00309142004089040050908700608884'.
           05                               PIC  X(32) VALUE
               '00709301008090730090895001008832'.
           05                               PIC  X(32) VALUE
               '00109528002094330030923800409243'.
           05                               PIC  X(32) VALUE
               '00509291006091400070917900809416'.
           05                               PIC  X(32) VALUE
               '00909407010096020011205600212194'.
           05                               PIC  X(32) VALUE
               '00409611005096110060961100709611'.
           05                               PIC  X(32) VALUE
               '00809611009096110100961100409611'.
           05                               PIC  X(32) VALUE
               '00509611006096110070961100809611'.
           05                               PIC  X(32) VALUE
               '00909611010096110040961100509611'.
           05                               PIC  X(32) VALUE
               '00609611007096110080961100909611'.
           05                               PIC  X(32) VALUE
               '01009611001078060020793400108409'.
           05                               PIC  X(32) VALUE
               '00208361001084090020836100107981'.
           05                               PIC  X(32) VALUE
               '00208041001077120020774900108561'.
           05                               PIC  X(32) VALUE
               '00208455001084800020845000107806'.
           05                               PIC  X(32) VALUE
               '00207934001120560021219400108545'.
           05                               PIC  X(32) VALUE
               '00208618001090380020910700108343'.
           05                               PIC  X(32) VALUE
               '00208426001091750020929100108003'.
           05                               PIC  X(32) VALUE
               '00208444003083240040822500507440'.
           05                               PIC  X(32) VALUE
               '00608205007082090080832800908214'.
           05                               PIC  X(32) VALUE
               '01008520001060000020550000305000'.
           05                               PIC  X(32) VALUE
               '00404500005040000060400000704000'.
           05                               PIC  X(32) VALUE
               '00804000009050000100500000108843'.
           05                               PIC  X(32) VALUE
               '00208814003087290040852100508539'.
           05                               PIC  X(32) VALUE
               '00608487007083370080825900908289'.
           05                               PIC  X(32) VALUE
               '01008332001090360020868700308435'.
           05                               PIC  X(32) VALUE
               '00408713005081280060918200709267'.
           05                               PIC  X(32) VALUE
               '00808863009086150100807000510879'.
           05                               PIC  X(32) VALUE
               '00610764007106580081082600910890'.
           05                               PIC  X(32) VALUE
               '01010831001086530020868000308647'.
           05                               PIC  X(32) VALUE
               '00408600005084530060840000708217'.
           05                               PIC  X(32) VALUE
               '00808165009081120100823900109456'.
           05                               PIC  X(32) VALUE
               '00209550003095420040966300509478'.
           05                               PIC  X(32) VALUE
               '00609261007091310080907300909130'.
           05                               PIC  X(32) VALUE
               '01009081001079950020802600307857'.
           05                               PIC  X(32) VALUE
               '00407788005078130060811000707948'.
           05                               PIC  X(32) VALUE
               '00808355009088880100855400109194'.
           05                               PIC  X(32) VALUE
               '00209260003090840040921500509121'.
           05                               PIC  X(32) VALUE
               '00609074007091760080923700909235'.
           05                               PIC  X(32) VALUE
               '01009470001086200020891700308898'.
           05                               PIC  X(32) VALUE
               '00409101005093450061043600710620'.
           05                               PIC  X(32) VALUE
               '00810686009103450100934600108644'.
           05                               PIC  X(32) VALUE
               '00208714003085060040830200508277'.
           05                               PIC  X(32) VALUE
               '00608189007082160080834800908157'.
           05                               PIC  X(32) VALUE
               '01008411001099700021000900309595'.
           05                               PIC  X(32) VALUE
               '00409425005093310060937600709335'.
           05                               PIC  X(32) VALUE
               '00809262009094180100919900512010'.
           05                               PIC  X(32) VALUE
               '00611794007121530081239300912565'.
           05                               PIC  X(32) VALUE
               '01012578001119640021213300312147'.
           05                               PIC  X(32) VALUE
               '00412221005124190061327700713162'.
           05                               PIC  X(32) VALUE
               '00812542009121830101229000109192'.
           05                               PIC  X(32) VALUE
               '00209266003095470040965400108691'.
           05                               PIC  X(32) VALUE
               '00208524003089290040876600110124'.
           05                               PIC  X(32) VALUE
               '00210128003101150041008600510219'.
           05                               PIC  X(32) VALUE
               '00609959007099090080989400910019'.
           05                               PIC  X(32) VALUE
               '01009968001079180020797900307539'.
           05                               PIC  X(32) VALUE
               '00407402005074660060707300707259'.
           05                               PIC  X(32) VALUE
               '00806864009073010100756300109361'.
           05                               PIC  X(32) VALUE
               '00209226003092680040944500509626'.
           05                               PIC  X(32) VALUE
               '00609390007092760080944900909264'.
           05                               PIC  X(32) VALUE
               '01009108005042130060412800704000'.
           05                               PIC  X(32) VALUE
               '00804237009050000100500000109001'.
           05                               PIC  X(32) VALUE
               '00208918003085550040851100508531'.
           05                               PIC  X(32) VALUE
               '00608593007086780080866300908949'.
           05                               PIC  X(32) VALUE
               '01008780001096590020964200309488'.
           05                               PIC  X(32) VALUE
               '00409244005087740060898600709063'.
           05                               PIC  X(32) VALUE
               '00808587009086890100889100109549'.
           05                               PIC  X(32) VALUE
               '00209575003095170040945200509369'.
           05                               PIC  X(32) VALUE
               '00609281007093220080936700909490'.
           05                               PIC  X(32) VALUE
               '01009371001111290021103300311977'.
           05                               PIC  X(32) VALUE
               '00412258005116920061167900711931'.
           05                               PIC  X(32) VALUE
               '00811914009125690101206800107190'.
           05                               PIC  X(32) VALUE
               '00207877003074370040777100508071'.
           05                               PIC  X(32) VALUE
               '00607633007074220080745200907510'.
           05                               PIC  X(32) VALUE
               '01006782001095380020952900309373'.
           05                               PIC  X(32) VALUE
               '00409150005092250060937200708805'.
           05                               PIC  X(32) VALUE
               '00809055009088100100882600109514'.
           05                               PIC  X(32) VALUE
               '00209535003097460040957600509545'.
           05                               PIC  X(32) VALUE
               '00609608007096750080988200909553'.
           05                               PIC  X(32) VALUE
               '01009396001117070021181700311611'.
           05                               PIC  X(32) VALUE
               '00411579005119440061220100711899'.
           05                               PIC  X(32) VALUE
               '00811993009124360101241700110255'.
           05                               PIC  X(32) VALUE
               '00210151003101470040987300509950'.
           05                               PIC  X(32) VALUE
               '00609725007095830080950600909568'.
           05                               PIC  X(32) VALUE
               '01009581001097770020997900310184'.
           05                               PIC  X(32) VALUE
               '00409710005098250060998000709990'.
           05                               PIC  X(32) VALUE
               '00810061009097690101023800112823'.
           05                               PIC  X(32) VALUE
               '00212838003128430041300700513124'.
           05                               PIC  X(32) VALUE
               '00613393007127270081324800912989'.
           05                               PIC  X(32) VALUE
               '01012602001085830020852300308147'.
           05                               PIC  X(32) VALUE
               '00408078005079760060806100707974'.
           05                               PIC  X(32) VALUE
               '00807678009079610100798800109656'.
           05                               PIC  X(32) VALUE
               '00209935003099120040991500510112'.
           05                               PIC  X(32) VALUE
               '00610506007101340080900200909541'.
           05                               PIC  X(32) VALUE
               '01008948001092210020892700309181'.
           05                               PIC  X(32) VALUE
               '00409486005096300060978500709841'.
           05                               PIC  X(32) VALUE
               '00809886009091500100933200108488'.
           05                               PIC  X(32) VALUE
               '00208723003085330040859800508508'.
           05                               PIC  X(32) VALUE
               '00608287007083890080856200908927'.
           05                               PIC  X(32) VALUE
               '01008529005080240060792100707630'.
           05                               PIC  X(32) VALUE
               '00807811009077870100749300111390'.
           05                               PIC  X(32) VALUE
               '00211748003114150041189000512403'.
           05                               PIC  X(32) VALUE
               '00612696007130370081209200912105'.
           05                               PIC  X(32) VALUE
               '01012089001113720021139500311119'.
           05                               PIC  X(32) VALUE
               '00411807005117100061197100711980'.
           05                               PIC  X(32) VALUE
               '00811947009116690101162500110525'.
           05                               PIC  X(32) VALUE
               '00210305003103740041031900108674'.
           05                               PIC  X(32) VALUE
               '00208576003087370040869100508686'.
           05                               PIC  X(32) VALUE
               '00608757007088550080880000908996'.
           05                               PIC  X(32) VALUE
               '01009224001087190020873100308707'.
           05                               PIC  X(32) VALUE
               '00408602005084760060815800708521'.
           05                               PIC  X(32) VALUE
               '00808445009083590100840900108611'.
           05                               PIC  X(32) VALUE
               '00208436003085160040836700508189'.
           05                               PIC  X(32) VALUE
               '00608246007081180080816800908141'.
           05                               PIC  X(32) VALUE
               '01007832001073480020723200307261'.
           05                               PIC  X(32) VALUE
               '00407282005072160060711000707820'.
           05                               PIC  X(32) VALUE
               '00807903009083280100864700108314'.
           05                               PIC  X(32) VALUE
               '00208281003083480040831900508473'.
           05                               PIC  X(32) VALUE
               '00608503007083880080839900908571'.
           05                               PIC  X(32) VALUE
               '01008669005091650060908600709226'.
           05                               PIC  X(32) VALUE
               '00809255009093600100923500108989'.
           05                               PIC  X(32) VALUE
               '00208725003087520040930400509062'.
           05                               PIC  X(32) VALUE
               '00609169007088810080856100909460'.
           05                               PIC  X(32) VALUE
               '01008810001094390020947700309502'.
           05                               PIC  X(32) VALUE
               '00409310005093470060899100709462'.
           05                               PIC  X(32) VALUE
               '00808782009090890100889100109273'.
           05                               PIC  X(32) VALUE
               '00209279003088970040925900509205'.
           05                               PIC  X(32) VALUE
               '00609329007090850080887400909258'.
           05                               PIC  X(32) VALUE
               '01009242005126790061302800713086'.
           05                               PIC  X(32) VALUE
               '00812897009125580101242600112178'.
           05                               PIC  X(32) VALUE
               '00212283003123780041245300110065'.
           05                               PIC  X(32) VALUE
               '00210086003105740040985000509907'.
           05                               PIC  X(32) VALUE
               '00609774007103030081020700910296'.
           05                               PIC  X(32) VALUE
               '01010226001086660020859900308665'.
           05                               PIC  X(32) VALUE
               '00408573005084100060824400708297'.
           05                               PIC  X(32) VALUE
               '00808229009081250100815300110667'.
           05                               PIC  X(32) VALUE
               '00211288003108290041026800510836'.
           05                               PIC  X(32) VALUE
               '00611100007111970081101500910748'.
           05                               PIC  X(32) VALUE
               '01010964001125470021291400313170'.
           05                               PIC  X(32) VALUE
               '00413252005132890061334600713223'.
           05                               PIC  X(32) VALUE
               '00812925009126140101233100109173'.
           05                               PIC  X(32) VALUE
               '00209183003086120040817900507876'.
           05                               PIC  X(32) VALUE
               '00608373007082280080845400908526'.
           05                               PIC  X(32) VALUE
               '01008547001092090020906800308792'.
           05                               PIC  X(32) VALUE
               '00408457005084860060854100708213'.
           05                               PIC  X(32) VALUE
               '00807980009084000100810100109530'.
           05                               PIC  X(32) VALUE
               '00209750003099990041004500510240'.
           05                               PIC  X(32) VALUE
               '00610435007105060081059600910393'.
           05                               PIC  X(32) VALUE
               '01010487001088630020866500308485'.
           05                               PIC  X(32) VALUE
               '00408529005085900060853900708462'.
           05                               PIC  X(32) VALUE
               '00808464009084990100843400109947'.
           05                               PIC  X(32) VALUE
               '00210021003099970041013000510121'.
           05                               PIC  X(32) VALUE
               '00610154007102560081004300910018'.
           05                               PIC  X(32) VALUE
               '01009753005085930060936700709083'.
           05                               PIC  X(32) VALUE
               '00809200009086640100950000111250'.
           05                               PIC  X(32) VALUE
               '00211210003112620041114600511159'.
           05                               PIC  X(32) VALUE
               '00611143007110110081094900911133'.
           05                               PIC  X(32) VALUE
               '01011025001103860021020200310474'.
           05                               PIC  X(32) VALUE
               '00410254005102870061011700710997'.
           05                               PIC  X(32) VALUE
               '00810776009107200101062900108749'.
           05                               PIC  X(32) VALUE
               '00208939003088340040873000508521'.
           05                               PIC  X(32) VALUE
               '00608469007084070080829500908060'.
           05                               PIC  X(32) VALUE
               '01008203001091950020934100309153'.
           05                               PIC  X(32) VALUE
               '00408683005092530060945600709403'.
           05                               PIC  X(32) VALUE
               '00809058009091750100930300108983'.
           05                               PIC  X(32) VALUE
               '00208672003088600040917400509094'.
           05                               PIC  X(32) VALUE
               '00608628007083240080844600908102'.
           05                               PIC  X(32) VALUE
               '01008015005083240060842400708398'.
           05                               PIC  X(32) VALUE
               '00808409009081650100822100110465'.
           05                               PIC  X(32) VALUE
               '00210597003105590041072100510679'.
           05                               PIC  X(32) VALUE
               '00610761007105260081074200910499'.
           05                               PIC  X(32) VALUE
               '01010070001096550021011700310143'.
           05                               PIC  X(32) VALUE
               '00410111005108600061007800710221'.
           05                               PIC  X(32) VALUE
               '00810366009090840100963100108844'.
           05                               PIC  X(32) VALUE
               '00208831003089440040896400508850'.
           05                               PIC  X(32) VALUE
               '00608712007086190080873300908653'.
           05                               PIC  X(32) VALUE
               '01008710005109570061100300710861'.
           05                               PIC  X(32) VALUE
               '00811020009117640101098900110235'.
           05                               PIC  X(32) VALUE
               '00209890003099070040941600509076'.
           05                               PIC  X(32) VALUE
               '00609948007092460080885100908586'.
           05                               PIC  X(32) VALUE
               '01008703001078950020814400308050'.
           05                               PIC  X(32) VALUE
               '00408119005079820060799200708181'.
           05                               PIC  X(32) VALUE
               '00808265009083000100806100109354'.
           05                               PIC  X(32) VALUE
               '00209063003088200040897200508968'.
           05                               PIC  X(32) VALUE
               '00608884007088890080899400908990'.
           05                               PIC  X(32) VALUE
               '01008925001094200020932100309215'.
           05                               PIC  X(32) VALUE
               '00409447005090730060907300709115'.
           05                               PIC  X(32) VALUE
               '00809275009093970100936200109342'.
           05                               PIC  X(32) VALUE
               '00209188003091950040920900509053'.
           05                               PIC  X(32) VALUE
               '00609470007094530080979900909250'.
           05                               PIC  X(32) VALUE
               '01009502001088290020874000308678'.
           05                               PIC  X(32) VALUE
               '00408783005087110060881400708636'.
           05                               PIC  X(32) VALUE
               '00808581009085890100852500109392'.
           05                               PIC  X(32) VALUE
               '00209844003097300040949400509798'.
           05                               PIC  X(32) VALUE
               '00609654007094890080962500909309'.
           05                               PIC  X(32) VALUE
               '01009188001105930021060000310600'.
           05                               PIC  X(32) VALUE
               '00410418005104190061040100710460'.
           05                               PIC  X(32) VALUE
               '00810553009105110101040500111533'.
           05                               PIC  X(32) VALUE
               '00211094003111970041161600511631'.
           05                               PIC  X(32) VALUE
               '00611605007116460081135100911554'.
           05                               PIC  X(32) VALUE
               '01011240001096990020943000309508'.
           05                               PIC  X(32) VALUE
               '00409470005094730060943900709387'.
           05                               PIC  X(32) VALUE
               '00809528009093960100933200107888'.
           05                               PIC  X(32) VALUE
               '00208193003080820040780200507526'.
           05                               PIC  X(32) VALUE
               '00607479007073610080767500907256'.
           05                               PIC  X(32) VALUE
               '01007518001077310020767400307592'.
           05                               PIC  X(32) VALUE
               '00407496005074680060754400707485'.
           05                               PIC  X(32) VALUE
               '00807357009071140100734800109050'.
           05                               PIC  X(32) VALUE
               '00208941003090820040930300509233'.
           05                               PIC  X(32) VALUE
               '00609376007091830080904400908855'.
           05                               PIC  X(32) VALUE
               '01008819001093640020936700309218'.
           05                               PIC  X(32) VALUE
               '00409064005091250060893700709742'.
           05                               PIC  X(32) VALUE
               '00808989009092290100930300109588'.
           05                               PIC  X(32) VALUE
               '00209690003095840040949700509289'.
           05                               PIC  X(32) VALUE
               '00609569007089580080896000908532'.
           05                               PIC  X(32) VALUE
               '01008764001094810020984600309364'.
           05                               PIC  X(32) VALUE
               '00409282005094410060913000710060'.
           05                               PIC  X(32) VALUE
               '00809524009095400100951300108282'.
           05                               PIC  X(32) VALUE
               '00208105003083390040819600508319'.
           05                               PIC  X(32) VALUE
               '00608440007082340080832300908220'.
           05                               PIC  X(32) VALUE
               '01008391001087330020875800308560'.
           05                               PIC  X(32) VALUE
               '00408601005083920060838700708266'.
           05                               PIC  X(32) VALUE
               '00808288009082960100847500109027'.
           05                               PIC  X(32) VALUE
               '00209040003088570040817000508293'.
           05                               PIC  X(32) VALUE
               '00608355007082540080807200907896'.
           05                               PIC  X(32) VALUE
               '01007907001094340020972300309564'.
           05                               PIC  X(32) VALUE
               '00409818005098810061030500709799'.
           05                               PIC  X(32) VALUE
               '00810254009100760101024400110141'.
           05                               PIC  X(32) VALUE
               '00209994003097630040980300509539'.
           05                               PIC  X(32) VALUE
               '00609678007096050080979200909679'.
           05                               PIC  X(32) VALUE
               '01009457001085850020867700308591'.
           05                               PIC  X(32) VALUE
               '00408433005087400060853300708575'.
           05                               PIC  X(32) VALUE
               '00809251009093770100936200110455'.
           05                               PIC  X(32) VALUE
               '00210898003107150041059600511404'.
           05                               PIC  X(32) VALUE
               '00611289007107310081069200910661'.
           05                               PIC  X(32) VALUE
               '01010962001088420020896100308916'.
           05                               PIC  X(32) VALUE
               '00408911005081560060858300708888'.
           05                               PIC  X(32) VALUE
               '00808811009087930100879800108186'.
           05                               PIC  X(32) VALUE
               '00207825003088360040805400508374'.
           05                               PIC  X(32) VALUE
               '00608788007074170080839300908504'.
           05                               PIC  X(32) VALUE
               '01008656001098600020984400309835'.
           05                               PIC  X(32) VALUE
               '00409831005097030060984700709895'.
           05                               PIC  X(32) VALUE
               '00809848009098620100974700108622'.
           05                               PIC  X(32) VALUE
               '00208374003088280040862500508386'.
           05                               PIC  X(32) VALUE
               '00608373007083380080839400908617'.
           05                               PIC  X(32) VALUE
               '01008730001096930020983200309977'.
           05                               PIC  X(32) VALUE
               '00409460005097510060958800709327'.
           05                               PIC  X(32) VALUE
               '00808894009093390100899300108168'.
           05                               PIC  X(32) VALUE
               '00207896003082180040788800507248'.
           05                               PIC  X(32) VALUE
               '00607287007072460080756600907117'.
           05                               PIC  X(32) VALUE
               '01007357001084000020905600309145'.
           05                               PIC  X(32) VALUE
               '00409306005097170060973000709466'.
           05                               PIC  X(32) VALUE
               '00809439009095350100905900109140'.
           05                               PIC  X(32) VALUE
               '00209281003091360040903400508938'.
           05                               PIC  X(32) VALUE
               '00609035007090230080886300908928'.
           05                               PIC  X(32) VALUE
               '01009378001076210020733400307261'.
           05                               PIC  X(32) VALUE
               '00407165005070290060728400706782'.
           05                               PIC  X(32) VALUE
               '00806883009066420100661000107916'.
           05                               PIC  X(32) VALUE
               '00208008003079930040815100507908'.
           05                               PIC  X(32) VALUE
               '00608188007080540080814700908313'.
           05                               PIC  X(32) VALUE
               '01008387001087360020886500308716'.
           05                               PIC  X(32) VALUE
               '00408560005083760060851900708014'.
           05                               PIC  X(32) VALUE
               '00808185009078690100789100110718'.
           05                               PIC  X(32) VALUE
               '00210647003104690041039500510429'.
           05                               PIC  X(32) VALUE
               '00610198007103340081035500910245'.
           05                               PIC  X(32) VALUE
               '01010183001096210020980100309616'.
           05                               PIC  X(32) VALUE
               '00409393005091680060933100709384'.
           05                               PIC  X(32) VALUE
               '00809307009092570100921700109699'.
           05                               PIC  X(32) VALUE
               '00209511003093610040923700509296'.
           05                               PIC  X(32) VALUE
               '00609135007090160080894700908940'.
           05                               PIC  X(32) VALUE
               '01008896001074350020739000307398'.
           05                               PIC  X(32) VALUE
               '00407108005071630060690800706776'.
           05                               PIC  X(32) VALUE
               '00806631009068000100700200109921'.
           05                               PIC  X(32) VALUE
               '00209909003098930040993900510291'.
           05                               PIC  X(32) VALUE
               '00610222007102340081075100910135'.
           05                               PIC  X(32) VALUE
               '01009921001087740020869800308662'.
           05                               PIC  X(32) VALUE
               '00408790005089420060886600708571'.
           05                               PIC  X(32) VALUE
               '00808992009088040100885500110565'.
           05                               PIC  X(32) VALUE
               '00210335003107410041012300510107'.
           05                               PIC  X(32) VALUE
               '00610333007100980081019800909687'.
           05                               PIC  X(32) VALUE
               '01009683001096640020969900309525'.
           05                               PIC  X(32) VALUE
               '00409669005098080060981600709702'.
           05                               PIC  X(32) VALUE
               '00809797009098690100971000511345'.
           05                               PIC  X(32) VALUE
               '00611472007113300081120500912263'.
           05                               PIC  X(32) VALUE
               '01012553005093720060912400709175'.
           05                               PIC  X(32) VALUE
               '00809022009088940100952500109639'.
           05                               PIC  X(32) VALUE
               '00209597003097050041010300509724'.
           05                               PIC  X(32) VALUE
               '00609696007097270080997100909892'.
           05                               PIC  X(32) VALUE
               '01009991001110060021086800310806'.
           05                               PIC  X(32) VALUE
               '00410985001092580020960100308602'.
           05                               PIC  X(32) VALUE
               '00408848005091620060840800708690'.
           05                               PIC  X(32) VALUE
               '00808809009093410100908800510299'.
           05                               PIC  X(32) VALUE
               '00610306007103230081008700910491'.
           05                               PIC  X(32) VALUE
               '01010502001084490020871900308294'.
           05                               PIC  X(32) VALUE
               '00407894005077010060742600707004'.
           05                               PIC  X(32) VALUE
               '00806959009076700100759000109465'.
           05                               PIC  X(32) VALUE
               '00209405003090970040933700509013'.
           05                               PIC  X(32) VALUE
               '00609236007093010080903600908852'.
           05                               PIC  X(32) VALUE
               '01009317001084450020852200308205'.
           05                               PIC  X(32) VALUE
               '00408725005086900060859600708794'.
           05                               PIC  X(32) VALUE
               '00808502009086520100857200108475'.
           05                               PIC  X(32) VALUE
               '00208515003084260040840400508139'.
           05                               PIC  X(32) VALUE
               '00608030007079790080790700907966'.
           05                               PIC  X(32) VALUE
               '01007889007086730080915800909113'.
           05                               PIC  X(32) VALUE
               '01008959001083600020814700307823'.
           05                               PIC  X(32) VALUE
               '00407940005077850060776800708024'.
           05                               PIC  X(32) VALUE
               '00807885009075870100766900111384'.
           05                               PIC  X(32) VALUE
               '00211587003114540041172300511622'.
           05                               PIC  X(32) VALUE
               '00611871007116400081150700911887'.
           05                               PIC  X(32) VALUE
               '01012220001084330020867900308401'.
           05                               PIC  X(32) VALUE
               '00408381005085370060887500708967'.
           05                               PIC  X(32) VALUE
               '00808979009090780100913800111080'.
           05                               PIC  X(32) VALUE
               '00211322003108160041099700511092'.
           05                               PIC  X(32) VALUE
               '00611064007106670081099800910874'.
           05                               PIC  X(32) VALUE
               '01010763001060000020550000305000'.
           05                               PIC  X(32) VALUE
               '00404500001080640020813600308108'.
           05                               PIC  X(32) VALUE
               '00407802005076400060770500707848'.
           05                               PIC  X(32) VALUE
               '00807911009079010100800000109339'.
           05                               PIC  X(32) VALUE
               '00209795003093230040973500509778'.
           05                               PIC  X(32) VALUE
               '00609561007093340080908800909476'.
           05                               PIC  X(32) VALUE
               '01009382001093230020921300308971'.
           05                               PIC  X(32) VALUE
               '00408601005080420060887800708250'.
           05                               PIC  X(32) VALUE
               '00808015009079830100843400108616'.
           05                               PIC  X(32) VALUE
               '00209263003092880040895500508598'.
           05                               PIC  X(32) VALUE
               '00608503007084580080844500908138'.
           05                               PIC  X(32) VALUE
               '01008323001124430021242700312369'.
           05                               PIC  X(32) VALUE
               '00412786005124230061222300711723'.
           05                               PIC  X(32) VALUE
               '00811816009115870101100700111496'.
           05                               PIC  X(32) VALUE
               '00211137003112570041123800511148'.
           05                               PIC  X(32) VALUE
               '00611327007112580081102600910865'.
           05                               PIC  X(32) VALUE
               '01010790001082520020821700308087'.
           05                               PIC  X(32) VALUE
               '00407999005080160060775300707741'.
           05                               PIC  X(32) VALUE
               '00807954009078020100795900108144'.
           05                               PIC  X(32) VALUE
               '00207738003076790040768400507577'.
           05                               PIC  X(32) VALUE
               '00606802007069160080691100906735'.
           05                               PIC  X(32) VALUE
               '01006563001092230020929100309158'.
           05                               PIC  X(32) VALUE
               '00409477005090840060901200708963'.
           05                               PIC  X(32) VALUE
               '00809122009089030100883500109892'.
           05                               PIC  X(32) VALUE
               '00209876003098330040970400509454'.
           05                               PIC  X(32) VALUE
               '00610149007103680081009100909886'.
           05                               PIC  X(32) VALUE
               '01009826001101600021016000310363'.
           05                               PIC  X(32) VALUE
               '00410378005099520060977600709771'.
           05                               PIC  X(32) VALUE
               '00809632009097780100956800107599'.
           05                               PIC  X(32) VALUE
               '00207620003078480040756100507593'.
           05                               PIC  X(32) VALUE
               '00607382007073390080701700907532'.
           05                               PIC  X(32) VALUE
               '01007635001093620020936800309633'.
           05                               PIC  X(32) VALUE
               '00409010005094230060889800708813'.
           05                               PIC  X(32) VALUE
               '00808506009086330100878900109474'.
           05                               PIC  X(32) VALUE
               '00209525003095160040953500509386'.
           05                               PIC  X(32) VALUE
               '00609526007094850080959000909703'.
           05                               PIC  X(32) VALUE
               '01009792001114220021128100311593'.
           05                               PIC  X(32) VALUE
               '00411768005117540061100900711097'.
           05                               PIC  X(32) VALUE
               '00810898009107210101148400107180'.
           05                               PIC  X(32) VALUE
               '00207934003076970040798300507517'.
           05                               PIC  X(32) VALUE
               '00607301007071570080692600906666'.
           05                               PIC  X(32) VALUE
               '01006764001091600020937500309631'.
           05                               PIC  X(32) VALUE
               '00409710005088910060967200710124'.
           05                               PIC  X(32) VALUE
               '00809071009092270100919400109223'.
           05                               PIC  X(32) VALUE
               '00209010003093270040925300509185'.
           05                               PIC  X(32) VALUE
               '00609007007091240080901700908741'.
           05                               PIC  X(32) VALUE
               '01008816001090840020919300309259'.
           05                               PIC  X(32) VALUE
               '00409418005094430060951300709357'.
           05                               PIC  X(32) VALUE
               '00809618009093220100933900510104'.
           05                               PIC  X(32) VALUE
               '00610315007103720081058700910552'.
           05                               PIC  X(32) VALUE
               '01010444001085070020850400308340'.
           05                               PIC  X(32) VALUE
               '00408367005084500060813800708042'.
           05                               PIC  X(32) VALUE
               '00808356009085200100803600109067'.
           05                               PIC  X(32) VALUE
               '00208690003085600040855000508733'.
           05                               PIC  X(32) VALUE
               '00608625007087210080861500908574'.
           05                               PIC  X(32) VALUE
               '01008502001077170020757300307250'.
           05                               PIC  X(32) VALUE
               '00407290005070470060735100707274'.
           05                               PIC  X(32) VALUE
               '00807927009072980100802900509219'.
           05                               PIC  X(32) VALUE
               '00608726007087660080935500909652'.
           05                               PIC  X(32) VALUE
               '01009581001098500020939400309415'.
           05                               PIC  X(32) VALUE
               '00409270005097680060961500709298'.
           05                               PIC  X(32) VALUE
               '00809605009095820100934800109169'.
           05                               PIC  X(32) VALUE
               '00209145003091250040909100508799'.
           05                               PIC  X(32) VALUE
               '00608848007092000080882100908794'.
           05                               PIC  X(32) VALUE
               '01008816005100860061067600710603'.
           05                               PIC  X(32) VALUE
               '00809870009099970101006100108289'.
           05                               PIC  X(32) VALUE
               '00208462003079270040923500509102'.
           05                               PIC  X(32) VALUE
               '00609818007077700080782800908097'.
           05                               PIC  X(32) VALUE
               '01008303001094960020955300309593'.
           05                               PIC  X(32) VALUE
               '00409653005096490060940300709153'.
           05                               PIC  X(32) VALUE
               '00809303009090580100898800109586'.
           05                               PIC  X(32) VALUE
               '00209824003097930040958700509426'.
           05                               PIC  X(32) VALUE
               '00609361007094820080923200909274'.
           05                               PIC  X(32) VALUE
               '01009346001088820020879800308638'.
           05                               PIC  X(32) VALUE
               '00408320005085350060853000708503'.
           05                               PIC  X(32) VALUE
               '00808561009087530100895200109370'.
           05                               PIC  X(32) VALUE
               '00209637003096940040934300509371'.
           05                               PIC  X(32) VALUE
               '00609448007093510080924600909375'.
           05                               PIC  X(32) VALUE
               '01009353001096440020962000309737'.
           05                               PIC  X(32) VALUE
               '00409604005091610060901400709375'.
           05                               PIC  X(32) VALUE
               '00809243009089730100888700106000'.
           05                               PIC  X(32) VALUE
               '00205500003050000040450000504000'.
           05                               PIC  X(32) VALUE
               '00604000007040000080400000905000'.
           05                               PIC  X(32) VALUE
               '01005000001088770020850500308544'.
           05                               PIC  X(32) VALUE
               '00408575005078960060783000707635'.
           05                               PIC  X(32) VALUE
               '00808264009079200100764700109254'.
           05                               PIC  X(32) VALUE
               '00209168003094220040923400509080'.
           05                               PIC  X(32) VALUE
               '00609093007088950080889600908931'.
           05                               PIC  X(32) VALUE
               '01009072005094520060816700708627'.
           05                               PIC  X(32) VALUE
               '00808635009084230100839600111205'.
           05                               PIC  X(32) VALUE
               '00210700003109920041112400511251'.
           05                               PIC  X(32) VALUE
               '00611170007111580081074900910797'.
           05                               PIC  X(32) VALUE
               '01010496001092960020940000309525'.
           05                               PIC  X(32) VALUE
               '00409533005097340060954200709380'.
           05                               PIC  X(32) VALUE
               '00809361009093850100957200109158'.
           05                               PIC  X(32) VALUE
               '00208773003090870040909000508946'.
           05                               PIC  X(32) VALUE
               '00608880007089550080897400908942'.
           05                               PIC  X(32) VALUE
               '01009563001109270021070000310869'.
           05                               PIC  X(32) VALUE
               '00411050005111190061111000710889'.
           05                               PIC  X(32) VALUE
               '00810920009109250101074000107714'.
           05                               PIC  X(32) VALUE
               '00207940003080350040793800507761'.
           05                               PIC  X(32) VALUE
               '00607521007079160080777000907655'.
           05                               PIC  X(32) VALUE
               '01007470001086930020885900308677'.
           05                               PIC  X(32) VALUE
               '00408492005085170060845500708545'.
           05                               PIC  X(32) VALUE
               '00808546009087110100878000508708'.
           05                               PIC  X(32) VALUE
               '00608645007085360080808200908108'.
           05                               PIC  X(32) VALUE
               '01007886001089580020892600308843'.
           05                               PIC  X(32) VALUE
               '00408700005085680060866600708615'.
           05                               PIC  X(32) VALUE
               '00808472009084530100832200108632'.
           05                               PIC  X(32) VALUE
               '00208523003080240040801600507625'.
           05                               PIC  X(32) VALUE
               '00607173007069520080741300907980'.
           05                               PIC  X(32) VALUE
               '01008221001118070021169800312156'.
           05                               PIC  X(32) VALUE
               '00412321001091510020907600308944'.
           05                               PIC  X(32) VALUE
               '00408474005087000060843200708461'.
           05                               PIC  X(32) VALUE
               '00808580009089170100846600107852'.
           05                               PIC  X(32) VALUE
               '00207841003079280040752500507381'.
           05                               PIC  X(32) VALUE
               '00607015007071380080698500907131'.
           05                               PIC  X(32) VALUE
               '01007230001098240020994500309933'.
           05                               PIC  X(32) VALUE
               '00409915005097340060967400709687'.
           05                               PIC  X(32) VALUE
               '00809750009098120101001800108953'.
           05                               PIC  X(32) VALUE
               '00208893003086350040894400508846'.
           05                               PIC  X(32) VALUE
               '00608838007085350080858900908434'.
           05                               PIC  X(32) VALUE
               '01008432001091910020899600308667'.
           05                               PIC  X(32) VALUE
               '00408455005086090060870600708468'.
           05                               PIC  X(32) VALUE
               '00807998009079150100809900109663'.
           05                               PIC  X(32) VALUE
               '00209336003091140040931200508933'.
           05                               PIC  X(32) VALUE
               '00608976007089900080899900908782'.
           05                               PIC  X(32) VALUE
               '01008780001096720020966200309870'.
           05                               PIC  X(32) VALUE
               '00410108005101330061005000710234'.
           05                               PIC  X(32) VALUE
               '00810150009102950101010600109657'.
           05                               PIC  X(32) VALUE
               '00210070003101200040985400509882'.
           05                               PIC  X(32) VALUE
               '00609852007095420080957000909944'.
           05                               PIC  X(32) VALUE
               '01009780001098420020881900309249'.
           05                               PIC  X(32) VALUE
               '00409326005094410060933200709455'.
           05                               PIC  X(32) VALUE
               '00809419009091700100916500109155'.
           05                               PIC  X(32) VALUE
               '00208938003085110040894400509345'.
           05                               PIC  X(32) VALUE
               '00608929007089920080886200909474'.
           05                               PIC  X(32) VALUE
               '01008816001080420020817200308177'.
           05                               PIC  X(32) VALUE
               '00408162005078910060796300707902'.
           05                               PIC  X(32) VALUE
               '00808148009082590100812200108404'.
           05                               PIC  X(32) VALUE
               '00208149003076720040772900507747'.
           05                               PIC  X(32) VALUE
               '00607586007072670080764700907678'.
           05                               PIC  X(32) VALUE
               '01007680001088840020888200308883'.
           05                               PIC  X(32) VALUE
               '00408956005091170060908200709078'.
           05                               PIC  X(32) VALUE
               '00808957009090340100870300107807'.
           05                               PIC  X(32) VALUE
               '00208074003079570040786100507549'.
           05                               PIC  X(32) VALUE
               '00607614007074280080822600907877'.
           05                               PIC  X(32) VALUE
               '01007441001094150020923400309458'.
           05                               PIC  X(32) VALUE
               '00409071005090790060903500708680'.
           05                               PIC  X(32) VALUE
               '00809086009089320100891400108434'.
           05                               PIC  X(32) VALUE
               '00208222003082630040846500508359'.
           05                               PIC  X(32) VALUE
               '00608567007085380080848000908503'.
           05                               PIC  X(32) VALUE
               '01008411001081050020779600307359'.
           05                               PIC  X(32) VALUE
               '00407226005074360060725000707235'.
           05                               PIC  X(32) VALUE
               '00807373009070820100712200108090'.
           05                               PIC  X(32) VALUE
               '00208715003081160040845000508540'.
           05                               PIC  X(32) VALUE
               '00608345007088610080837900907999'.
           05                               PIC  X(32) VALUE
               '01008015001077570020771800308084'.
           05                               PIC  X(32) VALUE
               '00407983005077860060781800707792'.
           05                               PIC  X(32) VALUE
               '00807855009078200100795200108214'.
           05                               PIC  X(32) VALUE
               '00208227003078280040798300508306'.
           05                               PIC  X(32) VALUE
               '00608008007079690080774500907607'.
           05                               PIC  X(32) VALUE
               '01007576005105610061068200711123'.
           05                               PIC  X(32) VALUE
               '00811580009118130101257800110292'.
           05                               PIC  X(32) VALUE
               '00209939003098340040995900510048'.
           05                               PIC  X(32) VALUE
               '00610395007100920080960200909859'.
           05                               PIC  X(32) VALUE
               '01009930001106190020980700310127'.
           05                               PIC  X(32) VALUE
               '00409657005095680060875100709327'.
           05                               PIC  X(32) VALUE
               '00808940009087430100903800109652'.
           05                               PIC  X(32) VALUE
               '00209637003096140040944700509430'.
           05                               PIC  X(32) VALUE
               '00609462007093260080925900909280'.
           05                               PIC  X(32) VALUE
               '01009351001099760020958200309708'.
           05                               PIC  X(32) VALUE
               '00409459005096170060978100709466'.
           05                               PIC  X(32) VALUE
               '00809801009099440100967600108798'.
           05                               PIC  X(32) VALUE
               '00209501003091020040892500509133'.
           05                               PIC  X(32) VALUE
               '00609065007091450080900700909492'.
           05                               PIC  X(32) VALUE
               '01009618001075880020739900307325'.
           05                               PIC  X(32) VALUE
               '00407192005071920060729000706988'.
           05                               PIC  X(32) VALUE
               '00807028009068710100671900109075'.
           05                               PIC  X(32) VALUE
               '00209170003089530040906600509034'.
           05                               PIC  X(32) VALUE
               '00608987007091060080889300908819'.
           05                               PIC  X(32) VALUE
               '01008878001078420020783800307575'.
           05                               PIC  X(32) VALUE
               '00407432005070150060752200707248'.
           05                               PIC  X(32) VALUE
               '00807356009072080100716900109130'.
           05                               PIC  X(32) VALUE
               '00209186003087560040906100508990'.
           05                               PIC  X(32) VALUE
               '00608958007090480080938600909270'.
           05                               PIC  X(32) VALUE
               '01009434001098030020968500310070'.
           05                               PIC  X(32) VALUE
               '00410205005095330060989300709467'.
           05                               PIC  X(32) VALUE
               '00809724009092840100957000109289'.
           05                               PIC  X(32) VALUE
               '00209507003093160040995400108489'.
           05                               PIC  X(32) VALUE
               '00208319003085650040823100507869'.
           05                               PIC  X(32) VALUE
               '00607972007078200080777400907904'.
           05                               PIC  X(32) VALUE
               '01007834005096380060988500709765'.
           05                               PIC  X(32) VALUE
               '00809799009095870100961300108196'.
           05                               PIC  X(32) VALUE
               '00207998003078130040776500507536'.
           05                               PIC  X(32) VALUE
               '00607594007075410080744700907731'.
           05                               PIC  X(32) VALUE
               '01007626001107810021031100310558'.
           05                               PIC  X(32) VALUE
               '00410658005104650061037600710367'.
           05                               PIC  X(32) VALUE
               '00810367009104450101017700110235'.
           05                               PIC  X(32) VALUE
               '00209967003097600040991200509199'.
           05                               PIC  X(32) VALUE
               '00609075007092000080930300909214'.
           05                               PIC  X(32) VALUE
               '01009887001084470020843200308262'.
           05                               PIC  X(32) VALUE
               '00408283005082460060807800707990'.
           05                               PIC  X(32) VALUE
               '00808032009078830100801100109344'.
           05                               PIC  X(32) VALUE
               '00209439003094520040969500509514'.
           05                               PIC  X(32) VALUE
               '00609440007093650080952000909176'.
           05                               PIC  X(32) VALUE
               '01009031001102980021047700310065'.
           05                               PIC  X(32) VALUE
               '00410618005107780061068300710520'.
           05                               PIC  X(32) VALUE
               '00810352009099880100983500107914'.
           05                               PIC  X(32) VALUE
               '00207730003074860040758600507471'.
           05                               PIC  X(32) VALUE
               '00607726007077950080790400907927'.
           05                               PIC  X(32) VALUE
               '01008029001092960020910600309044'.
           05                               PIC  X(32) VALUE
               '00409265005087390060870700708684'.
           05                               PIC  X(32) VALUE
               '00808773009085640100900400112099'.
           05                               PIC  X(32) VALUE
               '00212050003120760041162700511900'.
           05                               PIC  X(32) VALUE
               '00612080007120970081226900912085'.
           05                               PIC  X(32) VALUE
               '01011924001085330020885300308676'.
           05                               PIC  X(32) VALUE
               '00408664005088900060904600709049'.
           05                               PIC  X(32) VALUE
               '00809025009088030100867600108285'.
           05                               PIC  X(32) VALUE
               '00208545003083510040789300507918'.
           05                               PIC  X(32) VALUE
               '00607367007080490080728900907545'.
           05                               PIC  X(32) VALUE
               '01007438001078070020804200307994'.
           05                               PIC  X(32) VALUE
               '00408157005084530060817600708224'.
           05                               PIC  X(32) VALUE
               '00808566009094420100933500109358'.
           05                               PIC  X(32) VALUE
               '00209067003093260040921500509430'.
           05                               PIC  X(32) VALUE
               '00609636007094100080880000908426'.
           05                               PIC  X(32) VALUE
               '01008579001089030020903800309178'.
           05                               PIC  X(32) VALUE
               '00409048005087400060848100708439'.
           05                               PIC  X(32) VALUE
               '00808527009084100100847900108817'.
           05                               PIC  X(32) VALUE
               '00208833003090230040890200508972'.
           05                               PIC  X(32) VALUE
               '00608865007091950080890300909030'.
           05                               PIC  X(32) VALUE
               '01009045001092710020937100309226'.
           05                               PIC  X(32) VALUE
               '00409158005093420060911000709004'.
           05                               PIC  X(32) VALUE
               '00809203009088200100870100109617'.
           05                               PIC  X(32) VALUE
               '00209612003097260040946500509704'.
           05                               PIC  X(32) VALUE
               '00609571007095420080972100909820'.
           05                               PIC  X(32) VALUE
               '01009708001085460020855800308595'.
           05                               PIC  X(32) VALUE
               '00408632005083740060836100708094'.
           05                               PIC  X(32) VALUE
               '00808338009080880100802000108794'.
           05                               PIC  X(32) VALUE
               '00208592003084560040875400508819'.
           05                               PIC  X(32) VALUE
               '00608916007087900080872400908857'.
           05                               PIC  X(32) VALUE
               '01009004001085630020853000308550'.
           05                               PIC  X(32) VALUE
               '00408933005082110060831100708200'.
           05                               PIC  X(32) VALUE
               '00807999009076910100810600110296'.
           05                               PIC  X(32) VALUE
               '00209989003100810041046000509824'.
           05                               PIC  X(32) VALUE
               '00610810007110010081036700911501'.
           05                               PIC  X(32) VALUE
               '01010998001121300021228700312293'.
           05                               PIC  X(32) VALUE
               '00412417005124240061266400712721'.
           05                               PIC  X(32) VALUE
               '00812781009130550101309300108896'.
           05                               PIC  X(32) VALUE
               '00208900003088620040885200508605'.
           05                               PIC  X(32) VALUE
               '00608756007088590080868900908753'.
           05                               PIC  X(32) VALUE
               '01008844001088470020879400308870'.
           05                               PIC  X(32) VALUE
               '00408956005088300060845700708579'.
           05                               PIC  X(32) VALUE
               '00808689009086390100842000108694'.
           05                               PIC  X(32) VALUE
               '00208768003086150040877100508830'.
           05                               PIC  X(32) VALUE
               '00608942007091780080883600908642'.
           05                               PIC  X(32) VALUE
               '01008737001092020020912200308584'.
           05                               PIC  X(32) VALUE
               '00409014005091290060893500709192'.
           05                               PIC  X(32) VALUE
               '00809247009089550100851300107986'.
           05                               PIC  X(32) VALUE
               '00208114003080500040831700507789'.
           05                               PIC  X(32) VALUE
               '00607491007077590080752000907475'.
           05                               PIC  X(32) VALUE
               '01007576001112940021123400311264'.
           05                               PIC  X(32) VALUE
               '00411414005111300061104200710956'.
           05                               PIC  X(32) VALUE
               '00811174009107310101057300109869'.
           05                               PIC  X(32) VALUE
               '00210083003100420041005700510049'.
           05                               PIC  X(32) VALUE
               '00610074007098650080992800909605'.
           05                               PIC  X(32) VALUE
               '01009418001078470020791200307839'.
           05                               PIC  X(32) VALUE
               '00407843005092710060843200708273'.
           05                               PIC  X(32) VALUE
               '00808458009088890100917900109083'.
           05                               PIC  X(32) VALUE
               '00209346003094130040927700509084'.
           05                               PIC  X(32) VALUE
               '00609097007092930080971900910442'.
           05                               PIC  X(32) VALUE
               '01010407001089180020921500308993'.
           05                               PIC  X(32) VALUE
               '00408509005087710060840100707956'.
           05                               PIC  X(32) VALUE
               '00808215009085060100883900106000'.
           05                               PIC  X(32) VALUE
               '00205500003050000040450000504000'.
           05                               PIC  X(32) VALUE
               '00604000007040000080400000905000'.
           05                               PIC  X(32) VALUE
               '01005000001088370020887800308603'.
           05                               PIC  X(32) VALUE
               '00408393005081750060805700708078'.
           05                               PIC  X(32) VALUE
               '00808329009081060100826400110061'.
           05                               PIC  X(32) VALUE
               '00210318003104000041069000510492'.
           05                               PIC  X(32) VALUE
               '00611130007111310081058000910707'.
           05                               PIC  X(32) VALUE
               '01010695001092680020927500309049'.
           05                               PIC  X(32) VALUE
               '00409038005089910060881500708791'.
           05                               PIC  X(32) VALUE
               '00808860009088220100875300112359'.
           05                               PIC  X(32) VALUE
               '00212424003129960041273400512713'.
           05                               PIC  X(32) VALUE
               '00613554007133750081344700913862'.
           05                               PIC  X(32) VALUE
               '01013777001101280021008500310130'.
           05                               PIC  X(32) VALUE
               '00409870005096730060965300709519'.
           05                               PIC  X(32) VALUE
               '00809349009092360100948900109470'.
           05                               PIC  X(32) VALUE
               '00209358003096940040921600509472'.
           05                               PIC  X(32) VALUE
               '00609513007096930080948500909079'.
           05                               PIC  X(32) VALUE
               '01009319005079350060861800709127'.
           05                               PIC  X(32) VALUE
               '00809523009094690100923500109711'.
           05                               PIC  X(32) VALUE
               '00210514003106400041004900508940'.
           05                               PIC  X(32) VALUE
               '00609196007091230080911400908890'.
           05                               PIC  X(32) VALUE
               '01009932001101830020996100309931'.
           05                               PIC  X(32) VALUE
               '00409856005098920060976800709893'.
           05                               PIC  X(32) VALUE
               '00809822009096800100952900111143'.
           05                               PIC  X(32) VALUE
               '00211105003113360041121300511196'.
           05                               PIC  X(32) VALUE
               '00611144007111470081129500911206'.
           05                               PIC  X(32) VALUE
               '01011356001089210020915400309001'.
           05                               PIC  X(32) VALUE
               '00409142005088600060945000709246'.
           05                               PIC  X(32) VALUE
               '00809484009091660100927800107960'.
           05                               PIC  X(32) VALUE
               '00208002003074670040750700507539'.
           05                               PIC  X(32) VALUE
               '00607346007075340080730000907456'.
           05                               PIC  X(32) VALUE
               '01007506001121040021267000312841'.
           05                               PIC  X(32) VALUE
               '00413629005131360061323000713051'.
           05                               PIC  X(32) VALUE
               '00812747009128450101319500107993'.
           05                               PIC  X(32) VALUE
               '00207964003077170040753000507434'.
           05                               PIC  X(32) VALUE
               '00607645007077070080814200907914'.
           05                               PIC  X(32) VALUE
               '01007796001086840020872700308472'.
           05                               PIC  X(32) VALUE
               '00408718005092170060876600708121'.
           05                               PIC  X(32) VALUE
               '00808228009085220100892700108442'.
           05                               PIC  X(32) VALUE
               '00208103003078580040747500507678'.
           05                               PIC  X(32) VALUE
               '00607566007074710080730900907489'.
           05                               PIC  X(32) VALUE
               '01007567005101570061027900710124'.
           05                               PIC  X(32) VALUE
               '00810090009101020100990000108137'.
           05                               PIC  X(32) VALUE
               '00208197003082840040833900508270'.
           05                               PIC  X(32) VALUE
               '00608008007080440080790900908235'.
           05                               PIC  X(32) VALUE
               '01008237001070410020703100306768'.
           05                               PIC  X(32) VALUE
               '00406861005069830060728200707328'.
           05                               PIC  X(32) VALUE
               '00807087009069680100697400110363'.
           05                               PIC  X(32) VALUE
               '00210235003103400041065200509792'.
           05                               PIC  X(32) VALUE
               '00609426007093410080944400909673'.
           05                               PIC  X(32) VALUE
               '01009606001082060020781700308734'.
           05                               PIC  X(32) VALUE
               '00408743005091740060937200710056'.
           05                               PIC  X(32) VALUE
               '00810067009098100100894100109809'.
           05                               PIC  X(32) VALUE
               '00209967003110070041107600509670'.
           05                               PIC  X(32) VALUE
               '00609150007092180080935500909133'.
           05                               PIC  X(32) VALUE
               '01009102001087380020865300308717'.
           05                               PIC  X(32) VALUE
               '00408700005086200060849600708366'.
           05                               PIC  X(32) VALUE
               '00808388009084680100847700114604'.
           05                               PIC  X(32) VALUE
               '00214511003160450041537500516066'.
           05                               PIC  X(32) VALUE
               '00615803007158400081514400915542'.
           05                               PIC  X(32) VALUE
               '01015823001096980020974000309265'.
           05                               PIC  X(32) VALUE
               '00409108005087520060860300708461'.
           05                               PIC  X(32) VALUE
               '00808592009084120100861100109457'.
           05                               PIC  X(32) VALUE
               '00209340003090610040914100508969'.
           05                               PIC  X(32) VALUE
               '00608913007092960080896000908892'.
           05                               PIC  X(32) VALUE
               '01008841001123150021241600312698'.
           05                               PIC  X(32) VALUE
               '00412755005126550061296700712701'.
           05                               PIC  X(32) VALUE
               '00812781009128760101287400111460'.
           05                               PIC  X(32) VALUE
               '00211322003112230041126800511233'.
           05                               PIC  X(32) VALUE
               '00611174007110820081144300911418'.
           05                               PIC  X(32) VALUE
               '01011113005089940060879500708539'.
           05                               PIC  X(32) VALUE
               '00808282009082170100827800111515'.
           05                               PIC  X(32) VALUE
               '00211556003120610041188300512207'.
           05                               PIC  X(32) VALUE
               '00612456007121890081185200911770'.
           05                               PIC  X(32) VALUE
               '01011702001090700020902600308932'.
           05                               PIC  X(32) VALUE
               '00408752005088210060865100708201'.
           05                               PIC  X(32) VALUE
               '00808282009083240100820100512837'.
           05                               PIC  X(32) VALUE
               '00612961007128880081281300912776'.
           05                               PIC  X(32) VALUE
               '01012745001129550021305200312914'.
           05                               PIC  X(32) VALUE
               '00413089001088720020865300308237'.
           05                               PIC  X(32) VALUE
               '00408444005087050060818700708012'.
           05                               PIC  X(32) VALUE
               '00808228009081250100850000109481'.
           05                               PIC  X(32) VALUE
               '00209435003093750040942800509478'.
           05                               PIC  X(32) VALUE
               '00609690007097080080988600909717'.
           05                               PIC  X(32) VALUE
               '01009341001112150021122700311376'.
           05                               PIC  X(32) VALUE
               '00411821005118130061200500711762'.
           05                               PIC  X(32) VALUE
               '00812156009118180101170900116354'.
           05                               PIC  X(32) VALUE
               '00216080003166540041704800517109'.
           05                               PIC  X(32) VALUE
               '00617598007178940081725000917491'.
           05                               PIC  X(32) VALUE
               '01017895001084680020844900308455'.
           05                               PIC  X(32) VALUE
               '00408425005083020060819100708298'.
           05                               PIC  X(32) VALUE
               '00808287009086140100830100110879'.
           05                               PIC  X(32) VALUE
               '00210641003103070041058400510584'.
           05                               PIC  X(32) VALUE
               '00610629007108560081101200911137'.
           05                               PIC  X(32) VALUE
               '01010876001094360020980900309741'.
           05                               PIC  X(32) VALUE
               '00409661005098670060950700709138'.
           05                               PIC  X(32) VALUE
               '00809258009090150100859000109267'.
           05                               PIC  X(32) VALUE
               '00209220003090310040917000509225'.
           05                               PIC  X(32) VALUE
               '00609228007091440080919100909110'.
           05                               PIC  X(32) VALUE
               '01009004001088770020893400308810'.
           05                               PIC  X(32) VALUE
               '00408879005089550060878700709084'.
           05                               PIC  X(32) VALUE
               '00809098009090200100890000111269'.
           05                               PIC  X(32) VALUE
               '00211339003113970041160100512018'.
           05                               PIC  X(32) VALUE
               '00612306007117160081171000911603'.
           05                               PIC  X(32) VALUE
               '01011482001095830020986400310037'.
           05                               PIC  X(32) VALUE
               '00409756005096610060957600709571'.
           05                               PIC  X(32) VALUE
               '00809433009093890100928900109163'.
           05                               PIC  X(32) VALUE
               '00209128003090820040906300509115'.
           05                               PIC  X(32) VALUE
               '00608986007090250080902200908948'.
           05                               PIC  X(32) VALUE
               '01008717001095660020931900309433'.
           05                               PIC  X(32) VALUE
               '00409398005096560060945100709349'.
           05                               PIC  X(32) VALUE
               '00809422009093570100912900108370'.
           05                               PIC  X(32) VALUE
               '00208202003081170040779000507348'.
           05                               PIC  X(32) VALUE
               '00607964007079350080815700908783'.
           05                               PIC  X(32) VALUE
               '01008787001123770021283000313079'.
           05                               PIC  X(32) VALUE
               '00413113005128220061271000713360'.
           05                               PIC  X(32) VALUE
               '00813253009133240101351400109211'.
           05                               PIC  X(32) VALUE
               '00209042003088380040879000508971'.
           05                               PIC  X(32) VALUE
               '00608885007086450080888700908968'.
           05                               PIC  X(32) VALUE
               '01009036001084050020937300309880'.
           05                               PIC  X(32) VALUE
               '00408174001079540020838800307976'.
           05                               PIC  X(32) VALUE
               '00407876005079060060869400708304'.
           05                               PIC  X(32) VALUE
               '00808079009080290100810800107455'.
           05                               PIC  X(32) VALUE
               '00207647003074870040756900507556'.
           05                               PIC  X(32) VALUE
               '00606747007071280080695800907284'.
           05                               PIC  X(32) VALUE
               '01007248001082990020788500307662'.
           05                               PIC  X(32) VALUE
               '00407542001109790021069800310551'.
           05                               PIC  X(32) VALUE
               '00410553001082540020801300307819'.
           05                               PIC  X(32) VALUE
               '00407767005078980060753700707915'.
           05                               PIC  X(32) VALUE
               '00808315009082300100836600109149'.
           05                               PIC  X(32) VALUE
               '00208830003088820040843400508566'.
           05                               PIC  X(32) VALUE
               '00608749007089180080906600909044'.
           05                               PIC  X(32) VALUE
               '01008604001108030021076000310806'.
           05                               PIC  X(32) VALUE
               '00410849005111870061113300711145'.
           05                               PIC  X(32) VALUE
               '00810938009110360101109800110642'.
           05                               PIC  X(32) VALUE
               '00210566003104770041046500510383'.
           05                               PIC  X(32) VALUE
               '00610304007101360081008300909909'.
           05                               PIC  X(32) VALUE
               '01009905001080120020770000307847'.
           05                               PIC  X(32) VALUE
               '00408069005080210060775000707931'.
           05                               PIC  X(32) VALUE
               '00807779009083120100814700108605'.
           05                               PIC  X(32) VALUE
               '00208669003085850040866900508639'.
           05                               PIC  X(32) VALUE
               '00608584007086700080875400908513'.
           05                               PIC  X(32) VALUE
               '01008563001103710021061600310721'.
           05                               PIC  X(32) VALUE
               '00410920005108070061080200710627'.
           05                               PIC  X(32) VALUE
               '00810681009110170101085300109507'.
           05                               PIC  X(32) VALUE
               '00209426003095550040975400509672'.
           05                               PIC  X(32) VALUE
               '00609708007096660080878600908769'.
           05                               PIC  X(32) VALUE
               '01008934001060000020550000305000'.
           05                               PIC  X(32) VALUE
               '00404594005041540060429700704054'.
           05                               PIC  X(32) VALUE
               '00804056009050000100500000109899'.
           05                               PIC  X(32) VALUE
               '00209661003099750040998100510053'.
           05                               PIC  X(32) VALUE
               '00610073007102030081007800910199'.
           05                               PIC  X(32) VALUE
               '01010217001114760021145400311673'.
           05                               PIC  X(32) VALUE
               '00411766005119360061231500712216'.
           05                               PIC  X(32) VALUE
               '00812065009121390101192100110723'.
           05                               PIC  X(32) VALUE
               '00209784003095770040935200509159'.
           05                               PIC  X(32) VALUE
               '00609350007094080080914900908975'.
           05                               PIC  X(32) VALUE
               '01009068001113540021133900311325'.
           05                               PIC  X(32) VALUE
               '00411544001122340021226100312009'.
           05                               PIC  X(32) VALUE
               '00410161005109220061091100710909'.
           05                               PIC  X(32) VALUE
               '00810389009105730100986600110714'.
           05                               PIC  X(32) VALUE
               '00210639003106990041053900510634'.
           05                               PIC  X(32) VALUE
               '00610617007105780081068500910465'.
           05                               PIC  X(32) VALUE
               '01010360001093210020940400309133'.
           05                               PIC  X(32) VALUE
               '00409461005095030060959200709607'.
           05                               PIC  X(32) VALUE
               '00809628009094890100940000108721'.
           05                               PIC  X(32) VALUE
               '00208668003085180040821500508434'.
           05                               PIC  X(32) VALUE
               '00608301007082670080853000908398'.
           05                               PIC  X(32) VALUE
               '01008364001087590020880100308590'.
           05                               PIC  X(32) VALUE
               '00408734005088210060912500708785'.
           05                               PIC  X(32) VALUE
               '00808798009084030100856100110580'.
           05                               PIC  X(32) VALUE
               '00208630003091580040890300509597'.
           05                               PIC  X(32) VALUE
               '00610708007090420080889900908784'.
           05                               PIC  X(32) VALUE
               '01009093001098110020964800309488'.
           05                               PIC  X(32) VALUE
               '00409304005090030060955600709411'.
           05                               PIC  X(32) VALUE
               '00809318009093640100940700110442'.
           05                               PIC  X(32) VALUE
               '00210203003098230040956800508989'.
           05                               PIC  X(32) VALUE
               '00608841007083520080858100908470'.
           05                               PIC  X(32) VALUE
               '01008640001089040020921200309072'.
           05                               PIC  X(32) VALUE
               '00409220005087060060900500709627'.
           05                               PIC  X(32) VALUE
               '00809426009098150101007500114134'.
           05                               PIC  X(32) VALUE
               '00215584003145550041499000514791'.
           05                               PIC  X(32) VALUE
               '00614869007149680081474900914523'.
           05                               PIC  X(32) VALUE
               '01014128001104190021059600310328'.
           05                               PIC  X(32) VALUE
               '00410326005102660060960500709548'.
           05                               PIC  X(32) VALUE
               '00809455009092690100921000109661'.
           05                               PIC  X(32) VALUE
               '00209791003096950040972300509625'.
           05                               PIC  X(32) VALUE
               '00609634007093480080929500909281'.
           05                               PIC  X(32) VALUE
               '01009228001115700021146300311396'.
           05                               PIC  X(32) VALUE
               '00411497005115540061168400711724'.
           05                               PIC  X(32) VALUE
               '00811930009121300101215200108827'.
           05                               PIC  X(32) VALUE
               '00209166003090880040919500509233'.
           05                               PIC  X(32) VALUE
               '00609187007090340080884900908426'.
           05                               PIC  X(32) VALUE
               '01008891001109420021080200310708'.
           05                               PIC  X(32) VALUE
               '00411662005113980061121900710959'.
           05                               PIC  X(32) VALUE
               '00811395009107710101068600108595'.
           05                               PIC  X(32) VALUE
               '00208602003087040040874900508750'.
           05                               PIC  X(32) VALUE
               '00608633007084910080878200908579'.
           05                               PIC  X(32) VALUE
               '01008466001100330020993800309935'.
           05                               PIC  X(32) VALUE
               '00409751005097680060989800709997'.
           05                               PIC  X(32) VALUE
               '00809998009098620100974900110026'.
           05                               PIC  X(32) VALUE
               '00210185003102340041017200510168'.
           05                               PIC  X(32) VALUE
               '00609946007098650080980300909908'.
           05                               PIC  X(32) VALUE
               '01010115001090340020901800308898'.
           05                               PIC  X(32) VALUE
               '00408750005087810060876700709007'.
           05                               PIC  X(32) VALUE
               '00808586009084990100829600108635'.
           05                               PIC  X(32) VALUE
               '00208838003088440040892400508577'.
           05                               PIC  X(32) VALUE
               '00608553007087230080887700908893'.
           05                               PIC  X(32) VALUE
               '01008755001140530021377700314752'.
           05                               PIC  X(32) VALUE
               '00415498005158850061631400716601'.
           05                               PIC  X(32) VALUE
               '00816424009165080101682300108728'.
           05                               PIC  X(32) VALUE
               '00208512003088200040884900508638'.
           05                               PIC  X(32) VALUE
               '00608557007088030080877100908730'.
           05                               PIC  X(32) VALUE
               '01008629001110420021072400311010'.
           05                               PIC  X(32) VALUE
               '00410658005105240061027500709923'.
           05                               PIC  X(32) VALUE
               '00809863009096260100948900109133'.
           05                               PIC  X(32) VALUE
               '00209070003088700040934500509569'.
           05                               PIC  X(32) VALUE
               '00609630007095430080945600909315'.
           05                               PIC  X(32) VALUE
               '01009314001103020021025500309856'.
           05                               PIC  X(32) VALUE
               '00409834005098370060950500709540'.
           05                               PIC  X(32) VALUE
               '00809510009093690100949100109090'.
           05                               PIC  X(32) VALUE
               '00209165003094200040933600509366'.
           05                               PIC  X(32) VALUE
               '00609256007092140080922700909272'.
           05                               PIC  X(32) VALUE
               '01009389001111330021122400311069'.
           05                               PIC  X(32) VALUE
               '00411148005112750061072400710489'.
           05                               PIC  X(32) VALUE
               '00810715009107560101085300115686'.
           05                               PIC  X(32) VALUE
               '00215604003160740041582000515715'.
           05                               PIC  X(32) VALUE
               '00616213007172250081714400918162'.
           05                               PIC  X(32) VALUE
               '01017866001090050020922700309260'.
           05                               PIC  X(32) VALUE
               '00408948005092890060930900709942'.
           05                               PIC  X(32) VALUE
               '00809491009092800100933000109266'.
           05                               PIC  X(32) VALUE
               '00209415003090630040935000509501'.
           05                               PIC  X(32) VALUE
               '00609496007095790080963500909568'.
           05                               PIC  X(32) VALUE
               '01009728001083030020827300308221'.
           05                               PIC  X(32) VALUE
               '00408169005084160060888800708455'.
           05                               PIC  X(32) VALUE
               '00807798009079800100811000108998'.
           05                               PIC  X(32) VALUE
               '00209006003089360040891100508858'.
           05                               PIC  X(32) VALUE
               '00608660007085960080852400908618'.
           05                               PIC  X(32) VALUE
               '01008432001119790021195000311922'.
           05                               PIC  X(32) VALUE
               '00412213005123550061206000712605'.
           05                               PIC  X(32) VALUE
               '00812520009127440101256200108686'.
           05                               PIC  X(32) VALUE
               '00208167003083470040778800115733'.
           05                               PIC  X(32) VALUE
               '00215904003163270041674300517260'.
           05                               PIC  X(32) VALUE
               '00617354007176760081762900917622'.
           05                               PIC  X(32) VALUE
               '01018174001060000020550000305000'.
           05                               PIC  X(32) VALUE
               '00404550005047230060465600704636'.
           05                               PIC  X(32) VALUE
               '00804647009050000100500000116703'.
           05                               PIC  X(32) VALUE
               '00216878003173960041708600517840'.
           05                               PIC  X(32) VALUE
               '00617792007179340081792100918419'.
           05                               PIC  X(32) VALUE
               '01019126001060000020550000305000'.
           05                               PIC  X(32) VALUE
               '00404500005044380060427200704241'.
           05                               PIC  X(32) VALUE
               '00804267009050000100500000112915'.
           05                               PIC  X(32) VALUE
               '00213072003130810041303600513144'.
           05                               PIC  X(32) VALUE
               '00613351007131970081346500913684'.
           05                               PIC  X(32) VALUE
               '01013499005172600061741800717876'.
           05                               PIC  X(32) VALUE
               '00817896009179100101816900112162'.
           05                               PIC  X(32) VALUE
               '00212042003120380041211100111909'.
           05                               PIC  X(32) VALUE
               '00212246003126700041282500116740'.
           05                               PIC  X(32) VALUE
               '00217111003180620041793700517908'.
           05                               PIC  X(32) VALUE
               '00618563007187870081867400918746'.
           05                               PIC  X(32) VALUE
               '01018448001108470021066000310400'.
           05                               PIC  X(32) VALUE
               '00410136005098940061023500710135'.
           05                               PIC  X(32) VALUE
               '00810977009111450101059100512895'.
           05                               PIC  X(32) VALUE
               '00613235007130950081364400913949'.
           05                               PIC  X(32) VALUE
               '01014379001161430021610200316440'.
           05                               PIC  X(32) VALUE
               '00416679005167780061709900716635'.
           05                               PIC  X(32) VALUE
               '00816716009167040101723000108907'.
           05                               PIC  X(32) VALUE
               '00209095003089680040875700508770'.
           05                               PIC  X(32) VALUE
               '00608724007083520080799600907955'.
           05                               PIC  X(32) VALUE
               '01007916001082380020832800308260'.
           05                               PIC  X(32) VALUE
               '00408331005080490060832100708350'.
           05                               PIC  X(32) VALUE
               '00808368009085350100838700111556'.
           05                               PIC  X(32) VALUE
               '00211541003117710041173300511771'.
           05                               PIC  X(32) VALUE
               '00611965007115490081165300911769'.
           05                               PIC  X(32) VALUE
               '01011718001090970020903200308850'.
           05                               PIC  X(32) VALUE
               '00408760005088210060883800708645'.
           05                               PIC  X(32) VALUE
               '00808512009084230100798400507982'.
           05                               PIC  X(32) VALUE
               '00607846007077850080790600907957'.
           05                               PIC  X(32) VALUE
               '01007986001092330020930300309515'.
           05                               PIC  X(32) VALUE
               '00409203005094210060923500709518'.
           05                               PIC  X(32) VALUE
               '00809325009093890100938200108279'.
           05                               PIC  X(32) VALUE
               '00208011003085440040872300508633'.
           05                               PIC  X(32) VALUE
               '00608906007089930080920700908240'.
           05                               PIC  X(32) VALUE
               '01008973001085360020850500308412'.
           05                               PIC  X(32) VALUE
               '00408262005083250060828200709278'.
           05                               PIC  X(32) VALUE
               '00808686009084650100804700508937'.
           05                               PIC  X(32) VALUE
               '00609044007087950080906400908695'.
           05                               PIC  X(32) VALUE
               '01008391005101980060964000709797'.
           05                               PIC  X(32) VALUE
               '00809869009098800100985300109091'.
           05                               PIC  X(32) VALUE
               '00209538003090100040916300508915'.
           05                               PIC  X(32) VALUE
               '00608622007087530080844700908508'.
           05                               PIC  X(32) VALUE
               '01008482001092990020915300308338'.
           05                               PIC  X(32) VALUE
               '00408275005083470060788400708068'.
           05                               PIC  X(32) VALUE
               '00808184009082590100790900109948'.
           05                               PIC  X(32) VALUE
               '00209426003095310040942500509172'.
           05                               PIC  X(32) VALUE
               '00609240007095650080918500908959'.
           05                               PIC  X(32) VALUE
               '01009269001093830020932500309186'.
           05                               PIC  X(32) VALUE
               '00408782005082770060844700708387'.
           05                               PIC  X(32) VALUE
               '00808678009085120100856100110571'.
           05                               PIC  X(32) VALUE
               '00210504003108240041117400511425'.
           05                               PIC  X(32) VALUE
               '00612024007113010081137300911414'.
           05                               PIC  X(32) VALUE
               '01011109001091300020895800309179'.
           05                               PIC  X(32) VALUE
               '00409165005091190060908100709233'.
           05                               PIC  X(32) VALUE
               '00809302009091490100946100110251'.
           05                               PIC  X(32) VALUE
               '00210247003103770041038300510226'.
           05                               PIC  X(32) VALUE
               '00610242007100170080997500909924'.
           05                               PIC  X(32) VALUE
               '01010140001083710020868000308581'.
           05                               PIC  X(32) VALUE
               '00408440005083340060804600708143'.
           05                               PIC  X(32) VALUE
               '00808409009078950100793400109234'.
           05                               PIC  X(32) VALUE
               '00208981003092360040844700508692'.
           05                               PIC  X(32) VALUE
               '00608517007086680080912700908676'.
           05                               PIC  X(32) VALUE
               '01009027001087790020925100309510'.
           05                               PIC  X(32) VALUE
               '00409575005098330060980500710123'.
           05                               PIC  X(32) VALUE
               '00810201009100070101024700508326'.
           05                               PIC  X(32) VALUE
               '00608339007085120080860000909339'.
           05                               PIC  X(32) VALUE
               '01008909001073150020705400307640'.
           05                               PIC  X(32) VALUE
               '00407598001126440021305200313356'.
           05                               PIC  X(32) VALUE
               '00413734005139020061327300714510'.
           05                               PIC  X(32) VALUE
               '00814418009145080101495600107860'.
           05                               PIC  X(32) VALUE
               '00207551003074540040759400507293'.
           05                               PIC  X(32) VALUE
               '00607192007070880080686500906779'.
           05                               PIC  X(32) VALUE
               '01006585001099050020977600309829'.
           05                               PIC  X(32) VALUE
               '00409897005099990060981800709899'.
           05                               PIC  X(32) VALUE
               '00810021009100530101015600111343'.
           05                               PIC  X(32) VALUE
               '00211384003117410041157400511544'.
           05                               PIC  X(32) VALUE
               '00611776007119980081176000911571'.
           05                               PIC  X(32) VALUE
               '01011561001088060020859300308521'.
           05                               PIC  X(32) VALUE
               '00408391005079110060839700708403'.
           05                               PIC  X(32) VALUE
               '00808288009083250100809700109054'.
           05                               PIC  X(32) VALUE
               '00209072003090320040907500509076'.
           05                               PIC  X(32) VALUE
               '00608980007090440080903100908942'.
           05                               PIC  X(32) VALUE
               '01008835001092050020920900309113'.
           05                               PIC  X(32) VALUE
               '00409706005091450060914000709277'.
           05                               PIC  X(32) VALUE
               '00809558009091570100919700107748'.
           05                               PIC  X(32) VALUE
               '00207937003079670040742800507362'.
           05                               PIC  X(32) VALUE
               '00607488007077730080830500908916'.
           05                               PIC  X(32) VALUE
               '01008540005080950060817300708122'.
           05                               PIC  X(32) VALUE
               '00808032009079900100818700109432'.
           05                               PIC  X(32) VALUE
               '00209148003090340040901300509129'.
           05                               PIC  X(32) VALUE
               '00609139007089610080899800908772'.
           05                               PIC  X(32) VALUE
               '01009095001089520020881800308969'.
           05                               PIC  X(32) VALUE
               '00408974005087560060829500708649'.
           05                               PIC  X(32) VALUE
               '00809037009088510100895900110150'.
           05                               PIC  X(32) VALUE
               '00210062003103600041064800510241'.
           05                               PIC  X(32) VALUE
               '00609964007097380081030100910210'.
           05                               PIC  X(32) VALUE
               '01010091001094800020931800309065'.
           05                               PIC  X(32) VALUE
               '00408953005086040060887600708778'.
           05                               PIC  X(32) VALUE
               '00808564009083370100870800108793'.
           05                               PIC  X(32) VALUE
               '00208362003081390040814500507943'.
           05                               PIC  X(32) VALUE
               '00607799007079820080830000908623'.
           05                               PIC  X(32) VALUE
               '01008416001088430020866400308533'.
           05                               PIC  X(32) VALUE
               '00408500005083370060824500707583'.
           05                               PIC  X(32) VALUE
               '00807718009079210100773000908334'.
           05                               PIC  X(32) VALUE
               '01008291001080650020833500308361'.
           05                               PIC  X(32) VALUE
               '00408526005082930060832600708373'.
           05                               PIC  X(32) VALUE
               '00807884009083020100827800512468'.
           05                               PIC  X(32) VALUE
               '00612243007123080081274500912562'.
           05                               PIC  X(32) VALUE
               '01012444001084710020844100308653'.
           05                               PIC  X(32) VALUE
               '00408769005089800060901700709100'.
           05                               PIC  X(32) VALUE
               '00809321009088850100922400107941'.
           05                               PIC  X(32) VALUE
               '00207997003079180040752700507379'.
           05                               PIC  X(32) VALUE
               '00607600007077840080729100907369'.
           05                               PIC  X(32) VALUE
               '01007079001149310021463600315844'.
           05                               PIC  X(32) VALUE
               '00416286005167030061677700717457'.
           05                               PIC  X(32) VALUE
               '00817142009173250101862900108219'.
           05                               PIC  X(32) VALUE
               '00208434003089920040894900508473'.
           05                               PIC  X(32) VALUE
               '00608449007085220080852400908926'.
           05                               PIC  X(32) VALUE
               '01008776001105340021022200310596'.
           05                               PIC  X(32) VALUE
               '00410759005105030061082000710678'.
           05                               PIC  X(32) VALUE
               '00810491009105210101114700108961'.
           05                               PIC  X(32) VALUE
               '00209001003092080040912100509223'.
           05                               PIC  X(32) VALUE
               '00609201007089910080900900908901'.
           05                               PIC  X(32) VALUE
               '01008841001107380021034300310349'.
           05                               PIC  X(32) VALUE
               '00409947005096820060962000709550'.
           05                               PIC  X(32) VALUE
               '00809513009097670100945700108403'.
           05                               PIC  X(32) VALUE
               '00208559003084580040821300508137'.
           05                               PIC  X(32) VALUE
               '00608035007082540080845700908957'.
           05                               PIC  X(32) VALUE
               '01009099005109340061164500710892'.
           05                               PIC  X(32) VALUE
               '00810815009104270101059300108028'.
           05                               PIC  X(32) VALUE
               '00208245003081970040773200507542'.
           05                               PIC  X(32) VALUE
               '00607600007075380080728100907327'.
           05                               PIC  X(32) VALUE
               '01007002001096480020962500309543'.
           05                               PIC  X(32) VALUE
               '00409432005094330060944500709419'.
           05                               PIC  X(32) VALUE
               '00809456009094570100947000110723'.
           05                               PIC  X(32) VALUE
               '00210807003106590041053300510403'.
           05                               PIC  X(32) VALUE
               '00610384007103250081034700910137'.
           05                               PIC  X(32) VALUE
               '01010197001084620020837200308422'.
           05                               PIC  X(32) VALUE
               '00408331005084730060839800708340'.
           05                               PIC  X(32) VALUE
               '00808223009082380100807000508386'.
           05                               PIC  X(32) VALUE
               '00609142007092240080905500909105'.
           05                               PIC  X(32) VALUE
               '01009111001095630020896200308921'.
           05                               PIC  X(32) VALUE
               '00408802005091910060907500708770'.
           05                               PIC  X(32) VALUE
               '00808962009090380100886900507729'.
           05                               PIC  X(32) VALUE
               '00607492007075060080778200907725'.
           05                               PIC  X(32) VALUE
               '01007963001096150021016800310037'.
           05                               PIC  X(32) VALUE
               '00410109005098430060997500710047'.
           05                               PIC  X(32) VALUE
               '00810076009096350100940000109934'.
           05                               PIC  X(32) VALUE
               '00209823003096610040959700509277'.
           05                               PIC  X(32) VALUE
               '00609376007092030080915000909179'.
           05                               PIC  X(32) VALUE
               '01009138001066750020673500306863'.
           05                               PIC  X(32) VALUE
               '00406673005063900060662000706604'.
           05                               PIC  X(32) VALUE
               '00806717009065980100652600108898'.
           05                               PIC  X(32) VALUE
               '00208696003086810040867400508472'.
           05                               PIC  X(32) VALUE
               '00608478007086180080860500908524'.
           05                               PIC  X(32) VALUE
               '01008549001095660021009700309048'.
           05                               PIC  X(32) VALUE
               '00409537005090750060905000708882'.
           05                               PIC  X(32) VALUE
               '00809016009086740100918500107256'.
           05                               PIC  X(32) VALUE
               '00208084003082300040826800508517'.
           05                               PIC  X(32) VALUE
               '00608661007085370080846400908782'.
           05                               PIC  X(32) VALUE
               '01008740001105800021066200310687'.
           05                               PIC  X(32) VALUE
               '00410593005104320061064200710873'.
           05                               PIC  X(32) VALUE
               '00810920009112950101127900109202'.
           05                               PIC  X(32) VALUE
               '00209107003091550040886200508880'.
           05                               PIC  X(32) VALUE
               '00608445007087510080862700908727'.
           05                               PIC  X(32) VALUE
               '01008941001100020020910600309249'.
           05                               PIC  X(32) VALUE
               '00409034005088640060869900708410'.
           05                               PIC  X(32) VALUE
               '00808991009088860100894100108939'.
           05                               PIC  X(32) VALUE
               '00208343003086600040856000508679'.
           05                               PIC  X(32) VALUE
               '00608539007085310080873900909001'.
           05                               PIC  X(32) VALUE
               '01009124001110120021107600311205'.
           05                               PIC  X(32) VALUE
               '00411584005114930061161800711459'.
           05                               PIC  X(32) VALUE
               '00811763009116860101157700110067'.
           05                               PIC  X(32) VALUE
               '00210433003100970041035500510294'.
           05                               PIC  X(32) VALUE
               '00609767007099520080996200910130'.
           05                               PIC  X(32) VALUE
               '01009950001060000020550000305000'.
           05                               PIC  X(32) VALUE
               '00404500001099830020967500309557'.
           05                               PIC  X(32) VALUE
               '00409540005097460061003500709931'.
           05                               PIC  X(32) VALUE
               '00809850009095950100926200108625'.
           05                               PIC  X(32) VALUE
               '00208328003082830040826200507986'.
           05                               PIC  X(32) VALUE
               '00607942007078250080780900907905'.
           05                               PIC  X(32) VALUE
               '01008052001110430021180800312004'.
           05                               PIC  X(32) VALUE
               '00411759005117930061197800712072'.
           05                               PIC  X(32) VALUE
               '00812807009124030101302300109283'.
           05                               PIC  X(32) VALUE
               '00209350003095170040967400510029'.
           05                               PIC  X(32) VALUE
               '00610282007104710081011900909985'.
           05                               PIC  X(8)  VALUE
               '01009538'.
       01  BUN-WAGE-INDEX-TABLE REDEFINES BUN-WAGE-INDEX-FILLER.
           05  BUN-WI-ENTRY OCCURS 4565 TIMES.
               10  BUN-WI-DATE-CODE         PIC  9(03).
               10  BUN-WAGE-INDEX           PIC  9V9(04).
