       01  COM-DATE-FILLER.
           05                               PIC X(44)  VALUE
               '20060101001200701010022008010100320090101004'.
           05                               PIC X(44)  VALUE
               '20100101005201101010062012010100720130101008'.
       01  COM-DATE-TABLE REDEFINES COM-DATE-FILLER.
           05  COM-DATE-ENTRY OCCURS 8 TIMES.
               10  COM-DATE                 PIC  X(08).
               10  COM-DATE-CODE            PIC  9(03).
       01  COM-MAX-DATE                     PIC S9(07) COMP-3 VALUE +8.
       01  COM-SUB                          PIC S9(07) COMP-3.
       01  COM-CBSA-FILLER.
           05                               PIC  X(50) VALUE
               '     00000   0100008   0200016   0300024   0400032'.
           05                               PIC  X(50) VALUE
               '   0500040   0600048   0700056   0800064   1000072'.
           05                               PIC  X(50) VALUE
               '   1100080   1200088   1300096   1400104   1500112'.
           05                               PIC  X(50) VALUE
               '   1600120   1700128   1800136   1900144   2000152'.
           05                               PIC  X(50) VALUE
               '   2100160   2200168   2300176   2400184   2500192'.
           05                               PIC  X(50) VALUE
               '   2600200   2700208   2800216   2900224   3000232'.
           05                               PIC  X(50) VALUE
               '   3200240   3300248   3400256   3500264   3600272'.
           05                               PIC  X(50) VALUE
               '   3700280   3800288   3900296   4000304   4200312'.
           05                               PIC  X(50) VALUE
               '   4300320   4400328   4500336   4600344   4700351'.
           05                               PIC  X(50) VALUE
               '   4800359   4900367   5000375   5100383   5200391'.
           05                               PIC  X(50) VALUE
               '   5300399   5500406   6700413   6800420   6900427'.
           05                               PIC  X(50) VALUE
               '   7000434   7100441   7200448   7300455   7400462'.
           05                               PIC  X(50) VALUE
               '   7500469   7600476   7700483   7800490   8000497'.
           05                               PIC  X(50) VALUE
               '10180005051038000513104200052110500005291058000537'.
           05                               PIC  X(50) VALUE
               '10740005451078000553109000056111020005691110000577'.
           05                               PIC  X(50) VALUE
               '11180005851126000593113000060111340006091146000617'.
           05                               PIC  X(50) VALUE
               '11500006251154000633117000064112020006491206000657'.
           05                               PIC  X(50) VALUE
               '12100006651222000673122600068112420006891254000697'.
           05                               PIC  X(50) VALUE
               '12580007051262000713127000072112940007291298000737'.
           05                               PIC  X(50) VALUE
               '13020007451314000753133800076113460007691364400777'.
           05                               PIC  X(50) VALUE
               '13740007851378000793138200080113900008091398000817'.
           05                               PIC  X(50) VALUE
               '14020008251406000833142600084114484008491450000857'.
           05                               PIC  X(50) VALUE
               '14540008651460000867147400087514860008831518000891'.
           05                               PIC  X(50) VALUE
               '15260008991538000907155000091515540009231576400931'.
           05                               PIC  X(50) VALUE
               '15804009391594000947159800095516020009591618000967'.
           05                               PIC  X(50) VALUE
               '16220009751630000983165800099016620009981670001006'.
           05                               PIC  X(50) VALUE
               '16740010141682001022168600103016940010381697401046'.
           05                               PIC  X(50) VALUE
               '17020010541714001062173000107017420010781746001086'.
           05                               PIC  X(50) VALUE
               '17660010941778001102178200111017860011181790001126'.
           05                               PIC  X(50) VALUE
               '17980011341802001142181400115018580011581870001166'.
           05                               PIC  X(50) VALUE
               '18880011691906001177191240118519140011931918001201'.
           05                               PIC  X(50) VALUE
               '19260012091934001217193800122519460012331950001241'.
           05                               PIC  X(50) VALUE
               '19660012491974001257197800126519804012732002001281'.
           05                               PIC  X(50) VALUE
               '20100012892022001297202600130520500013132074001321'.
           05                               PIC  X(50) VALUE
               '20764013292094001337210600134521140013532130001361'.
           05                               PIC  X(50) VALUE
               '21340013692150001377216040137921660013872178001395'.
           05                               PIC  X(50) VALUE
               '21820014032194001411220200141922140014272218001435'.
           05                               PIC  X(50) VALUE
               '22220014432238001451224200145922500014672252001475'.
           05                               PIC  X(50) VALUE
               '22540014832266001491227440149922900015072302001512'.
           05                               PIC  X(50) VALUE
               '23060015202310401528234200153623460015442354001552'.
           05                               PIC  X(50) VALUE
               '23580015602384401568240200157624140015842422001592'.
           05                               PIC  X(50) VALUE
               '24300016002434001608245000161624540016242458001632'.
           05                               PIC  X(50) VALUE
               '24660016402478001648248600165625020016642506001672'.
           05                               PIC  X(50) VALUE
               '25180016802526001688254200169625500017042554001712'.
           05                               PIC  X(50) VALUE
               '25620017202586001728259800173626100017442618001752'.
           05                               PIC  X(50) VALUE
               '26300017602638001768264200177626580017842662001792'.
           05                               PIC  X(50) VALUE
               '26820018002690001808269800181627060018242710001832'.
           05                               PIC  X(50) VALUE
               '27140018402718001848272600185627340018642750001872'.
           05                               PIC  X(50) VALUE
               '27620018802774001888277800189627860019042790001912'.
           05                               PIC  X(50) VALUE
               '28020019202810001928281400193628420019442866001952'.
           05                               PIC  X(50) VALUE
               '28700019602874001968289400197629020019842910001992'.
           05                               PIC  X(50) VALUE
               '29140020002918002008293400201629404020242942002030'.
           05                               PIC  X(50) VALUE
               '29460020382954002046296200205429700020622974002070'.
           05                               PIC  X(50) VALUE
               '29820020782994002086300200209430140021023030002110'.
           05                               PIC  X(50) VALUE
               '30340021183046002126306200213430700021423078002150'.
           05                               PIC  X(50) VALUE
               '30860021583098002166310200217431084021823114002190'.
           05                               PIC  X(50) VALUE
               '31180021983134002206314200221431460022223154002230'.
           05                               PIC  X(50) VALUE
               '31700022383174002242318600224631900022543242002262'.
           05                               PIC  X(50) VALUE
               '32580022703278002278328200228632900022943312402302'.
           05                               PIC  X(50) VALUE
               '33140023103326002318333400232633460023343354002342'.
           05                               PIC  X(50) VALUE
               '33660023503370002358337400236633780023743386002382'.
           05                               PIC  X(50) VALUE
               '34060023903410002398345800240634620024143474002422'.
           05                               PIC  X(50) VALUE
               '34820024303490002438349400244534980024533500402461'.
           05                               PIC  X(50) VALUE
               '35084024683530002476353800248435644024923566002500'.
           05                               PIC  X(50) VALUE
               '35840025033598002511360840251936100025273614002535'.
           05                               PIC  X(50) VALUE
               '36220025433626002551364200255936500025673654002575'.
           05                               PIC  X(50) VALUE
               '36740025833678002591369800259937100026073734002615'.
           05                               PIC  X(50) VALUE
               '37380026213746002629376200263737700026453776402651'.
           05                               PIC  X(50) VALUE
               '37860026593790002667379640267538060026833822002691'.
           05                               PIC  X(50) VALUE
               '38300026993834002707385400271538660027233886002731'.
           05                               PIC  X(50) VALUE
               '38900027393894002747391000275539140027633930002771'.
           05                               PIC  X(50) VALUE
               '39340027793938002787394600279539540028033958002810'.
           05                               PIC  X(50) VALUE
               '39660028173974002825398200283339900028414006002849'.
           05                               PIC  X(50) VALUE
               '40140028574022002865403400287340380028814042002889'.
           05                               PIC  X(50) VALUE
               '40484028974058002905406600291340900029214098002929'.
           05                               PIC  X(50) VALUE
               '41060029374110002945411400295341180029614142002969'.
           05                               PIC  X(50) VALUE
               '41500029774154002985416200299341660030014170003009'.
           05                               PIC  X(50) VALUE
               '41740030174178003025418840303341900030414194003049'.
           05                               PIC  X(50) VALUE
               '41980030574202003065420440307342060030814210003089'.
           05                               PIC  X(50) VALUE
               '42140030974222003105422600310842340031164254003124'.
           05                               PIC  X(50) VALUE
               '42644031324268003139431000314743300031554334003163'.
           05                               PIC  X(50) VALUE
               '43580031714362003179437800318743900031954406003203'.
           05                               PIC  X(50) VALUE
               '44100032114414003219441800322744220032354430003243'.
           05                               PIC  X(50) VALUE
               '44600032464470003254449400326245060032704510403278'.
           05                               PIC  X(50) VALUE
               '45220032864530003294454600330245500033104578003318'.
           05                               PIC  X(50) VALUE
               '45820033264594003334460600334246140033504622003358'.
           05                               PIC  X(50) VALUE
               '46340033664654003374466600338246700033904694003391'.
           05                               PIC  X(50) VALUE
               '47020033994722003407472600341547300034234738003431'.
           05                               PIC  X(50) VALUE
               '47580034394764403447478940345547940034634814003471'.
           05                               PIC  X(50) VALUE
               '48260034764830003484484240349248540035004862003508'.
           05                               PIC  X(50) VALUE
               '48660035164870003524488640353248900035404902003548'.
           05                               PIC  X(50) VALUE
               '49180035564934003564494200357249500035804962003588'.
           05                               PIC  X(30) VALUE
               '496600359649700036044974003612'.
       01  COM-CBSA-TABLE REDEFINES COM-CBSA-FILLER.
           05  COM-CBSA-ENTRY OCCURS 463 TIMES
                   ASCENDING KEY IS COM-CBSA-VALUE
                   INDEXED BY COM-INDX.
               10  COM-CBSA-VALUE           PIC  X(05).
               10  COM-PTR                  PIC  9(05).
       01  COM-MAX                         PIC S9(07) COMP-3 VALUE +463.
       01  COM-WAGE-INDEX-FILLER.
           05                               PIC  X(32) VALUE
               '00108885002084230030795100408017'.
           05                               PIC  X(32) VALUE
               '00507750006078000070728100807129'.
           05                               PIC  X(32) VALUE
               '00112519002112240031278100412572'.
           05                               PIC  X(32) VALUE
               '00512343006133450071288200812822'.
           05                               PIC  X(32) VALUE
               '00109165002093790030894900408932'.
           05                               PIC  X(32) VALUE
               '00509297006096130070885100809192'.
           05                               PIC  X(32) VALUE
               '00108885002084230030791600407897'.
           05                               PIC  X(32) VALUE
               '00507755006076330070721400807358'.
           05                               PIC  X(32) VALUE
               '00111555002120590031269000412971'.
           05                               PIC  X(32) VALUE
               '00512747006127420071222900812581'.
           05                               PIC  X(32) VALUE
               '00109805002098180031024200410113'.
           05                               PIC  X(32) VALUE
               '00510502006104980071015500810220'.
           05                               PIC  X(32) VALUE
               '00112261002123270031236100411640'.
           05                               PIC  X(32) VALUE
               '00511733006117620071131900811141'.
           05                               PIC  X(32) VALUE
               '00110013002102180031026700410527'.
           05                               PIC  X(32) VALUE
               '00510482006103120071003600810183'.
           05                               PIC  X(32) VALUE
               '00108956002090480030893500408986'.
           05                               PIC  X(32) VALUE
               '00509061006088880070838500808071'.
           05                               PIC  X(32) VALUE
               '00108885002084230030808400408044'.
           05                               PIC  X(32) VALUE
               '00508063006079970070756800807429'.
           05                               PIC  X(32) VALUE
               '00111029002110000031120100411623'.
           05                               PIC  X(32) VALUE
               '00511755006118260071123200810740'.
           05                               PIC  X(32) VALUE
               '00108885002085490030835900408085'.
           05                               PIC  X(32) VALUE
               '00508179006079860070755200807592'.
           05                               PIC  X(32) VALUE
               '00108885002087590030879700408861'.
           05                               PIC  X(32) VALUE
               '00508792006088180070845000808448'.
           05                               PIC  X(32) VALUE
               '00109015002089890030905200408953'.
           05                               PIC  X(32) VALUE
               '00509021006088690070857500808482'.
           05                               PIC  X(32) VALUE
               '00108894002091400030904100409303'.
           05                               PIC  X(32) VALUE
               '00509122006090310070864200808361'.
           05                               PIC  X(32) VALUE
               '00108885002084230030842400408508'.
           05                               PIC  X(32) VALUE
               '00508639006084350070806400808006'.
           05                               PIC  X(32) VALUE
               '00108885002084230030822500408245'.
           05                               PIC  X(32) VALUE
               '00508264006082760070784700807886'.
           05                               PIC  X(32) VALUE
               '00108885002084230030791600407869'.
           05                               PIC  X(32) VALUE
               '00508050006081510070777100807727'.
           05                               PIC  X(32) VALUE
               '00109243002088890030894600409134'.
           05                               PIC  X(32) VALUE
               '00509074006090770070860500808309'.
           05                               PIC  X(32) VALUE
               '00109777002093970030953500409387'.
           05                               PIC  X(32) VALUE
               '00509658006096970070931700808807'.
           05                               PIC  X(32) VALUE
               '00112560002107560031229000412332'.
           05                               PIC  X(32) VALUE
               '00512375006124390071400200813555'.
           05                               PIC  X(32) VALUE
               '00109298002095410030945000409391'.
           05                               PIC  X(32) VALUE
               '00509285006090420070831800808397'.
           05                               PIC  X(32) VALUE
               '00109546002096360030958300409573'.
           05                               PIC  X(32) VALUE
               '00509689006095530070913300809063'.
           05                               PIC  X(32) VALUE
               '00108885002084230030812700408014'.
           05                               PIC  X(32) VALUE
               '00508079006080540070756000807546'.
           05                               PIC  X(32) VALUE
               '00108885002084230030837000408434'.
           05                               PIC  X(32) VALUE
               '00508114006080910070769500807631'.
           05                               PIC  X(32) VALUE
               '00109159002090440030884400409149'.
           05                               PIC  X(32) VALUE
               '00508884006090020070863900808610'.
           05                               PIC  X(32) VALUE
               '00109049002091350030934000409225'.
           05                               PIC  X(32) VALUE
               '00509208006094180070889700808743'.
           05                               PIC  X(32) VALUE
               '00109476002094160030978600409914'.
           05                               PIC  X(32) VALUE
               '00510233006098820070966400809750'.
           05                               PIC  X(32) VALUE
               '00111307002114260031146600410798'.
           05                               PIC  X(32) VALUE
               '00510532006107880071047100810384'.
           05                               PIC  X(32) VALUE
               '00109026002087720030943600409312'.
           05                               PIC  X(32) VALUE
               '00509454006094180070890300808889'.
           05                               PIC  X(32) VALUE
               '00108885002086670030872700408607'.
           05                               PIC  X(32) VALUE
               '00508746006086510070817500808208'.
           05                               PIC  X(32) VALUE
               '00108927002090420030908000409062'.
           05                               PIC  X(32) VALUE
               '00509028006088350070831100808280'.
           05                               PIC  X(32) VALUE
               '00108885002084230030791600407613'.
           05                               PIC  X(32) VALUE
               '00508264006072200070731600806899'.
           05                               PIC  X(32) VALUE
               '00109226002091150030919700409075'.
           05                               PIC  X(32) VALUE
               '00508997006090480070847900808480'.
           05                               PIC  X(32) VALUE
               '00108885002084230030791600408170'.
           05                               PIC  X(32) VALUE
               '00508096006083070070787000807792'.
           05                               PIC  X(32) VALUE
               '00110271002102680031045600410797'.
           05                               PIC  X(32) VALUE
               '00510827006106000071036600809511'.
           05                               PIC  X(32) VALUE
               '00108885002087590030885000408839'.
           05                               PIC  X(32) VALUE
               '00508786006089630070847400808390'.
           05                               PIC  X(32) VALUE
               '00108885002084230030791600407397'.
           05                               PIC  X(32) VALUE
               '00506875006063420070551600805006'.
           05                               PIC  X(32) VALUE
               '00109029002090180030913600409022'.
           05                               PIC  X(32) VALUE
               '00508879006088920070830000808348'.
           05                               PIC  X(32) VALUE
               '00108948002089280030902300409091'.
           05                               PIC  X(32) VALUE
               '00509001006090220070832300808133'.
           05                               PIC  X(32) VALUE
               '00108885002084230030815100408231'.
           05                               PIC  X(32) VALUE
               '00508259006083350070775600807568'.
           05                               PIC  X(32) VALUE
               '00108885002084230030841000408342'.
           05                               PIC  X(32) VALUE
               '00508207006082500070795600807987'.
           05                               PIC  X(32) VALUE
               '00108885002085700030856600408736'.
           05                               PIC  X(32) VALUE
               '00508846006091410070874400808526'.
           05                               PIC  X(32) VALUE
               '00110275002102590031046900410650'.
           05                               PIC  X(32) VALUE
               '00510327006101370070973600108885'.
           05                               PIC  X(32) VALUE
               '00208914003079160040739700507844'.
           05                               PIC  X(32) VALUE
               '00608448007075260080719300108885'.
           05                               PIC  X(32) VALUE
               '00208423003083340040830700508323'.
           05                               PIC  X(32) VALUE
               '00608287007078390080773700110986'.
           05                               PIC  X(32) VALUE
               '00210805003108280041075800510814'.
           05                               PIC  X(32) VALUE
               '00610764007102600081010400108885'.
           05                               PIC  X(32) VALUE
               '00208423003079160040792800507823'.
           05                               PIC  X(32) VALUE
               '00607899007073920080734100109940'.
           05                               PIC  X(32) VALUE
               '00210058003102030040990400509738'.
           05                               PIC  X(32) VALUE
               '00609709007090020080915200109676'.
           05                               PIC  X(32) VALUE
               '00209786003098020040984300510086'.
           05                               PIC  X(32) VALUE
               '00610070007094600080924900111555'.
           05                               PIC  X(32) VALUE
               '00212059003126900041297100512747'.
           05                               PIC  X(32) VALUE
               '00612742007122290010888500208423'.
           05                               PIC  X(32) VALUE
               '00308410004083420050820700608250'.
           05                               PIC  X(32) VALUE
               '00707956001089560020904800308935'.
           05                               PIC  X(32) VALUE
               '00408986005090610060888800708385'.
           05                               PIC  X(32) VALUE
               '00108956002090480030893500408986'.
           05                               PIC  X(32) VALUE
               '00509061006088880070838500108885'.
           05                               PIC  X(32) VALUE
               '00208423003084240040850800508639'.
           05                               PIC  X(32) VALUE
               '00608435007080640010888500208423'.
           05                               PIC  X(32) VALUE
               '00307916004078690050805000608151'.
           05                               PIC  X(32) VALUE
               '00707771001092260020911500309197'.
           05                               PIC  X(32) VALUE
               '00409075005089970060904800708479'.
           05                               PIC  X(32) VALUE
               '00108885002087590030885000408839'.
           05                               PIC  X(32) VALUE
               '00508786006089630070847400108885'.
           05                               PIC  X(32) VALUE
               '00208423003084100040834200508207'.
           05                               PIC  X(32) VALUE
               '00608250007079560011155500212059'.
           05                               PIC  X(32) VALUE
               '00312690004129710051274700612742'.
           05                               PIC  X(32) VALUE
               '00712229001088940020914000309041'.
           05                               PIC  X(32) VALUE
               '00409303005091220060903100708642'.
           05                               PIC  X(32) VALUE
               '00109546002096360030958300409573'.
           05                               PIC  X(32) VALUE
               '00509689006095530070913300108885'.
           05                               PIC  X(32) VALUE
               '00208759003087970040886100508792'.
           05                               PIC  X(32) VALUE
               '00608818007084500010977700209397'.
           05                               PIC  X(32) VALUE
               '00309535004093870050965800609697'.
           05                               PIC  X(32) VALUE
               '00709317001088850020842300308398'.
           05                               PIC  X(32) VALUE
               '00408556005084050060845900708468'.
           05                               PIC  X(32) VALUE
               '00808333001088850020842300307916'.
           05                               PIC  X(32) VALUE
               '00407397005068750060634200705516'.
           05                               PIC  X(32) VALUE
               '00805006001093890020911100309282'.
           05                               PIC  X(32) VALUE
               '00409422005093610060934600708839'.
           05                               PIC  X(32) VALUE
               '00808739001090190020946600308986'.
           05                               PIC  X(32) VALUE
               '00409196005094130060955000708712'.
           05                               PIC  X(32) VALUE
               '00808445001089780020918100309064'.
           05                               PIC  X(32) VALUE
               '00409201005092840060914600708705'.
           05                               PIC  X(32) VALUE
               '00808657001101230020995800310084'.
           05                               PIC  X(32) VALUE
               '00409732005099420060999400709577'.
           05                               PIC  X(32) VALUE
               '00809553001088850020842900308422'.
           05                               PIC  X(32) VALUE
               '00408591005084750060845000708049'.
           05                               PIC  X(32) VALUE
               '00807866001102630021047200310412'.
           05                               PIC  X(32) VALUE
               '00410037005101660060971700709286'.
           05                               PIC  X(32) VALUE
               '00809094001093490020927700309096'.
           05                               PIC  X(32) VALUE
               '00409004005093750060911100708942'.
           05                               PIC  X(32) VALUE
               '00808908001095710020965300309622'.
           05                               PIC  X(32) VALUE
               '00409433005091910060913600708739'.
           05                               PIC  X(32) VALUE
               '00808516001099680021027600310603'.
           05                               PIC  X(32) VALUE
               '00410025005100410061053800710037'.
           05                               PIC  X(32) VALUE
               '00809606001124340021265800312574'.
           05                               PIC  X(32) VALUE
               '00412607005127070061264500712167'.
           05                               PIC  X(32) VALUE
               '00812161001089750020914000309317'.
           05                               PIC  X(32) VALUE
               '00409257005095750060971500709292'.
           05                               PIC  X(32) VALUE
               '00809558001094040020949300309590'.
           05                               PIC  X(32) VALUE
               '00410113005095440060918600708548'.
           05                               PIC  X(32) VALUE
               '00808939001113510021139800311124'.
           05                               PIC  X(32) VALUE
               '00411037005108870061070000710157'.
           05                               PIC  X(32) VALUE
               '00810127001088850020842300308366'.
           05                               PIC  X(32) VALUE
               '00408376005080840060836900708002'.
           05                               PIC  X(32) VALUE
               '00807548001097090020995400310130'.
           05                               PIC  X(32) VALUE
               '00409975005098250060989400709252'.
           05                               PIC  X(32) VALUE
               '00809279001097050020970300309695'.
           05                               PIC  X(32) VALUE
               '00409660005095800060951300708943'.
           05                               PIC  X(32) VALUE
               '00808565001103010021037700311100'.
           05                               PIC  X(32) VALUE
               '00410135005100400061020900709669'.
           05                               PIC  X(32) VALUE
               '00809499001102360021027800310373'.
           05                               PIC  X(32) VALUE
               '00410307005101450061009300709602'.
           05                               PIC  X(32) VALUE
               '00809528001121410021245600312875'.
           05                               PIC  X(32) VALUE
               '00412652005122210061176300711064'.
           05                               PIC  X(32) VALUE
               '00811991001088850020852400308539'.
           05                               PIC  X(32) VALUE
               '00407972005086080060759900707899'.
           05                               PIC  X(32) VALUE
               '00807445001101890021017800310180'.
           05                               PIC  X(32) VALUE
               '00410160005099520061008100709556'.
           05                               PIC  X(32) VALUE
               '00809384001098640020983800310073'.
           05                               PIC  X(32) VALUE
               '00410077005100680061005600709562'.
           05                               PIC  X(32) VALUE
               '00809757001109440021129100311664'.
           05                               PIC  X(32) VALUE
               '00411823005118800061237300711850'.
           05                               PIC  X(32) VALUE
               '00811624001103450021062100310696'.
           05                               PIC  X(32) VALUE
               '00410625005108040061083900710180'.
           05                               PIC  X(32) VALUE
               '00810159001104460021022400310532'.
           05                               PIC  X(32) VALUE
               '00410751005107400061033400710007'.
           05                               PIC  X(32) VALUE
               '00810196001131710021320100313302'.
           05                               PIC  X(32) VALUE
               '00413360005133470061355300712874'.
           05                               PIC  X(32) VALUE
               '00812858001089820020851100308480'.
           05                               PIC  X(32) VALUE
               '00408626005086520060907200708547'.
           05                               PIC  X(32) VALUE
               '00808156001099390021027800310744'.
           05                               PIC  X(32) VALUE
               '00410694005105770061020600709963'.
           05                               PIC  X(32) VALUE
               '00809923001097660020974000309391'.
           05                               PIC  X(32) VALUE
               '00409772005098020060974600708952'.
           05                               PIC  X(32) VALUE
               '00809191001088850020904900309004'.
           05                               PIC  X(32) VALUE
               '00408960005088670060897100708748'.
           05                               PIC  X(32) VALUE
               '00808543001122620021169000312110'.
           05                               PIC  X(32) VALUE
               '00412300005120530061203800711781'.
           05                               PIC  X(32) VALUE
               '00811428001112740021131000311549'.
           05                               PIC  X(32) VALUE
               '00412020005121070061201900711427'.
           05                               PIC  X(32) VALUE
               '00811132001120030021147900311094'.
           05                               PIC  X(32) VALUE
               '00411146005108930061112400710334'.
           05                               PIC  X(32) VALUE
               '00810386001092340020917200309147'.
           05                               PIC  X(32) VALUE
               '00409304005092880060916800708600'.
           05                               PIC  X(32) VALUE
               '00808747001089500020925000309445'.
           05                               PIC  X(32) VALUE
               '00409060005092870060921500708756'.
           05                               PIC  X(32) VALUE
               '00808717001093650020936400309392'.
           05                               PIC  X(32) VALUE
               '00409290005090480060910100708460'.
           05                               PIC  X(32) VALUE
               '00808526001088850020842300307916'.
           05                               PIC  X(32) VALUE
               '00407553005080780060776600707252'.
           05                               PIC  X(32) VALUE
               '00807269001088850020864700308646'.
           05                               PIC  X(32) VALUE
               '00408617005088790060878700708304'.
           05                               PIC  X(32) VALUE
               '00808358001088850020898400309410'.
           05                               PIC  X(32) VALUE
               '00409488005095650060950100708750'.
           05                               PIC  X(32) VALUE
               '00808762001094860020941600309842'.
           05                               PIC  X(32) VALUE
               '00409852005099190060997600709504'.
           05                               PIC  X(32) VALUE
               '00809513001094620020989800309990'.
           05                               PIC  X(32) VALUE
               '00409793005098560060980100709305'.
           05                               PIC  X(32) VALUE
               '00808907001120810021229600312285'.
           05                               PIC  X(32) VALUE
               '00412571005128900061287100712318'.
           05                               PIC  X(32) VALUE
               '00812392001101750021089700311004'.
           05                               PIC  X(32) VALUE
               '00410886005108590061063800710115'.
           05                               PIC  X(32) VALUE
               '00810586001088850020857800308612'.
           05                               PIC  X(32) VALUE
               '00408864005089580060915900708623'.
           05                               PIC  X(32) VALUE
               '00808675004104610051029700111158'.
           05                               PIC  X(32) VALUE
               '00211489003115090041138100511376'.
           05                               PIC  X(32) VALUE
               '00611274007113200081084100113162'.
           05                               PIC  X(32) VALUE
               '00213328003134410041359700513531'.
           05                               PIC  X(32) VALUE
               '00613261007129510081318500110248'.
           05                               PIC  X(32) VALUE
               '00209928003094080040942100509541'.
           05                               PIC  X(32) VALUE
               '00609695007092090080862200109733'.
           05                               PIC  X(32) VALUE
               '00210701003100010041010900509708'.
           05                               PIC  X(32) VALUE
               '00609733007090940080880200109942'.
           05                               PIC  X(32) VALUE
               '00209922003100990041007800510302'.
           05                               PIC  X(32) VALUE
               '00610073007097780081001000109308'.
           05                               PIC  X(32) VALUE
               '00209132003092320040923100509254'.
           05                               PIC  X(32) VALUE
               '00609368007086900080849500109836'.
           05                               PIC  X(32) VALUE
               '00209974003101960040977900510689'.
           05                               PIC  X(32) VALUE
               '00610513007100490081000800111678'.
           05                               PIC  X(32) VALUE
               '00211549003118370041171400511929'.
           05                               PIC  X(32) VALUE
               '00611890007112420081127500110993'.
           05                               PIC  X(32) VALUE
               '00210941003109890041093300510973'.
           05                               PIC  X(32) VALUE
               '00610977007102310081048600109340'.
           05                               PIC  X(32) VALUE
               '00209508003094310040934200509322'.
           05                               PIC  X(32) VALUE
               '00609247007089640080884400109780'.
           05                               PIC  X(32) VALUE
               '00209835003099170040992900509600'.
           05                               PIC  X(32) VALUE
               '00609718007093670080916300509569'.
           05                               PIC  X(32) VALUE
               '00609494007086970080887000110697'.
           05                               PIC  X(32) VALUE
               '00210555003105580041070200511139'.
           05                               PIC  X(32) VALUE
               '00611061007106270081057100109435'.
           05                               PIC  X(32) VALUE
               '00209628003099060041012200510070'.
           05                               PIC  X(32) VALUE
               '00610205007101460081015500109225'.
           05                               PIC  X(32) VALUE
               '00209357003093430040942500509503'.
           05                               PIC  X(32) VALUE
               '00609347007088560080895400110028'.
           05                               PIC  X(32) VALUE
               '00210153003099130040999700510692'.
           05                               PIC  X(32) VALUE
               '00610818007099180010888500208993'.
           05                               PIC  X(32) VALUE
               '00308749004087440050861100608344'.
           05                               PIC  X(32) VALUE
               '00708167008080590010966400209628'.
           05                               PIC  X(32) VALUE
               '00309630004097310050981500609887'.
           05                               PIC  X(32) VALUE
               '00709089008088300011019200210059'.
           05                               PIC  X(32) VALUE
               '00310048004101390051002100609956'.
           05                               PIC  X(32) VALUE
               '00709347008092260011064800210660'.
           05                               PIC  X(32) VALUE
               '00309792004103720050991300609874'.
           05                               PIC  X(32) VALUE
               '00709214008092050010950000209421'.
           05                               PIC  X(32) VALUE
               '00309493004093810050934100609332'.
           05                               PIC  X(32) VALUE
               '00708765008086880010917200209539'.
           05                               PIC  X(32) VALUE
               '00309824004098020050988300609927'.
           05                               PIC  X(32) VALUE
               '00709872008097410011127900211319'.
           05                               PIC  X(32) VALUE
               '00311331004109890051107600611196'.
           05                               PIC  X(32) VALUE
               '00710630008106120011098700211637'.
           05                               PIC  X(32) VALUE
               '00311916004115150051184500612190'.
           05                               PIC  X(32) VALUE
               '00711125008112100011005000210108'.
           05                               PIC  X(32) VALUE
               '00310327004102360051003100610251'.
           05                               PIC  X(32) VALUE
               '00709457008095190010888500208882'.
           05                               PIC  X(32) VALUE
               '00308709004087680050844100608337'.
           05                               PIC  X(32) VALUE
               '00708216008080910010888500208537'.
           05                               PIC  X(32) VALUE
               '00308499004084640050800100608171'.
           05                               PIC  X(32) VALUE
               '00707696008076010010963000209896'.
           05                               PIC  X(32) VALUE
               '00309857004097650050942900609565'.
           05                               PIC  X(32) VALUE
               '00708966008090920011008400209838'.
           05                               PIC  X(32) VALUE
               '00310061004098500050976800609897'.
           05                               PIC  X(32) VALUE
               '00709394008092290010930300209523'.
           05                               PIC  X(32) VALUE
               '00309877004098760051004600610134'.
           05                               PIC  X(32) VALUE
               '00709717008095950010989700210213'.
           05                               PIC  X(32) VALUE
               '00310258004105430051038800610021'.
           05                               PIC  X(32) VALUE
               '00709874008093750010888500208993'.
           05                               PIC  X(32) VALUE
               '00309138004090240050911600608753'.
           05                               PIC  X(32) VALUE
               '00708128008083490010946700209405'.
           05                               PIC  X(32) VALUE
               '00309288004094390050929600609230'.
           05                               PIC  X(32) VALUE
               '00708783008085700010894800208674'.
           05                               PIC  X(32) VALUE
               '00309213004092340050922800609541'.
           05                               PIC  X(32) VALUE
               '00709066008088670011002200209810'.
           05                               PIC  X(32) VALUE
               '00310066004102910051008700609971'.
           05                               PIC  X(32) VALUE
               '00709751008095750011030700210641'.
           05                               PIC  X(32) VALUE
               '00310644004105070051068400610718'.
           05                               PIC  X(32) VALUE
               '00710022008097740010893700209016'.
           05                               PIC  X(32) VALUE
               '00309064004090850050919500609074'.
           05                               PIC  X(32) VALUE
               '00708702008086010011121500212156'.
           05                               PIC  X(32) VALUE
               '00311567004119450051163700611050'.
           05                               PIC  X(32) VALUE
               '00710929008107270060934500708986'.
           05                               PIC  X(32) VALUE
               '00808926001097390020889200308754'.
           05                               PIC  X(32) VALUE
               '00408259005085090060865200707847'.
           05                               PIC  X(32) VALUE
               '00808846001106910021060700310465'.
           05                               PIC  X(32) VALUE
               '00410509005104220061042100709872'.
           05                               PIC  X(32) VALUE
               '00809846001094900020957300309246'.
           05                               PIC  X(32) VALUE
               '00409198005091660060911300708398'.
           05                               PIC  X(32) VALUE
               '00808838001094370020975500309454'.
           05                               PIC  X(32) VALUE
               '00409905005092420061024500709860'.
           05                               PIC  X(32) VALUE
               '00809988001088850020889700308697'.
           05                               PIC  X(32) VALUE
               '00408871005088040060863300707918'.
           05                               PIC  X(32) VALUE
               '00808227001091190020931300309320'.
           05                               PIC  X(32) VALUE
               '00408913005087620060887800709082'.
           05                               PIC  X(32) VALUE
               '00809155001094740020951400309700'.
           05                               PIC  X(32) VALUE
               '00409725005097430060966000709307'.
           05                               PIC  X(32) VALUE
               '00809146001088850020859000308322'.
           05                               PIC  X(32) VALUE
               '00408245005082490060805500707355'.
           05                               PIC  X(32) VALUE
               '00807269001088850020860400308522'.
           05                               PIC  X(32) VALUE
               '00408607005084570060836700708031'.
           05                               PIC  X(32) VALUE
               '00808002001097200020975200309532'.
           05                               PIC  X(32) VALUE
               '00409394005093770060923300708890'.
           05                               PIC  X(32) VALUE
               '00808726001112090021150700311313'.
           05                               PIC  X(32) VALUE
               '00411431005113510061132800710677'.
           05                               PIC  X(32) VALUE
               '00810481001101070020970100309738'.
           05                               PIC  X(32) VALUE
               '00410076005102060061016900709829'.
           05                               PIC  X(32) VALUE
               '00809627001108960021082400310554'.
           05                               PIC  X(32) VALUE
               '00410523005102910061025100709538'.
           05                               PIC  X(32) VALUE
               '00809372001088850020842300307916'.
           05                               PIC  X(32) VALUE
               '00408045005078340060785800707411'.
           05                               PIC  X(32) VALUE
               '00807406001102190021036700310659'.
           05                               PIC  X(32) VALUE
               '00410910005105040061048600709937'.
           05                               PIC  X(32) VALUE
               '00809904001094330020961500309560'.
           05                               PIC  X(32) VALUE
               '00408855005093810060927300708723'.
           05                               PIC  X(32) VALUE
               '00808672001106760021057200310528'.
           05                               PIC  X(32) VALUE
               '00410950005110510061116600710364'.
           05                               PIC  X(32) VALUE
               '00810753001107080021034500310361'.
           05                               PIC  X(32) VALUE
               '00410284005101730061021400709726'.
           05                               PIC  X(32) VALUE
               '00809536001096180021013900310001'.
           05                               PIC  X(32) VALUE
               '00410216005101190061018800709624'.
           05                               PIC  X(32) VALUE
               '00809716001117580021178100311801'.
           05                               PIC  X(32) VALUE
               '00411923005117000061163300710899'.
           05                               PIC  X(32) VALUE
               '00810818001093090020955500309408'.
           05                               PIC  X(32) VALUE
               '00409242005092720060978500709628'.
           05                               PIC  X(32) VALUE
               '00808612001092010020915600309194'.
           05                               PIC  X(32) VALUE
               '00409008005088720060893000708744'.
           05                               PIC  X(32) VALUE
               '00808303001100630020992400310144'.
           05                               PIC  X(32) VALUE
               '00410110005100370061000400709432'.
           05                               PIC  X(32) VALUE
               '00809107001088850020867500308722'.
           05                               PIC  X(32) VALUE
               '00408715005088230060892600708546'.
           05                               PIC  X(32) VALUE
               '00808214001093840020953100309488'.
           05                               PIC  X(32) VALUE
               '00409187005090340060895700708539'.
           05                               PIC  X(32) VALUE
               '00808436001091330020929300308966'.
           05                               PIC  X(32) VALUE
               '00409207005092860060883600708170'.
           05                               PIC  X(32) VALUE
               '00807832001110150021096800111308'.
           05                               PIC  X(32) VALUE
               '00211450003115380041168800511671'.
           05                               PIC  X(32) VALUE
               '00612032007116200081146700109108'.
           05                               PIC  X(32) VALUE
               '00209550003091430040918300509014'.
           05                               PIC  X(32) VALUE
               '00608913007087040080841100111925'.
           05                               PIC  X(32) VALUE
               '00211643003116630041193700511756'.
           05                               PIC  X(32) VALUE
               '00611711007113540081082800108885'.
           05                               PIC  X(32) VALUE
               '00208423003079160040739700506875'.
           05                               PIC  X(32) VALUE
               '00606342007055160080500600108885'.
           05                               PIC  X(32) VALUE
               '00208686003084880040862900508644'.
           05                               PIC  X(32) VALUE
               '00608523007081590080811700108894'.
           05                               PIC  X(32) VALUE
               '00209043003101190040850700508344'.
           05                               PIC  X(32) VALUE
               '00609871007098230080933400109842'.
           05                               PIC  X(32) VALUE
               '00209417003098880040986900509898'.
           05                               PIC  X(32) VALUE
               '00609854007092390080898100109053'.
           05                               PIC  X(32) VALUE
               '00209333003092270040947900509282'.
           05                               PIC  X(32) VALUE
               '00609107007092890080929900112640'.
           05                               PIC  X(32) VALUE
               '00212214003123350041240900513195'.
           05                               PIC  X(32) VALUE
               '00613151007124620081238300111138'.
           05                               PIC  X(32) VALUE
               '00211548003118420041207300511883'.
           05                               PIC  X(32) VALUE
               '00612150007111690081127000109352'.
           05                               PIC  X(32) VALUE
               '00208831003087070040859100508582'.
           05                               PIC  X(32) VALUE
               '00608722007082400080809600108885'.
           05                               PIC  X(32) VALUE
               '00208423003081060040831700508460'.
           05                               PIC  X(32) VALUE
               '00608608007077600080768800110077'.
           05                               PIC  X(32) VALUE
               '00210595003102030040982000510218'.
           05                               PIC  X(32) VALUE
               '00609748007093170080916800110580'.
           05                               PIC  X(32) VALUE
               '00210048003104460041042600510762'.
           05                               PIC  X(32) VALUE
               '00610455007099040080984400110904'.
           05                               PIC  X(32) VALUE
               '00210668003107960041051000510982'.
           05                               PIC  X(32) VALUE
               '00610738007101890081037500108885'.
           05                               PIC  X(32) VALUE
               '00208423003083730040813300508315'.
           05                               PIC  X(32) VALUE
               '00608032007076420080785700109274'.
           05                               PIC  X(32) VALUE
               '00209100003092280040926600509264'.
           05                               PIC  X(32) VALUE
               '00110236002100200030979900409696'.
           05                               PIC  X(32) VALUE
               '00509532006098950070939500809644'.
           05                               PIC  X(32) VALUE
               '00109916002100740031023100410259'.
           05                               PIC  X(32) VALUE
               '00510047006100130070955200809527'.
           05                               PIC  X(32) VALUE
               '00111015002115210031160300411633'.
           05                               PIC  X(32) VALUE
               '00511918006120720071131300811606'.
           05                               PIC  X(32) VALUE
               '00108885002084920030861200408436'.
           05                               PIC  X(32) VALUE
               '00508743006075890070795600807706'.
           05                               PIC  X(32) VALUE
               '00109813002097670030970600409840'.
           05                               PIC  X(32) VALUE
               '00509496006096810070940200809642'.
           05                               PIC  X(32) VALUE
               '00109276002094310030972700409625'.
           05                               PIC  X(32) VALUE
               '00509650006097480070903500809338'.
           05                               PIC  X(32) VALUE
               '00109820002098270030973600409774'.
           05                               PIC  X(32) VALUE
               '00509824006096010070921900809270'.
           05                               PIC  X(32) VALUE
               '00108947002087640030871400408953'.
           05                               PIC  X(32) VALUE
               '00508944006089910070852800808350'.
           05                               PIC  X(32) VALUE
               '00109172002096550030980300409661'.
           05                               PIC  X(32) VALUE
               '00509579006095830070871500808570'.
           05                               PIC  X(32) VALUE
               '00108885002084230030831800407994'.
           05                               PIC  X(32) VALUE
               '00508224006081560070759400807258'.
           05                               PIC  X(32) VALUE
               '00109982002101790031041100410368'.
           05                               PIC  X(32) VALUE
               '00510282006104110070942100809426'.
           05                               PIC  X(32) VALUE
               '00109815002099540030983200409705'.
           05                               PIC  X(32) VALUE
               '00509708006096910070917100809135'.
           05                               PIC  X(32) VALUE
               '00109462002090520030915600409282'.
           05                               PIC  X(32) VALUE
               '00508836006087610070848600807936'.
           05                               PIC  X(32) VALUE
               '00110003002101090031019400410233'.
           05                               PIC  X(32) VALUE
               '00510131006100370070958000809604'.
           05                               PIC  X(32) VALUE
               '00109912002103040031026700410259'.
           05                               PIC  X(32) VALUE
               '00510176006101320070985200809804'.
           05                               PIC  X(32) VALUE
               '00109516002093340030951000409522'.
           05                               PIC  X(32) VALUE
               '00509585006093880070882300808648'.
           05                               PIC  X(32) VALUE
               '00109852002099300030992400409984'.
           05                               PIC  X(32) VALUE
               '00509944006099030070966400809705'.
           05                               PIC  X(32) VALUE
               '00110481002103220031040700410526'.
           05                               PIC  X(32) VALUE
               '00510556006101930070964700809748'.
           05                               PIC  X(32) VALUE
               '00108885002084230030791600407397'.
           05                               PIC  X(32) VALUE
               '00506875006063420070551600805006'.
           05                               PIC  X(32) VALUE
               '00109333002093860030926000409541'.
           05                               PIC  X(32) VALUE
               '00509290006093820070852900808554'.
           05                               PIC  X(32) VALUE
               '00109919002095150030951300409507'.
           05                               PIC  X(32) VALUE
               '00509483006097810070919400809433'.
           05                               PIC  X(32) VALUE
               '00110491002108250031108100411486'.
           05                               PIC  X(32) VALUE
               '00511646006118430071073000811005'.
           05                               PIC  X(32) VALUE
               '00109735002098990030979500409672'.
           05                               PIC  X(32) VALUE
               '00509822006098250070942700809536'.
           05                               PIC  X(32) VALUE
               '00109500002095520030935900409398'.
           05                               PIC  X(32) VALUE
               '00509546006096790070879800809097'.
           05                               PIC  X(32) VALUE
               '00111574002114690031153600411696'.
           05                               PIC  X(32) VALUE
               '00511840006115490071073000810881'.
           05                               PIC  X(32) VALUE
               '00108885002084230030791600407753'.
           05                               PIC  X(32) VALUE
               '00508106006081530070796200808044'.
           05                               PIC  X(32) VALUE
               '00109325002094860030952900409485'.
           05                               PIC  X(32) VALUE
               '00509520006091880070888400808687'.
           05                               PIC  X(32) VALUE
               '00109594002096630030969700409626'.
           05                               PIC  X(32) VALUE
               '00509549006094680070895100808853'.
           05                               PIC  X(32) VALUE
               '00109465002096470030950600409519'.
           05                               PIC  X(32) VALUE
               '00509198006091230070854700808033'.
           05                               PIC  X(32) VALUE
               '00111722002116820031219700412481'.
           05                               PIC  X(32) VALUE
               '00512335006124790071173100812170'.
           05                               PIC  X(32) VALUE
               '00109413002092460030961400409630'.
           05                               PIC  X(32) VALUE
               '00509524006096720070910200808954'.
           05                               PIC  X(32) VALUE
               '00108885002085090030833000408198'.
           05                               PIC  X(32) VALUE
               '00508330006082990070786300807937'.
           05                               PIC  X(32) VALUE
               '00110449002105370031049000410396'.
           05                               PIC  X(32) VALUE
               '00510409006103830070997300809944'.
           05                               PIC  X(32) VALUE
               '00109906002094720030954300409779'.
           05                               PIC  X(32) VALUE
               '00509622006094630070891800808645'.
           05                               PIC  X(32) VALUE
               '00109560002094830030965300409597'.
           05                               PIC  X(32) VALUE
               '00509587006097140070902100808677'.
           05                               PIC  X(32) VALUE
               '00109847002095680030977800409595'.
           05                               PIC  X(32) VALUE
               '00509981006102130070936200809124'.
           05                               PIC  X(32) VALUE
               '00110369002104180031039000410470'.
           05                               PIC  X(32) VALUE
               '00510304006102230070968900809881'.
           05                               PIC  X(32) VALUE
               '00110188002102270031009900410021'.
           05                               PIC  X(32) VALUE
               '00510099006102070071009800810132'.
           05                               PIC  X(32) VALUE
               '00110236002104520031016400410159'.
           05                               PIC  X(32) VALUE
               '00510696006104020070884400809260'.
           05                               PIC  X(32) VALUE
               '00109725002100650030984700409837'.
           05                               PIC  X(32) VALUE
               '00509223006096760070896300808521'.
           05                               PIC  X(32) VALUE
               '00108885002087080030845500408524'.
           05                               PIC  X(32) VALUE
               '00508659006085000070819500808186'.
           05                               PIC  X(32) VALUE
               '00109370002093210030915700409006'.
           05                               PIC  X(32) VALUE
               '00509076006088820070817200807681'.
           05                               PIC  X(32) VALUE
               '00109711002096490030952100409509'.
           05                               PIC  X(32) VALUE
               '00509631006093900070890700808893'.
           05                               PIC  X(32) VALUE
               '00108885002086660030852700408641'.
           05                               PIC  X(32) VALUE
               '00508489006082510070809700807966'.
           05                               PIC  X(32) VALUE
               '00109970002101650031024000410210'.
           05                               PIC  X(32) VALUE
               '00509732006099510070926000809469'.
           05                               PIC  X(32) VALUE
               '00108885002087720030894800409272'.
           05                               PIC  X(32) VALUE
               '00509212006089140070824500808272'.
           05                               PIC  X(32) VALUE
               '00108885002084680030810300408423'.
           05                               PIC  X(32) VALUE
               '00508168006085660070781800807367'.
           05                               PIC  X(32) VALUE
               '00108885002090750030796100408369'.
           05                               PIC  X(32) VALUE
               '00508708006085510070874000808125'.
           05                               PIC  X(32) VALUE
               '00108885002084230030822200408365'.
           05                               PIC  X(32) VALUE
               '00508168006081990070774000808093'.
           05                               PIC  X(32) VALUE
               '00108971002090590030944800409939'.
           05                               PIC  X(32) VALUE
               '00508763006086820070825000807837'.
           05                               PIC  X(32) VALUE
               '00110851002112690031101200411413'.
           05                               PIC  X(32) VALUE
               '00510857006108780070996700809845'.
           05                               PIC  X(32) VALUE
               '00111207002106160031080600411079'.
           05                               PIC  X(32) VALUE
               '00510761006112240070983500810139'.
           05                               PIC  X(32) VALUE
               '00109905002099970031003100410155'.
           05                               PIC  X(32) VALUE
               '00510238006102010070966400809625'.
           05                               PIC  X(32) VALUE
               '00111100002108890031063400410473'.
           05                               PIC  X(32) VALUE
               '00511051006105440070960900809719'.
           05                               PIC  X(32) VALUE
               '00108912002093710030870700409262'.
           05                               PIC  X(32) VALUE
               '00509204006092990070952800809112'.
           05                               PIC  X(32) VALUE
               '00108885002084230030808300408182'.
           05                               PIC  X(32) VALUE
               '00508461006080200070742000807333'.
           05                               PIC  X(32) VALUE
               '00109674002098620031008600409906'.
           05                               PIC  X(32) VALUE
               '00509908006095920070919600808963'.
           05                               PIC  X(32) VALUE
               '00108885002086850030848200408328'.
           05                               PIC  X(32) VALUE
               '00508336006082880070786000807584'.
           05                               PIC  X(32) VALUE
               '00109939002101800031012300409879'.
           05                               PIC  X(32) VALUE
               '00510431006096500070921200808766'.
           05                               PIC  X(32) VALUE
               '00109997002099240031022200410311'.
           05                               PIC  X(32) VALUE
               '00510487006103610070971200810081'.
           05                               PIC  X(32) VALUE
               '00109132002094030030936100409744'.
           05                               PIC  X(32) VALUE
               '00509711006098180070953400809327'.
           05                               PIC  X(32) VALUE
               '00108885002087270030870400408849'.
           05                               PIC  X(32) VALUE
               '00509008006089720070834300808575'.
           05                               PIC  X(32) VALUE
               '00108885002084230030820800407984'.
           05                               PIC  X(32) VALUE
               '00508446006086630070802100807822'.
           05                               PIC  X(32) VALUE
               '00110901002111280031088700410978'.
           05                               PIC  X(32) VALUE
               '00511080006113950071034000810570'.
           05                               PIC  X(32) VALUE
               '00309851004103520051117700610818'.
           05                               PIC  X(32) VALUE
               '00709995008097710010931600209348'.
           05                               PIC  X(32) VALUE
               '00309141004090140050887400608928'.
           05                               PIC  X(32) VALUE
               '00708456008082710011013300210095'.
           05                               PIC  X(32) VALUE
               '00309765004098940050973500609876'.
           05                               PIC  X(32) VALUE
               '00709466008094630011023800210621'.
           05                               PIC  X(32) VALUE
               '00310680004104940051033400610884'.
           05                               PIC  X(32) VALUE
               '00710507008100760010888500208423'.
           05                               PIC  X(32) VALUE
               '00308542004088400050854400608365'.
           05                               PIC  X(32) VALUE
               '00707752008074950010888500209763'.
           05                               PIC  X(32) VALUE
               '00309157004094350050945500609825'.
           05                               PIC  X(32) VALUE
               '00709132008090540011195500212034'.
           05                               PIC  X(32) VALUE
               '00312454004126500051283000612788'.
           05                               PIC  X(32) VALUE
               '00712084008120900010892400208807'.
           05                               PIC  X(32) VALUE
               '00308683004088160050907500609019'.
           05                               PIC  X(32) VALUE
               '00708878008086860010888500208491'.
           05                               PIC  X(32) VALUE
               '00308470004086760050830000608757'.
           05                               PIC  X(32) VALUE
               '00708569008083610010888500209137'.
           05                               PIC  X(32) VALUE
               '00308646004094620050858800608251'.
           05                               PIC  X(32) VALUE
               '00708065008080030011033400210373'.
           05                               PIC  X(32) VALUE
               '00309978004100020051012300609891'.
           05                               PIC  X(32) VALUE
               '00709093008093370010975400209608'.
           05                               PIC  X(32) VALUE
               '00309703004097220050961000609410'.
           05                               PIC  X(32) VALUE
               '00709064008091880010948600209666'.
           05                               PIC  X(32) VALUE
               '00309701004096260050940200609319'.
           05                               PIC  X(32) VALUE
               '00708858008090330010964300209520'.
           05                               PIC  X(32) VALUE
               '00309947004099610050992000609799'.
           05                               PIC  X(32) VALUE
               '00709398008092370011067700210625'.
           05                               PIC  X(32) VALUE
               '00310609004103120051011500610164'.
           05                               PIC  X(32) VALUE
               '00709639008097370010914300209360'.
           05                               PIC  X(32) VALUE
               '00309355004091640050905300609033'.
           05                               PIC  X(32) VALUE
               '00708582008086050010957900209499'.
           05                               PIC  X(32) VALUE
               '00309692004092620050951200609295'.
           05                               PIC  X(32) VALUE
               '00708616008084660010912500209252'.
           05                               PIC  X(32) VALUE
               '00309201004088440050851400609050'.
           05                               PIC  X(32) VALUE
               '00708554008085600011001300210540'.
           05                               PIC  X(32) VALUE
               '00311428004118420051132500610882'.
           05                               PIC  X(32) VALUE
               '00710017008100930011231700212381'.
           05                               PIC  X(32) VALUE
               '00312424004129000051273400612821'.
           05                               PIC  X(32) VALUE
               '00712322008123070010967000209600'.
           05                               PIC  X(32) VALUE
               '00309568004097730050948200609402'.
           05                               PIC  X(32) VALUE
               '00708925008088720010918100209068'.
           05                               PIC  X(32) VALUE
               '00309162004092260050925600609351'.
           05                               PIC  X(32) VALUE
               '00708819008088800010908500209153'.
           05                               PIC  X(32) VALUE
               '00309216004092710050901300609189'.
           05                               PIC  X(32) VALUE
               '00708793008086250010987100210022'.
           05                               PIC  X(32) VALUE
               '00310070004101130051039300609726'.
           05                               PIC  X(32) VALUE
               '00709148008085940010910800208585'.
           05                               PIC  X(32) VALUE
               '00308517004083890050841700608441'.
           05                               PIC  X(32) VALUE
               '00708137008080590011114200211413'.
           05                               PIC  X(32) VALUE
               '00311542004115890051188300611937'.
           05                               PIC  X(32) VALUE
               '00711266008112770011082300210784'.
           05                               PIC  X(32) VALUE
               '00310621004109460051075800610431'.
           05                               PIC  X(32) VALUE
               '00710112008100530050833300608294'.
           05                               PIC  X(32) VALUE
               '00707934008078480050970700609600'.
           05                               PIC  X(32) VALUE
               '00709372008094240011033900209761'.
           05                               PIC  X(32) VALUE
               '00309785004098590050962500609426'.
           05                               PIC  X(32) VALUE
               '00709241008090030010888500208423'.
           05                               PIC  X(32) VALUE
               '00307916004073970050687500606342'.
           05                               PIC  X(32) VALUE
               '00705516008050060010933900209236'.
           05                               PIC  X(32) VALUE
               '00309629004095200050936300609340'.
           05                               PIC  X(32) VALUE
               '00708903008086130011068800211389'.
           05                               PIC  X(32) VALUE
               '00310890004108250051065100610634'.
           05                               PIC  X(32) VALUE
               '00710347008104120010982300209868'.
           05                               PIC  X(32) VALUE
               '00309763004097550050980300609796'.
           05                               PIC  X(32) VALUE
               '00709301008090590011161200212077'.
           05                               PIC  X(32) VALUE
               '00312792004129370051282300613063'.
           05                               PIC  X(32) VALUE
               '00712459008130110011019200210330'.
           05                               PIC  X(32) VALUE
               '00310557004103870051052900610705'.
           05                               PIC  X(32) VALUE
               '00710114008101420010982500209600'.
           05                               PIC  X(32) VALUE
               '00309408004096780050984900610009'.
           05                               PIC  X(32) VALUE
               '00709384008097050010994500210303'.
           05                               PIC  X(32) VALUE
               '00310573004103840051009700610264'.
           05                               PIC  X(32) VALUE
               '00710544008106520011060500210758'.
           05                               PIC  X(32) VALUE
               '00310781004106510051073700610763'.
           05                               PIC  X(32) VALUE
               '00709989008099420011157700211524'.
           05                               PIC  X(32) VALUE
               '00311708004117820051173600611777'.
           05                               PIC  X(32) VALUE
               '00711136008113490010990200209400'.
           05                               PIC  X(32) VALUE
               '00309450004094820050973800609429'.
           05                               PIC  X(32) VALUE
               '00709180008090110010888500208423'.
           05                               PIC  X(32) VALUE
               '00308479004083560050823400608413'.
           05                               PIC  X(32) VALUE
               '00708025008074760011242300212349'.
           05                               PIC  X(32) VALUE
               '00312626004128850051322400612793'.
           05                               PIC  X(32) VALUE
               '00712706008128560010888500208423'.
           05                               PIC  X(32) VALUE
               '00308266004083480050820000608448'.
           05                               PIC  X(32) VALUE
               '00707987008077260010989700210220'.
           05                               PIC  X(32) VALUE
               '00309936004094480050939800609178'.
           05                               PIC  X(32) VALUE
               '00708752008084820010900800208432'.
           05                               PIC  X(32) VALUE
               '00308537004087530050878300608923'.
           05                               PIC  X(32) VALUE
               '00708126008078670010888500208868'.
           05                               PIC  X(32) VALUE
               '00308783004090110050894700608600'.
           05                               PIC  X(32) VALUE
               '00708220008082930010888500208423'.
           05                               PIC  X(32) VALUE
               '00307916004076650050761700607442'.
           05                               PIC  X(32) VALUE
               '00707051008067760011092700211072'.
           05                               PIC  X(32) VALUE
               '00311113004108750051105500610953'.
           05                               PIC  X(32) VALUE
               '00710264008103520010933400209014'.
           05                               PIC  X(32) VALUE
               '00308670004089700050887000608673'.
           05                               PIC  X(32) VALUE
               '00707839008087440011010200210466'.
           05                               PIC  X(32) VALUE
               '00310382004106250051039000610367'.
           05                               PIC  X(32) VALUE
               '00709995008110200010933900209275'.
           05                               PIC  X(32) VALUE
               '00309113004091420050923400609235'.
           05                               PIC  X(32) VALUE
               '00708677008087270011321600214080'.
           05                               PIC  X(32) VALUE
               '00315279004153430051528700615435'.
           05                               PIC  X(32) VALUE
               '00714552008160630011059800210466'.
           05                               PIC  X(32) VALUE
               '00310013004102200061025000709768'.
           05                               PIC  X(32) VALUE
               '00809276001102330021036700310226'.
           05                               PIC  X(32) VALUE
               '00410043005102480060999500709366'.
           05                               PIC  X(32) VALUE
               '00809071001132950021333100313341'.
           05                               PIC  X(32) VALUE
               '00413159005131970061301600712451'.
           05                               PIC  X(32) VALUE
               '00812712001124210021252000412396'.
           05                               PIC  X(32) VALUE
               '00512078006121120071135400811236'.
           05                               PIC  X(32) VALUE
               '00112425002125840031253000412408'.
           05                               PIC  X(32) VALUE
               '00512212006121710071158900812075'.
           05                               PIC  X(32) VALUE
               '00109402002092970030939100409619'.
           05                               PIC  X(32) VALUE
               '00509617006095860070905200808942'.
           05                               PIC  X(32) VALUE
               '00113785002138730031384300413615'.
           05                               PIC  X(32) VALUE
               '00513756006136930071308900812929'.
           05                               PIC  X(32) VALUE
               '00109281002093860030964800409580'.
           05                               PIC  X(32) VALUE
               '00509417006093770070867700808246'.
           05                               PIC  X(32) VALUE
               '00610021007094620080938600111859'.
           05                               PIC  X(32) VALUE
               '00212562003120660041204400512057'.
           05                               PIC  X(32) VALUE
               '00611853007112590081138900116041'.
           05                               PIC  X(32) VALUE
               '00216655003165550041700400517351'.
           05                               PIC  X(32) VALUE
               '00617285007161260081667300109329'.
           05                               PIC  X(32) VALUE
               '00209335003091060040899500509050'.
           05                               PIC  X(32) VALUE
               '00608950007084730080846500111510'.
           05                               PIC  X(32) VALUE
               '00211025003115980041214800510747'.
           05                               PIC  X(32) VALUE
               '00611498007106710081031900110332'.
           05                               PIC  X(32) VALUE
               '00210605003105990041001200510431'.
           05                               PIC  X(32) VALUE
               '00609973007098370080975200109438'.
           05                               PIC  X(32) VALUE
               '00209470003094990040967200509901'.
           05                               PIC  X(32) VALUE
               '00609795007092460080904100109440'.
           05                               PIC  X(32) VALUE
               '00209310003093040040921900509414'.
           05                               PIC  X(32) VALUE
               '00609382007089590080882000111422'.
           05                               PIC  X(32) VALUE
               '00211666003121510041219100512197'.
           05                               PIC  X(32) VALUE
               '00611911007113710081141000109993'.
           05                               PIC  X(32) VALUE
               '00209949003100910040997600510163'.
           05                               PIC  X(32) VALUE
               '00610129007098920081004800109893'.
           05                               PIC  X(32) VALUE
               '00209951003097380040962700509468'.
           05                               PIC  X(32) VALUE
               '00609685007091540080909200109599'.
           05                               PIC  X(32) VALUE
               '00209807003100810041001100509680'.
           05                               PIC  X(32) VALUE
               '00610111007093450080944400109178'.
           05                               PIC  X(32) VALUE
               '00209210003091320040917700508839'.
           05                               PIC  X(32) VALUE
               '00608846007082250080812600112148'.
           05                               PIC  X(32) VALUE
               '00212156003125090041262800513011'.
           05                               PIC  X(32) VALUE
               '00613082007128660081309400110285'.
           05                               PIC  X(32) VALUE
               '00209942003098420040986100509583'.
           05                               PIC  X(32) VALUE
               '00609735007090680080884800309441'.
           05                               PIC  X(32) VALUE
               '00409471005101570060888300709400'.
           05                               PIC  X(32) VALUE
               '00809891001088850020845100308774'.
           05                               PIC  X(32) VALUE
               '00408834005088050060840700708412'.
           05                               PIC  X(32) VALUE
               '00807985001088850020842300308555'.
           05                               PIC  X(32) VALUE
               '00408313005081610060787900707669'.
           05                               PIC  X(32) VALUE
               '00807496001088850020864900309127'.
           05                               PIC  X(32) VALUE
               '00408561005089200060877100707907'.
           05                               PIC  X(32) VALUE
               '00807671003112410041135600511499'.
           05                               PIC  X(32) VALUE
               '00611604007107280081056300108885'.
           05                               PIC  X(32) VALUE
               '00208423003087400040870900508792'.
           05                               PIC  X(32) VALUE
               '00608724007080360080782800109272'.
           05                               PIC  X(32) VALUE
               '00209456003098150040955000509684'.
           05                               PIC  X(32) VALUE
               '00609670007088550080889200111538'.
           05                               PIC  X(32) VALUE
               '00211577003115310041160100511359'.
           05                               PIC  X(32) VALUE
               '00611418007107900081081800110586'.
           05                               PIC  X(32) VALUE
               '00210830003108330041096700511244'.
           05                               PIC  X(32) VALUE
               '00611248007105960081048900109073'.
           05                               PIC  X(32) VALUE
               '00208826003082740040837500507701'.
           05                               PIC  X(32) VALUE
               '00608468007077220080785600109246'.
           05                               PIC  X(32) VALUE
               '00209132003089980040917000509123'.
           05                               PIC  X(32) VALUE
               '00609095007086940080859500110642'.
           05                               PIC  X(32) VALUE
               '00210808003106510041103700511273'.
           05                               PIC  X(32) VALUE
               '00610961007106460081073300109774'.
           05                               PIC  X(32) VALUE
               '00209896003099900040987300509772'.
           05                               PIC  X(32) VALUE
               '00610048007094530080956600108885'.
           05                               PIC  X(32) VALUE
               '00208423003079160040739700506875'.
           05                               PIC  X(32) VALUE
               '00606342007055160080500600110852'.
           05                               PIC  X(32) VALUE
               '00210431003105990041050600510775'.
           05                               PIC  X(32) VALUE
               '00610463007096880080998600111776'.
           05                               PIC  X(32) VALUE
               '00212019003121360041210500512162'.
           05                               PIC  X(32) VALUE
               '00612129007114860081168600110581'.
           05                               PIC  X(32) VALUE
               '00210352003105720041043000510467'.
           05                               PIC  X(32) VALUE
               '00611333007098120080958800111384'.
           05                               PIC  X(32) VALUE
               '00211487003115910041153900511864'.
           05                               PIC  X(32) VALUE
               '00612000007113710081133800110316'.
           05                               PIC  X(32) VALUE
               '00210356003105760041080000510705'.
           05                               PIC  X(32) VALUE
               '00612930007122960081202300111463'.
           05                               PIC  X(32) VALUE
               '00211353003112780041130200511404'.
           05                               PIC  X(32) VALUE
               '00611324007106690081071100109930'.
           05                               PIC  X(32) VALUE
               '00210041003100870040991300510099'.
           05                               PIC  X(32) VALUE
               '00609852007094310080914300109014'.
           05                               PIC  X(32) VALUE
               '00209215003093420040920700509065'.
           05                               PIC  X(32) VALUE
               '00609217007086930080852800109674'.
           05                               PIC  X(32) VALUE
               '00209902003097670040948500509281'.
           05                               PIC  X(32) VALUE
               '00609258007088260080860000109404'.
           05                               PIC  X(32) VALUE
               '00209850003100250040956700509914'.
           05                               PIC  X(32) VALUE
               '00611182007086540080916800110130'.
           05                               PIC  X(32) VALUE
               '00210385004103740051022100610370'.
           05                               PIC  X(32) VALUE
               '00709675008094990010939400209300'.
           05                               PIC  X(32) VALUE
               '00410142005106260061103600710232'.
           05                               PIC  X(32) VALUE
               '00809834001101250021013000309875'.
           05                               PIC  X(32) VALUE
               '00409766005097980060941100709238'.
           05                               PIC  X(32) VALUE
               '00809082001127560021389500314292'.
           05                               PIC  X(32) VALUE
               '00414509005148500061493900715628'.
           05                               PIC  X(32) VALUE
               '00814572001114790021259500311309'.
           05                               PIC  X(32) VALUE
               '00410902005108790061101200710626'.
           05                               PIC  X(32) VALUE
               '00810340001097500020966200309948'.
           05                               PIC  X(32) VALUE
               '00409894005100710061021100709819'.
           05                               PIC  X(32) VALUE
               '00809706001115260021148000311716'.
           05                               PIC  X(32) VALUE
               '00412118005119370061222900711495'.
           05                               PIC  X(32) VALUE
               '00811409001088850020910400309173'.
           05                               PIC  X(32) VALUE
               '00409151005091720060933000709192'.
           05                               PIC  X(32) VALUE
               '00809098001116350021201100311352'.
           05                               PIC  X(32) VALUE
               '00411850005117790061156500710833'.
           05                               PIC  X(32) VALUE
               '00810720001095340020946900309349'.
           05                               PIC  X(32) VALUE
               '00409310005092280060908400708626'.
           05                               PIC  X(32) VALUE
               '00808714001104360021051700310358'.
           05                               PIC  X(32) VALUE
               '00410393005107380061060400709966'.
           05                               PIC  X(32) VALUE
               '00809946001108440021069600310672'.
           05                               PIC  X(32) VALUE
               '00410489005107100061059700710214'.
           05                               PIC  X(32) VALUE
               '00810246001093190020932200309500'.
           05                               PIC  X(32) VALUE
               '00409543005093560060954800709044'.
           05                               PIC  X(32) VALUE
               '00808908001098400020967900309544'.
           05                               PIC  X(32) VALUE
               '00409652005094300060912700708863'.
           05                               PIC  X(32) VALUE
               '00808854001135560021407800314254'.
           05                               PIC  X(32) VALUE
               '00414341005148860061485300713816'.
           05                               PIC  X(32) VALUE
               '00814769001095000020934300309301'.
           05                               PIC  X(32) VALUE
               '00409195005096490060922500708536'.
           05                               PIC  X(32) VALUE
               '00808830001104160021090900311134'.
           05                               PIC  X(32) VALUE
               '00411598005117480061167100710754'.
           05                               PIC  X(32) VALUE
               '00811023001098170020975400309877'.
           05                               PIC  X(32) VALUE
               '00409532005097690060965300709096'.
           05                               PIC  X(32) VALUE
               '00808880001099500021065200309248'.
           05                               PIC  X(32) VALUE
               '00410968005107770061088800710284'.
           05                               PIC  X(32) VALUE
               '00809867001093590020948100309525'.
           05                               PIC  X(32) VALUE
               '00409517005096280060960700709191'.
           05                               PIC  X(32) VALUE
               '00809431001109150021098900311158'.
           05                               PIC  X(32) VALUE
               '00411501005116080061176700711256'.
           05                               PIC  X(32) VALUE
               '00811082001147680021509400315595'.
           05                               PIC  X(32) VALUE
               '00415837005160850061657900715648'.
           05                               PIC  X(32) VALUE
               '00816092001094740020942600309493'.
           05                               PIC  X(32) VALUE
               '00409770005096360060951800709253'.
           05                               PIC  X(32) VALUE
               '00809271001098480020989900309920'.
           05                               PIC  X(32) VALUE
               '00409677005099190060979400709442'.
           05                               PIC  X(32) VALUE
               '00809073001088850020880400309055'.
           05                               PIC  X(32) VALUE
               '00408902005083710060877600708296'.
           05                               PIC  X(32) VALUE
               '00808230001093870020931100309324'.
           05                               PIC  X(32) VALUE
               '00409358005093680060951000709031'.
           05                               PIC  X(32) VALUE
               '00808946001119300021195400312129'.
           05                               PIC  X(32) VALUE
               '00412192005124310061266100711984'.
           05                               PIC  X(32) VALUE
               '00811936001094270020979300309311'.
           05                               PIC  X(32) VALUE
               '00409373005094010060918000708190'.
           05                               PIC  X(32) VALUE
               '00808357001156730021596600316038'.
           05                               PIC  X(32) VALUE
               '00416409005167900061662900715949'.
           05                               PIC  X(32) VALUE
               '00816346001088850020842300307916'.
           05                               PIC  X(32) VALUE
               '00407397005068750060634200705516'.
           05                               PIC  X(32) VALUE
               '00805006001157830021636400316608'.
           05                               PIC  X(32) VALUE
               '00417056005173510061765400716926'.
           05                               PIC  X(32) VALUE
               '00817416001088850020842300307916'.
           05                               PIC  X(32) VALUE
               '00407397005068750060634200705516'.
           05                               PIC  X(32) VALUE
               '00805006001118630021221100313181'.
           05                               PIC  X(32) VALUE
               '00413146005132750061365000713109'.
           05                               PIC  X(32) VALUE
               '00813096001120820021207900312419'.
           05                               PIC  X(32) VALUE
               '00412673005126630061285400712076'.
           05                               PIC  X(32) VALUE
               '00812052001122240021167700312364'.
           05                               PIC  X(32) VALUE
               '00412584005129180061258700712281'.
           05                               PIC  X(32) VALUE
               '00812684001158530021627300317016'.
           05                               PIC  X(32) VALUE
               '00417360005177010061769300717159'.
           05                               PIC  X(32) VALUE
               '00818083001114150021139600311329'.
           05                               PIC  X(32) VALUE
               '00411211005113110061146500710690'.
           05                               PIC  X(32) VALUE
               '00810412001141040021522800315511'.
           05                               PIC  X(32) VALUE
               '00416408005168080061706200716148'.
           05                               PIC  X(32) VALUE
               '00816459001100760021038900310484'.
           05                               PIC  X(32) VALUE
               '00109889002098450030963800409671'.
           05                               PIC  X(32) VALUE
               '00509565006094140070912100808978'.
           05                               PIC  X(32) VALUE
               '00108927002087880030892600408805'.
           05                               PIC  X(32) VALUE
               '00508859006087070070835200808269'.
           05                               PIC  X(32) VALUE
               '00112101002120380031221400412421'.
           05                               PIC  X(32) VALUE
               '00512245006122140071157400811784'.
           05                               PIC  X(32) VALUE
               '00210079003099340040974000509903'.
           05                               PIC  X(32) VALUE
               '00609615007090580080886000109315'.
           05                               PIC  X(32) VALUE
               '00209503003094730040942600509695'.
           05                               PIC  X(32) VALUE
               '00609759007093290080952600109938'.
           05                               PIC  X(32) VALUE
               '00208951003087820040953600508530'.
           05                               PIC  X(32) VALUE
               '00608750007080340080855400109157'.
           05                               PIC  X(32) VALUE
               '00209333003089460040892100508867'.
           05                               PIC  X(32) VALUE
               '00609022007085290080842200109806'.
           05                               PIC  X(32) VALUE
               '00209686003097640040942000509619'.
           05                               PIC  X(32) VALUE
               '00609609007095650080902000110071'.
           05                               PIC  X(32) VALUE
               '00210064003100930040988400509502'.
           05                               PIC  X(32) VALUE
               '00609828007091790080834800110231'.
           05                               PIC  X(32) VALUE
               '00210362003101500041031400510249'.
           05                               PIC  X(32) VALUE
               '00610514007094530080954200109587'.
           05                               PIC  X(32) VALUE
               '00209659003099450040953700509880'.
           05                               PIC  X(32) VALUE
               '00609917007093510080919600111399'.
           05                               PIC  X(32) VALUE
               '00210999003110350041115800511047'.
           05                               PIC  X(32) VALUE
               '00611173007105340081083600109190'.
           05                               PIC  X(32) VALUE
               '00209360003094400040961800510096'.
           05                               PIC  X(32) VALUE
               '00609650007089830080918900110712'.
           05                               PIC  X(32) VALUE
               '00210611003109410041099500510972'.
           05                               PIC  X(32) VALUE
               '00610835007102760081038900108885'.
           05                               PIC  X(32) VALUE
               '00208916003091770040890200508941'.
           05                               PIC  X(32) VALUE
               '00608848007087050080859100108885'.
           05                               PIC  X(32) VALUE
               '00209047003091760040937900509726'.
           05                               PIC  X(32) VALUE
               '00609760007090060080924700108885'.
           05                               PIC  X(32) VALUE
               '00209248003092540040944400509621'.
           05                               PIC  X(32) VALUE
               '00609279007092770080952100607731'.
           05                               PIC  X(32) VALUE
               '00707074008076490011181900212046'.
           05                               PIC  X(32) VALUE
               '00312513004126960051304300613364'.
           05                               PIC  X(32) VALUE
               '00713089008133710010888500208510'.
           05                               PIC  X(32) VALUE
               '00309076004087250050862300608307'.
           05                               PIC  X(32) VALUE
               '00707572008074630011000800210203'.
           05                               PIC  X(32) VALUE
               '00310460004103420051035000610469'.
           05                               PIC  X(32) VALUE
               '00709804008098400011122800211359'.
           05                               PIC  X(32) VALUE
               '00311668004118780051184100611989'.
           05                               PIC  X(32) VALUE
               '00711416008117540010908100209414'.
           05                               PIC  X(32) VALUE
               '00309526004094720050889100609307'.
           05                               PIC  X(32) VALUE
               '00708617008085310010965100209627'.
           05                               PIC  X(32) VALUE
               '00309520004093540050950100609569'.
           05                               PIC  X(32) VALUE
               '00709098008090420010888500209228'.
           05                               PIC  X(32) VALUE
               '00309293004096000050958400609729'.
           05                               PIC  X(32) VALUE
               '00709235008091230010888500208532'.
           05                               PIC  X(32) VALUE
               '00308201004086060050858100608189'.
           05                               PIC  X(32) VALUE
               '00707959008079760011000800210092'.
           05                               PIC  X(32) VALUE
               '00309954004099400051009200609969'.
           05                               PIC  X(32) VALUE
               '00709174008090440010932400209191'.
           05                               PIC  X(32) VALUE
               '00309012004092520050954700609462'.
           05                               PIC  X(32) VALUE
               '00708843008089790011132500211407'.
           05                               PIC  X(32) VALUE
               '00311293004112050051116100610728'.
           05                               PIC  X(32) VALUE
               '00710090008103720010941500209688'.
           05                               PIC  X(32) VALUE
               '00309758004097520051005400610020'.
           05                               PIC  X(32) VALUE
               '00709344008090750010893000208531'.
           05                               PIC  X(32) VALUE
               '00308803004089240050916200609294'.
           05                               PIC  X(32) VALUE
               '00708386008081480010903700208993'.
           05                               PIC  X(32) VALUE
               '00308764004089780050920000609346'.
           05                               PIC  X(32) VALUE
               '00708689008085430010958300209276'.
           05                               PIC  X(32) VALUE
               '00309620004093030050879200608524'.
           05                               PIC  X(32) VALUE
               '00708359008083710010888500208839'.
           05                               PIC  X(32) VALUE
               '00308957004088800050894800608953'.
           05                               PIC  X(32) VALUE
               '00708465008086630010926800208811'.
           05                               PIC  X(32) VALUE
               '00308547004084820050840300608393'.
           05                               PIC  X(32) VALUE
               '00708020008079270011561200215937'.
           05                               PIC  X(32) VALUE
               '00315480004151730051579600615781'.
           05                               PIC  X(32) VALUE
               '00714677008158620010986100108885'.
           05                               PIC  X(32) VALUE
               '00209012003087630040858500508519'.
           05                               PIC  X(32) VALUE
               '00608687007084580080900200110272'.
           05                               PIC  X(32) VALUE
               '00210351003106950041095400510796'.
           05                               PIC  X(32) VALUE
               '00611134007102510081060800109197'.
           05                               PIC  X(32) VALUE
               '00209254003093070040938800509477'.
           05                               PIC  X(32) VALUE
               '00609471007090260080921900110581'.
           05                               PIC  X(32) VALUE
               '00210494003106510041071900510811'.
           05                               PIC  X(32) VALUE
               '00611349007103720081036100108904'.
           05                               PIC  X(32) VALUE
               '00209089003089910040908300508861'.
           05                               PIC  X(32) VALUE
               '00608881007085830080846800109037'.
           05                               PIC  X(32) VALUE
               '00208823003096340040949900509259'.
           05                               PIC  X(32) VALUE
               '00608485007082680080820600110318'.
           05                               PIC  X(32) VALUE
               '00210585003105560041046500510372'.
           05                               PIC  X(32) VALUE
               '00610197007096520080955400111421'.
           05                               PIC  X(32) VALUE
               '00211638003114570041144100511510'.
           05                               PIC  X(32) VALUE
               '00611333007108380081067100108945'.
           05                               PIC  X(32) VALUE
               '00208852003089920040897100509010'.
           05                               PIC  X(32) VALUE
               '00608944007083960080843200110024'.
           05                               PIC  X(32) VALUE
               '00210235003102160041016000509985'.
           05                               PIC  X(32) VALUE
               '00610107007089870080893100108885'.
           05                               PIC  X(32) VALUE
               '00208489003083640040853700507793'.
           05                               PIC  X(32) VALUE
               '00110526002108920031210500410085'.
           05                               PIC  X(32) VALUE
               '00510280006101620071019700810048'.
           05                               PIC  X(32) VALUE
               '00110523002101590031026800410310'.
           05                               PIC  X(32) VALUE
               '00510449006105000070985100809672'.
           05                               PIC  X(32) VALUE
               '00108885002084230030791600407397'.
           05                               PIC  X(32) VALUE
               '00507266006070550070675400806871'.
           05                               PIC  X(32) VALUE
               '00109568002095420030956500409583'.
           05                               PIC  X(32) VALUE
               '00509539006094050070872100808691'.
           05                               PIC  X(32) VALUE
               '00108885002087500030835900409333'.
           05                               PIC  X(32) VALUE
               '00509728006101110071012600809058'.
           05                               PIC  X(32) VALUE
               '00108885002085690030848900408555'.
           05                               PIC  X(32) VALUE
               '00508332006076690070810700808239'.
           05                               PIC  X(32) VALUE
               '00110945002112480031142400411302'.
           05                               PIC  X(32) VALUE
               '00511164006111820071069200810699'.
           05                               PIC  X(32) VALUE
               '00110016002103540030993200409604'.
           05                               PIC  X(32) VALUE
               '00509505006097260070913300809165'.
           05                               PIC  X(32) VALUE
               '00110677002106240031046300410357'.
           05                               PIC  X(32) VALUE
               '00510341006105710070913200809260'.
           05                               PIC  X(32) VALUE
               '00109349002097660030962400409527'.
           05                               PIC  X(32) VALUE
               '00509470006094480070836700808670'.
           05                               PIC  X(32) VALUE
               '00111527002112880031191300411450'.
           05                               PIC  X(32) VALUE
               '00511729006116390071110700811218'.
           05                               PIC  X(32) VALUE
               '00110615002103670031083700410512'.
           05                               PIC  X(32) VALUE
               '00510523006106400071046300810109'.
           05                               PIC  X(32) VALUE
               '00108885002084230030791600407397'.
           05                               PIC  X(32) VALUE
               '00506875006063420070551600805006'.
           05                               PIC  X(32) VALUE
               '00109770002098930030987800410058'.
           05                               PIC  X(32) VALUE
               '00509836006105510070970200809568'.
           05                               PIC  X(32) VALUE
               '00108993002092670030950100409420'.
           05                               PIC  X(32) VALUE
               '00509180006091160070835200808292'.
           05                               PIC  X(32) VALUE
               '00111416002112970031135300411768'.
           05                               PIC  X(32) VALUE
               '00511915006116720071184100812018'.
           05                               PIC  X(32) VALUE
               '00109539002095900031001400409807'.
           05                               PIC  X(32) VALUE
               '00509671006098110070937600809528'.
       01  COM-WAGE-INDEX-TABLE REDEFINES COM-WAGE-INDEX-FILLER.
           05  COM-WI-ENTRY OCCURS 3612 TIMES.
               10  COM-WI-DATE-CODE         PIC  9(03).
               10  COM-WAGE-INDEX           PIC  9V9(04).
