       01  W-WART-DATE-FILLS.
           03                          PIC X(11)   VALUE
               '20050401001'.
       01  W-WART-DATE-TABLE REDEFINES W-WART-DATE-FILLS.
           03  WWD-ENTRY OCCURS 1 TIMES.
               05  WWD-DATE            PIC X(8).
               05  WWD-DTCD            PIC 9(3).
       01  WWD-MAX                     PIC S9(7)   COMP-3
                                       VALUE +1.
       01  WWD-SUB                     PIC S9(7)   COMP-3.
       01  W-WART-MSA-FILLS.
           03                          PIC X(45)   VALUE
               '    00000  0100001  0200002  0300003  0400004'.
           03                          PIC X(45)   VALUE
               '  0500005  0600006  0700007  0800008  1000009'.
           03                          PIC X(45)   VALUE
               '  1100010  1200011  1300012  1400013  1500014'.
           03                          PIC X(45)   VALUE
               '  1600015  1700016  1800017  1900018  2000019'.
           03                          PIC X(45)   VALUE
               '  2100020  2200021  2300022  2400023  2500024'.
           03                          PIC X(45)   VALUE
               '  2600025  2700026  2800027  2900028  3000029'.
           03                          PIC X(45)   VALUE
               '  3200030  3300031  3400032  3500033  3600034'.
           03                          PIC X(45)   VALUE
               '  3700035  3800036  3900037  4000038  4100039'.
           03                          PIC X(45)   VALUE
               '  4200040  4300041  4400042  4500043  4600044'.
           03                          PIC X(45)   VALUE
               '  4700045  4800046  4900047  5000048  5100049'.
           03                          PIC X(45)   VALUE
               '  5200050  5300051  5500052  6700053  6800054'.
           03                          PIC X(45)   VALUE
               '  6900055  7000056  7100057  7200058  7300059'.
           03                          PIC X(45)   VALUE
               '  7400060  7500061  7600062  7700063  7800064'.
           03                          PIC X(45)   VALUE
               '  8000065004000066006000067008000068012000069'.
           03                          PIC X(45)   VALUE
               '016000070020000071022000072024000073028000074'.
           03                          PIC X(45)   VALUE
               '032000075036000076038000077040000078040500079'.
           03                          PIC X(45)   VALUE
               '044000080045000081046000082047000083048000084'.
           03                          PIC X(45)   VALUE
               '050000085052000086056000087060000088062000089'.
           03                          PIC X(45)   VALUE
               '064000090068000091072000092073300093076000094'.
           03                          PIC X(45)   VALUE
               '078000095084000096084500097086000098087000099'.
           03                          PIC X(45)   VALUE
               '087500100088000101092000102096000103100000104'.
           03                          PIC X(45)   VALUE
               '101000105102000106104000107108000108112300109'.
           03                          PIC X(45)   VALUE
               '112500110114000111114500112115000113116300114'.
           03                          PIC X(45)   VALUE
               '124000115126000116128000117130000118130300119'.
           03                          PIC X(45)   VALUE
               '131000120132000121135000122136000123140000124'.
           03                          PIC X(45)   VALUE
               '144000125148000126152000127154000128156000129'.
           03                          PIC X(45)   VALUE
               '158000130160000131162000132164000133166000134'.
           03                          PIC X(45)   VALUE
               '168000135172000136174000137176000138180000139'.
           03                          PIC X(45)   VALUE
               '184000140188000141190000142192000143195000144'.
           03                          PIC X(45)   VALUE
               '196000145200000146202000147204000148208000149'.
           03                          PIC X(45)   VALUE
               '212000150216000151218000152220000153224000154'.
           03                          PIC X(45)   VALUE
               '229000155232000156233000157233500158234000159'.
           03                          PIC X(45)   VALUE
               '236000160240000161244000162252000163256000164'.
           03                          PIC X(45)   VALUE
               '258000165264000166265000167265500168267000169'.
           03                          PIC X(45)   VALUE
               '268000170270000171271000172272000173275000174'.
           03                          PIC X(45)   VALUE
               '276000175280000176284000177288000178290000179'.
           03                          PIC X(45)   VALUE
               '292000180296000181297500182298500183300000184'.
           03                          PIC X(45)   VALUE
               '304000185306000186308000187312000188316000189'.
           03                          PIC X(45)   VALUE
               '318000190320000191324000192328300193329000194'.
           03                          PIC X(45)   VALUE
               '332000195335000196336000197340000198344000199'.
           03                          PIC X(45)   VALUE
               '348000200350000201352000202356000203358000204'.
           03                          PIC X(45)   VALUE
               '360000205360500206362000207364000208366000209'.
           03                          PIC X(45)   VALUE
               '368000210369000211371000212372000213374000214'.
           03                          PIC X(45)   VALUE
               '376000215380000216381000217384000218385000219'.
           03                          PIC X(45)   VALUE
               '387000220388000221392000222396000223396500224'.
           03                          PIC X(45)   VALUE
               '398000225400000226404000227408000228410000229'.
           03                          PIC X(45)   VALUE
               '412000230415000231420000232424300233428000234'.
           03                          PIC X(45)   VALUE
               '432000235436000236440000237442000238444000239'.
           03                          PIC X(45)   VALUE
               '448000240452000241460000242464000243468000244'.
           03                          PIC X(45)   VALUE
               '472000245476300246480000247484000248488000249'.
           03                          PIC X(45)   VALUE
               '489000250490000251492000252494000253500000254'.
           03                          PIC X(45)   VALUE
               '501500255504000256508000257512000258516000259'.
           03                          PIC X(45)   VALUE
               '517000260519000261520000262524000263528000264'.
           03                          PIC X(45)   VALUE
               '532000265534500266536000267538000268540300269'.
           03                          PIC X(45)   VALUE
               '548300270552300271556000272560000273564000274'.
           03                          PIC X(45)   VALUE
               '570000275572000276577500277579000278580000279'.
           03                          PIC X(45)   VALUE
               '588000280591000281592000282595000283596000284'.
           03                          PIC X(45)   VALUE
               '599000285600000286601500287602000288602500289'.
           03                          PIC X(45)   VALUE
               '608000290612000291616000292620000293624000294'.
           03                          PIC X(45)   VALUE
               '628000295632300296636000297640300298644000299'.
           03                          PIC X(45)   VALUE
               '645300300646000301648300302652000303656000304'.
           03                          PIC X(45)   VALUE
               '660000305664000306666000307668000308669000309'.
           03                          PIC X(45)   VALUE
               '672000310674000311676000312678000313680000314'.
           03                          PIC X(45)   VALUE
               '682000315684000316688000317692000318696000319'.
           03                          PIC X(45)   VALUE
               '698000320700000321704000322708000323712000324'.
           03                          PIC X(45)   VALUE
               '716000325720000326724000327732000328736000329'.
           03                          PIC X(45)   VALUE
               '740000330744000331748000332748500333749000334'.
           03                          PIC X(45)   VALUE
               '750000335751000336752000337756000338760000339'.
           03                          PIC X(45)   VALUE
               '761000340762000341764000342768000343772000344'.
           03                          PIC X(45)   VALUE
               '776000345780000346784000347788000348792000349'.
           03                          PIC X(45)   VALUE
               '800300350805000351808000352812000353816000354'.
           03                          PIC X(45)   VALUE
               '820000355824000356828000357832000358836000359'.
           03                          PIC X(45)   VALUE
               '840000360844000361848000362852000363856000364'.
           03                          PIC X(45)   VALUE
               '860000365864000366868000367872000368872500369'.
           03                          PIC X(45)   VALUE
               '875000370876000371878000372880000373884000374'.
           03                          PIC X(45)   VALUE
               '892000375894000376896000377900000378904000379'.
           03                          PIC X(45)   VALUE
               '908000380914000381916000382920000383924300384'.
           03                          PIC X(36)   VALUE
               '926000385928000386932000387934000388'.
       01  W-WART-MSA-TABLE REDEFINES W-WART-MSA-FILLS.
           03  WWM-ENTRY OCCURS 389 TIMES
                   ASCENDING KEY IS WWM-MSA
                   INDEXED BY WWM-INDX.
               05  WWM-MSA             PIC X(4).
               05  WWM-PTR             PIC 9(5).
       01  WWM-MAX                     PIC S9(7)   COMP-3
                                       VALUE +389.
       01  W-WART-WART-FILLS.
           03                          PIC X(45)   VALUE
               '001012757012318001014635014635001012868012435'.
           03                          PIC X(45)   VALUE
               '001012757012318001013700013327001012821012386'.
           03                          PIC X(45)   VALUE
               '001013602013222001012876012444001012775012337'.
           03                          PIC X(45)   VALUE
               '001012757012318001014040013692001012783012345'.
           03                          PIC X(45)   VALUE
               '001012757012318001012757012318001012757012318'.
           03                          PIC X(45)   VALUE
               '001012757012318001012757012318001012757012318'.
           03                          PIC X(45)   VALUE
               '001012757012318001013027012608001013599013219'.
           03                          PIC X(45)   VALUE
               '001013298012897001012757012318001012757012318'.
           03                          PIC X(45)   VALUE
               '001012757012318001012787012350001012757012318'.
           03                          PIC X(45)   VALUE
               '001013320012920001013224012818001012868012436'.
           03                          PIC X(45)   VALUE
               '001012778012340001012757012318001012770012331'.
           03                          PIC X(45)   VALUE
               '001012866012434001012757012318001013266012864'.
           03                          PIC X(45)   VALUE
               '001013254012848001012757012318001013086012669'.
           03                          PIC X(45)   VALUE
               '001012757012318001012757012318001012757012318'.
           03                          PIC X(45)   VALUE
               '001012757012318001012856012424001012757012318'.
           03                          PIC X(45)   VALUE
               '001012757012318001012757012318001013135012721'.
           03                          PIC X(45)   VALUE
               '001012843012409001012757012318001013129012715'.
           03                          PIC X(45)   VALUE
               '001013700013327001012757012318001012775012337'.
           03                          PIC X(45)   VALUE
               '001012775012337001012757012318001012757012318'.
           03                          PIC X(45)   VALUE
               '001012866012434001013254012848001012757012318'.
           03                          PIC X(45)   VALUE
               '001013700013327001012757012318001012757012318'.
           03                          PIC X(45)   VALUE
               '001012757012318001013027012608001012758012318'.
           03                          PIC X(45)   VALUE
               '001012757012318001013739013368001012757012318'.
           03                          PIC X(45)   VALUE
               '001012993012570001013560013177001012970012546'.
           03                          PIC X(45)   VALUE
               '001013475013087001013379012984001013003012580'.
           03                          PIC X(45)   VALUE
               '001014572014264001014635014635001013174012763'.
           03                          PIC X(45)   VALUE
               '001012757012318001014580014271001012757012318'.
           03                          PIC X(45)   VALUE
               '001013260012856001012757012318001013057012639'.
           03                          PIC X(45)   VALUE
               '001012757012318001013007012584001013472013082'.
           03                          PIC X(45)   VALUE
               '001013008012585001014021013670001013514013129'.
           03                          PIC X(45)   VALUE
               '001014164013825001013855013493001012934012509'.
           03                          PIC X(45)   VALUE
               '001013180012771001013405013011001013085012667'.
           03                          PIC X(45)   VALUE
               '001013852013489001013287012885001012757012318'.
           03                          PIC X(45)   VALUE
               '001014222014071001013216012808001012757012318'.
           03                          PIC X(45)   VALUE
               '001013000012577001013183012773001013064012647'.
           03                          PIC X(45)   VALUE
               '001012978012554001012969012545001013523013139'.
           03                          PIC X(45)   VALUE
               '001013945013589001014062013715001012879012447'.
           03                          PIC X(45)   VALUE
               '001013402013008001012914012487001014149013808'.
           03                          PIC X(45)   VALUE
               '001012979012556001012868012437001013355012959'.
           03                          PIC X(45)   VALUE
               '001012757012318001013137012724001012757012318'.
           03                          PIC X(45)   VALUE
               '001013151012740001013629013252001013105012692'.
           03                          PIC X(45)   VALUE
               '001013339012939001013144012733001013586013206'.
           03                          PIC X(45)   VALUE
               '001012979012557001013315012915001013245012839'.
           03                          PIC X(45)   VALUE
               '001013121012706001014279013948001013953013598'.
           03                          PIC X(45)   VALUE
               '001013722013350001012757012318001014166013827'.
           03                          PIC X(45)   VALUE
               '001013583013203001014008013656001013043012624'.
           03                          PIC X(45)   VALUE
               '001012815012379001013412013019001013152012741'.
           03                          PIC X(45)   VALUE
               '001012822012387001013447013056001012757012318'.
           03                          PIC X(45)   VALUE
               '001013312012911001013782013414001012785012347'.
           03                          PIC X(45)   VALUE
               '001013169012757001014360014035001013521013136'.
           03                          PIC X(45)   VALUE
               '001014303013973001012757012318001013263012861'.
           03                          PIC X(45)   VALUE
               '001013010012588001012884012453001012841012408'.
           03                          PIC X(45)   VALUE
               '001012930012501001013263012860001012951012524'.
           03                          PIC X(45)   VALUE
               '001013182012774001013337012937001013410013016'.
           03                          PIC X(45)   VALUE
               '001013383012988001012757012318001012757012318'.
           03                          PIC X(45)   VALUE
               '001014183013845001012757012318001012757012318'.
           03                          PIC X(45)   VALUE
               '001013149012738001013723013351001012973012549'.
           03                          PIC X(45)   VALUE
               '001013009012587001012897012467001012757012318'.
           03                          PIC X(45)   VALUE
               '001012932012505001013306012904001014209013872'.
           03                          PIC X(45)   VALUE
               '001012848012417001013025012606001013786013420'.
           03                          PIC X(45)   VALUE
               '001013847013485001012898012468001012926012498'.
           03                          PIC X(45)   VALUE
               '001013341012944001013209012801001013434013043'.
           03                          PIC X(45)   VALUE
               '001013334012933001012967012542001013015012595'.
           03                          PIC X(45)   VALUE
               '001013279012878001013487013098001013392012997'.
           03                          PIC X(45)   VALUE
               '001014038013690001012757012318001014173013834'.
           03                          PIC X(45)   VALUE
               '001012802012366001013724013353001013011012588'.
           03                          PIC X(45)   VALUE
               '001012757012318001013516013130001014323014037'.
           03                          PIC X(45)   VALUE
               '001013443013053001012882012451001012757012318'.
           03                          PIC X(45)   VALUE
               '001013077012658001012775012337001012839012405'.
           03                          PIC X(45)   VALUE
               '001013846013484001012757012318001013336012936'.
           03                          PIC X(45)   VALUE
               '001014066013719001012797012361001014325013998'.
           03                          PIC X(45)   VALUE
               '001013084012666001013322012921001013739013369'.
           03                          PIC X(45)   VALUE
               '001012812012375001012783012345001013239012834'.
           03                          PIC X(45)   VALUE
               '001013100012687001013284012883001012865012433'.
           03                          PIC X(45)   VALUE
               '001013017012597001014141013798001012757012318'.
           03                          PIC X(45)   VALUE
               '001013538013154001013598013218001012757012318'.
           03                          PIC X(45)   VALUE
               '001012757012318001014101013758001013182012773'.
           03                          PIC X(45)   VALUE
               '001013027012608001012839012406001013021012601'.
           03                          PIC X(45)   VALUE
               '001013329012929001012996012572001013596013217'.
           03                          PIC X(45)   VALUE
               '001012757012318001013422013030001014635014502'.
           03                          PIC X(45)   VALUE
               '001013440013050001012987012563001012800012363'.
           03                          PIC X(45)   VALUE
               '001012946012519001013545013163001013120012704'.
           03                          PIC X(45)   VALUE
               '001013040012620001012757012318001012757012318'.
           03                          PIC X(45)   VALUE
               '001013300012899001013019012599001013510013123'.
           03                          PIC X(45)   VALUE
               '001013845013483001013847013485001013487013099'.
           03                          PIC X(45)   VALUE
               '001013510013124001013675013302001013611013233'.
           03                          PIC X(45)   VALUE
               '001012900012470001013805013441001013308012906'.
           03                          PIC X(45)   VALUE
               '001012918012490001013014012592001013136012722'.
           03                          PIC X(45)   VALUE
               '001013168012757001013055012635001013271012870'.
           03                          PIC X(45)   VALUE
               '001014635014435001013179012770001013750013380'.
           03                          PIC X(45)   VALUE
               '001013724013352001013068012650001014635014635'.
           03                          PIC X(45)   VALUE
               '001014109013767001013031012611001012967012542'.
           03                          PIC X(45)   VALUE
               '001014635014592001012879012448001012963012538'.
           03                          PIC X(45)   VALUE
               '001013467013078001013549013166001013299012898'.
           03                          PIC X(45)   VALUE
               '001013246012839001013246012839001012757012318'.
           03                          PIC X(45)   VALUE
               '001014628014505001012757012318001013089012673'.
           03                          PIC X(45)   VALUE
               '001013550013167001012826012391001013683013310'.
           03                          PIC X(45)   VALUE
               '001014148013807001013796013432001012757012318'.
           03                          PIC X(45)   VALUE
               '001013869013509001013387012991001012757012318'.
           03                          PIC X(45)   VALUE
               '001013296012894001013991013640001012829012395'.
           03                          PIC X(45)   VALUE
               '001013584013203001013458013069001013042012622'.
           03                          PIC X(45)   VALUE
               '001013723013352001012952012526001013293012890'.
           03                          PIC X(45)   VALUE
               '001012878012447001013316012915001013898013539'.
           03                          PIC X(45)   VALUE
               '001014432014252001013196012789001012976012553'.
           03                          PIC X(45)   VALUE
               '001014365014040001013033012613001013423013031'.
           03                          PIC X(45)   VALUE
               '001013450013060001013662013285001014416014112'.
           03                          PIC X(45)   VALUE
               '001013822013457001012955012529001013219012812'.
           03                          PIC X(45)   VALUE
               '001013507013121001013670013296001014409014088'.
           03                          PIC X(45)   VALUE
               '001013127012713001012757012318001012930012503'.
           03                          PIC X(45)   VALUE
               '001014475014204001014635014592001014635014568'.
           03                          PIC X(45)   VALUE
               '001012757012318001013914013558001014064013718'.
           03                          PIC X(45)   VALUE
               '001012981012559001014635014559001013198012790'.
           03                          PIC X(45)   VALUE
               '001012972012548001013366012970001013687013314'.
           03                          PIC X(45)   VALUE
               '001013208012800001012928012501001012757012318'.
           03                          PIC X(45)   VALUE
               '001013323012923001013247012840001013062012644'.
           03                          PIC X(45)   VALUE
               '001013013012592001013838013475001013727013356'.
           03                          PIC X(45)   VALUE
               '001012948012521001013339012939001013791013425'.
           03                          PIC X(45)   VALUE
               '001013146012735001014635014506001014136013977'.
           03                          PIC X(45)   VALUE
               '001013653013276001012991012567001013227012821'.
           03                          PIC X(45)   VALUE
               '001012757012318001013559013175001014091013745'.
           03                          PIC X(45)   VALUE
               '001013589013210001013566013182001013402013007'.
           03                          PIC X(45)   VALUE
               '001013331012930001013386012991001013217012809'.
           03                          PIC X(45)   VALUE
               '001013041012622001014635014618001013912013553'.
           03                          PIC X(45)   VALUE
               '001012757012318001013248012841001014202014048'.
           03                          PIC X(45)   VALUE
               '001012781012343001014174013835001012950012524'.
           03                          PIC X(45)   VALUE
               '001013090012674001013184012775001013183012774'.
           03                          PIC X(45)   VALUE
               '001013667013293001012757012318001013024012604'.
           03                          PIC X(45)   VALUE
               '001013671013297001012874012442001013243012837'.
           03                          PIC X(45)   VALUE
               '001013224012818001013245012839001013725013354'.
           03                          PIC X(15)   VALUE
               '001013702013329'.
       01  W-WART-WART-TABLE REDEFINES W-WART-WART-FILLS.
           03  WWW-ENTRY OCCURS 388 TIMES.
               05  WWW-DTCD            PIC 9(3).
               05  WWW-WART1           PIC 9(4)V9(2).
               05  WWW-WART2           PIC 9(4)V9(2).
