       01  DRG-TABLE.                                                   
           05  D-TAB.                                                   
               10  FILLER                  PIC X(08) VALUE
             '20121001'.
               10  FILLER                  PIC X(56) VALUE
             '26029529400385139131155001971773692820034510883320900255'.
               10  FILLER                  PIC X(56) VALUE
             '10989416000217047178080000890961271470018205111009800114'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000038954080000860484341190014903157608500100'.
               10  FILLER                  PIC X(56) VALUE
             '01956605600065105255186002580000000000000006093217900199'.
               10  FILLER                  PIC X(56) VALUE
             '04581711000142000000000000000000000000000009101614500176'.
               10  FILLER                  PIC X(56) VALUE
             '06640011800135045056065000800523780790011103527904300065'.
               10  FILLER                  PIC X(56) VALUE
             '04595808100105029555053000680216310280003605602809900129'.
               10  FILLER                  PIC X(56) VALUE
             '02927704700064017854024000320426450850012002034803600053'.
               10  FILLER                  PIC X(56) VALUE
             '01438102000026036918047000700219650210003201661001300015'.
               10  FILLER                  PIC X(56) VALUE
             '03187005600083015741024000350102850140001603868008900117'.
               10  FILLER                  PIC X(56) VALUE
             '02133005000064017744026000340000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001490304300058'.
               10  FILLER                  PIC X(56) VALUE
             '00904602900035013962042000570104860320004301719405400071'.
               10  FILLER                  PIC X(56) VALUE
             '00968003600047016472054000700100880390004700780703100036'.
               10  FILLER                  PIC X(56) VALUE
             '02866806000078019551045000520153660320003701842404800066'.
               10  FILLER                  PIC X(56) VALUE
             '01134503700045008135026000310150740410005400889902600032'.
               10  FILLER                  PIC X(56) VALUE
             '00744902200027017056051000680101740370004700750602500030'.
               10  FILLER                  PIC X(56) VALUE
             '01282004100054008837031000400176110550007000894703200039'.
               10  FILLER                  PIC X(56) VALUE
             '01642604800060009790032000400072970240002901261603700052'.
               10  FILLER                  PIC X(56) VALUE
             '00741602700034019249033000560134580340004500869602200027'.
               10  FILLER                  PIC X(56) VALUE
             '02038705000068011874034000430076050220002701568704100053'.
               10  FILLER                  PIC X(56) VALUE
             '00979102700034007218018000220165830430006000921403100040'.
               10  FILLER                  PIC X(56) VALUE
             '00693802300028035656089001150246270630007902015804400055'.
               10  FILLER                  PIC X(56) VALUE
             '03371408900115018418061000770124270410004901557004300058'.
               10  FILLER                  PIC X(56) VALUE
             '00764302600033010209030000410068930230002900000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01858704100056009589022000290124070340004501502203500051'.
               10  FILLER                  PIC X(56) VALUE
             '00723401700023000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00958903900049006533032000390075420220002701188503600049'.
               10  FILLER                  PIC X(56) VALUE
             '00685002500032000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '02150003700054012065023000290234430420006101236202100027'.
               10  FILLER                  PIC X(56) VALUE
             '01781803600054009177018000220200020400005901069701800023'.
               10  FILLER                  PIC X(56) VALUE
             '01319203800050007388019000230089220140001800000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000022347063000910124860390005400748802400032'.
               10  FILLER                  PIC X(56) VALUE
             '00646202100025013890038000520064580220002801016603400044'.
               10  FILLER                  PIC X(56) VALUE
             '00660502500031014138043000570091370320004100634902300028'.
               10  FILLER                  PIC X(56) VALUE
             '01601004700066008988032000410059690210002600000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000511931130013702619105800070'.
               10  FILLER                  PIC X(56) VALUE
             '01792203500041037513091001150200430540006801315303100041'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000158700550006601037903900046'.
               10  FILLER                  PIC X(56) VALUE
             '02054906600082014403053000640097990380004601756705600073'.
               10  FILLER                  PIC X(56) VALUE
             '01210803900051008275027000340148040500006201017103500042'.
               10  FILLER                  PIC X(56) VALUE
             '00696102400029015746049000640111690370004700754402600033'.
               10  FILLER                  PIC X(56) VALUE
             '01246104100052011860043000530095210360004400707202900034'.
               10  FILLER                  PIC X(56) VALUE
             '01489305100063009996039000470070780300003501682005500069'.
               10  FILLER                  PIC X(56) VALUE
             '01120903900048007879029000360189150610007801024203500045'.
               10  FILLER                  PIC X(56) VALUE
             '00679202600033008704033000400062280250003000682202100027'.
               10  FILLER                  PIC X(56) VALUE
             '01380904000053007763025000320536191250014602289905100070'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000001410360850015009519013800164'.
               10  FILLER                  PIC X(56) VALUE
             '06349509000102053429065000740783901030012505243806800075'.
               10  FILLER                  PIC X(56) VALUE
             '04423205100056085506099001200610650440005907675808100100'.
               10  FILLER                  PIC X(56) VALUE
             '05760504000050067354061000870518860210003107081511200134'.
               10  FILLER                  PIC X(56) VALUE
             '04627907100080038111048000560752971030012105715108300091'.
               10  FILLER                  PIC X(56) VALUE
             '07229211900134048413081000870580140920010703777706000065'.
               10  FILLER                  PIC X(56) VALUE
             '05117007100100031863027000390461941110014102653107400091'.
               10  FILLER                  PIC X(56) VALUE
             '01482504700057037314061000780262040370004702062402300028'.
               10  FILLER                  PIC X(56) VALUE
             '04254002900043031566038000520199110200002503000304700064'.
               10  FILLER                  PIC X(56) VALUE
             '01796102300029029988052000710192370220003003022405300078'.
               10  FILLER                  PIC X(56) VALUE
             '02473904400059016609021000270243810670008801593405500068'.
               10  FILLER                  PIC X(56) VALUE
             '00953503200042026945050000650185900250003303662407700105'.
               10  FILLER                  PIC X(56) VALUE
             '01676903400044012343021000270190910380005902667405600083'.
               10  FILLER                  PIC X(56) VALUE
             '02439402500038000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001799904900063'.
               10  FILLER                  PIC X(56) VALUE
             '01096103200040007736021000260175390320005100804201900026'.
               10  FILLER                  PIC X(56) VALUE
             '00535301400017020617049000660107090240003102822907900099'.
               10  FILLER                  PIC X(56) VALUE
             '01814505900072012092041000500151740470006001003403800046'.
               10  FILLER                  PIC X(56) VALUE
             '00675102700032010229042000510064760350004001287801900028'.
               10  FILLER                  PIC X(56) VALUE
             '00645501300015004571011000120141860450005800967903700046'.
               10  FILLER                  PIC X(56) VALUE
             '00667902700034010142029000390057730190002301050303400044'.
               10  FILLER                  PIC X(56) VALUE
             '00618702100026013122040000520078400260003301228503900050'.
               10  FILLER                  PIC X(56) VALUE
             '00809802800035005541020000230052070180002200733902400029'.
               10  FILLER                  PIC X(56) VALUE
             '00561701700021018508049000670095270310004000622402000025'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000056118120001540268110630008201441302500033'.
               10  FILLER                  PIC X(56) VALUE
             '05259912100149025731074000860163610450005004614311200134'.
               10  FILLER                  PIC X(56) VALUE
             '02481406700078016181040000460431461120013402352907000084'.
               10  FILLER                  PIC X(56) VALUE
             '01553804000050032008083001000186750540006401202403000036'.
               10  FILLER                  PIC X(56) VALUE
             '02311604800066013516029000370095470160001903409409000115'.
               10  FILLER                  PIC X(56) VALUE
             '01712305600066011608039000440251690640008601390004200054'.
               10  FILLER                  PIC X(56) VALUE
             '00834302300028025082059000780137550340004400904302000024'.
               10  FILLER                  PIC X(56) VALUE
             '02819206300082015976040000500111720240002903946308900120'.
               10  FILLER                  PIC X(56) VALUE
             '02174705500071013629031000400000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001832705100066'.
               10  FILLER                  PIC X(56) VALUE
             '01066403500042007593025000300202000650008401227504900059'.
               10  FILLER                  PIC X(56) VALUE
             '00840103600043021284063000850127380430005500880902800035'.
               10  FILLER                  PIC X(56) VALUE
             '01781704900063010168034000400070150240002901931105600072'.
               10  FILLER                  PIC X(56) VALUE
             '01113003700046007917028000340133840440005600836502900035'.
               10  FILLER                  PIC X(56) VALUE
             '01907806300083010505041000510078780310003801656405400071'.
               10  FILLER                  PIC X(56) VALUE
             '00921703700046006372027000320118970390005100737502800034'.
               10  FILLER                  PIC X(56) VALUE
             '01666604800066009837035000440067910240003000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '05557511300152027303062000790182800410005003837510300128'.
               10  FILLER                  PIC X(56) VALUE
             '02268006900083016875048000570380400970011702598907000082'.
               10  FILLER                  PIC X(56) VALUE
             '01858204600053035643090001090207280600006901335403700044'.
               10  FILLER                  PIC X(56) VALUE
             '02518906100077017007042000510120500250003003850908700123'.
               10  FILLER                  PIC X(56) VALUE
             '01738104600062013006032000400433081020013602408106300083'.
               10  FILLER                  PIC X(56) VALUE
             '01575603800049000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001679204800063'.
               10  FILLER                  PIC X(56) VALUE
             '00931603400042006343026000320178160540007101193404000052'.
               10  FILLER                  PIC X(56) VALUE
             '00953702800036017844053000720096030370004600679002800033'.
               10  FILLER                  PIC X(56) VALUE
             '01876705100070009545035000440064730260003201603904700062'.
               10  FILLER                  PIC X(56) VALUE
             '01072003500043007583024000300000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '10595210100126077979053000630587050310003609520410600131'.
               10  FILLER                  PIC X(56) VALUE
             '06417105600065049491033000370653900730009103878303100036'.
               10  FILLER                  PIC X(56) VALUE
             '04906206400077033745035000380544431090015102940606500082'.
               10  FILLER                  PIC X(56) VALUE
             '01880203900050050078070000870325160410004602607003100033'.
               10  FILLER                  PIC X(56) VALUE
             '03419606400076020953032000350470750650009002804102500036'.
               10  FILLER                  PIC X(56) VALUE
             '02125401500018035676089001160200710590007401017103000039'.
               10  FILLER                  PIC X(56) VALUE
             '03268108900110022663055000680169220320004103036707200085'.
               10  FILLER                  PIC X(56) VALUE
             '01934504900053015660040000430253140290003502095001900021'.
               10  FILLER                  PIC X(56) VALUE
             '03058308600103020808058000680148630420004901686503500043'.
               10  FILLER                  PIC X(56) VALUE
             '01248602400028018154032000450103540170002103103906700083'.
               10  FILLER                  PIC X(56) VALUE
             '01931004000048013938026000310299770750009801630604000052'.
               10  FILLER                  PIC X(56) VALUE
             '01120202000025021304053000720101060210002603136807800102'.
               10  FILLER                  PIC X(56) VALUE
             '01594004500057010670024000290230060680008701564104800059'.
               10  FILLER                  PIC X(56) VALUE
             '01147802600032013003030000400186890400005601207101800022'.
               10  FILLER                  PIC X(56) VALUE
             '01349402600037022963050000630152220320003801120101900022'.
               10  FILLER                  PIC X(56) VALUE
             '01340903600048008655021000260328310770009701974404600056'.
               10  FILLER                  PIC X(56) VALUE
             '01576702800035000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01472504500061007366030000370127900420005400714603100035'.
               10  FILLER                  PIC X(56) VALUE
             '00863803400040006405024000280199820660008701269205000061'.
               10  FILLER                  PIC X(56) VALUE
             '00977003800048020293063000820117490430005400801203300039'.
               10  FILLER                  PIC X(56) VALUE
             '02478506100087011767041000520075810290003501746505800076'.
               10  FILLER                  PIC X(56) VALUE
             '01168304600056007723031000380163450500006400853303200039'.
               10  FILLER                  PIC X(56) VALUE
             '01208704300056006916029000360123480380005100703902600032'.
               10  FILLER                  PIC X(56) VALUE
             '01561305200065008594035000410187410520007001030003500044'.
               10  FILLER                  PIC X(56) VALUE
             '00611502000025013989044000560074630300003501445904700062'.
               10  FILLER                  PIC X(56) VALUE
             '00938603600045006786026000320000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000024688075000990149690550006701003603900047'.
               10  FILLER                  PIC X(56) VALUE
             '03563708600130024469072000950132660400005304245708500129'.
               10  FILLER                  PIC X(56) VALUE
             '01896303900058011312023000320271860730009601487503700051'.
               10  FILLER                  PIC X(56) VALUE
             '00991602000025011283020000270089920150001701655003700053'.
               10  FILLER                  PIC X(56) VALUE
             '01138101800022000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001463205300069'.
               10  FILLER                  PIC X(56) VALUE
             '00991204400053006782032000390188030590007700888003600045'.
               10  FILLER                  PIC X(56) VALUE
             '01602605400072012280041000550066500230003100996804000050'.
               10  FILLER                  PIC X(56) VALUE
             '00624703000036014883052000650083920360004301329703900053'.
               10  FILLER                  PIC X(56) VALUE
             '00755202600032013936042000600068920280003600000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000023998042000570140360230002704352511500141'.
               10  FILLER                  PIC X(56) VALUE
             '01971606200075011287040000500348760460007301860102500031'.
               10  FILLER                  PIC X(56) VALUE
             '01502601600019035668097001280182210590007300966203600044'.
               10  FILLER                  PIC X(56) VALUE
             '02360604400068012163020000290082170120001403293606800100'.
               10  FILLER                  PIC X(56) VALUE
             '02144006100074012266031000410000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01407004300057008218031000380055580220002701107603400047'.
               10  FILLER                  PIC X(56) VALUE
             '00692002700034011233033000460170940570007101050804000049'.
               10  FILLER                  PIC X(56) VALUE
             '00723302800034000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000003082506000070'.
               10  FILLER                  PIC X(56) VALUE
             '06164913100160031279079000900209130470005603513607300095'.
               10  FILLER                  PIC X(56) VALUE
             '01990404600054014836029000320351920790010801882904400058'.
               10  FILLER                  PIC X(56) VALUE
             '01333502300029029941075001030152950380005201126001600020'.
               10  FILLER                  PIC X(56) VALUE
             '03073709500119016602045000620087600200002602473106700088'.
               10  FILLER                  PIC X(56) VALUE
             '01301503100042008326019000240145130370005200838301800023'.
               10  FILLER                  PIC X(56) VALUE
             '03059106400098021887051000700135580180002500000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000015862049000650099580380004700643202600031'.
               10  FILLER                  PIC X(56) VALUE
             '00889902500035016823054000720104990360004700680502200029'.
               10  FILLER                  PIC X(56) VALUE
             '01178404500055007810032000390156320300004001056301700021'.
               10  FILLER                  PIC X(56) VALUE
             '01416904000052007017020000240129440420005500663902500031'.
               10  FILLER                  PIC X(56) VALUE
             '00824602500032015995052000660099980360004500685402600033'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000181340300004101293601500017'.
               10  FILLER                  PIC X(56) VALUE
             '02008704000064012991015000180196310550007800841802300032'.
               10  FILLER                  PIC X(56) VALUE
             '01323403100044006983016000180191490440006600965601300015'.
               10  FILLER                  PIC X(56) VALUE
             '01726104500062008657022000300000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000016690054000720110660400005100650902000026'.
               10  FILLER                  PIC X(56) VALUE
             '01297604600059007085027000340140140500006300772103300039'.
               10  FILLER                  PIC X(56) VALUE
             '01035703400044006113020000250000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000026652050000710116820190002304414010700130'.
               10  FILLER                  PIC X(56) VALUE
             '02004905400064012853030000340332190680009201568803300042'.
               10  FILLER                  PIC X(56) VALUE
             '01149901800022014157029000390096530170001901557304100059'.
               10  FILLER                  PIC X(56) VALUE
             '00810901800022013850030000440088180150001800977301400017'.
               10  FILLER                  PIC X(56) VALUE
             '02575506100086010675024000300000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000019833059000810109900380005000577702100027'.
               10  FILLER                  PIC X(56) VALUE
             '01694506000078010790044000540071730310003700806202800036'.
               10  FILLER                  PIC X(56) VALUE
             '00495101800022000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01219403800048008586029000310092250250003201830404700058'.
               10  FILLER                  PIC X(56) VALUE
             '01466803300050006489016000200000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000007217026000330057550210002400656502500032'.
               10  FILLER                  PIC X(56) VALUE
             '00877701900023005049021000310049620160001900189601100012'.
               10  FILLER                  PIC X(56) VALUE
             '00668702600038004050018000260000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01503501800018049579179001790338611330013302043108600086'.
               10  FILLER                  PIC X(56) VALUE
             '03478304700047012311034000340016670310003100000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000514960970012702637205500071'.
               10  FILLER                  PIC X(56) VALUE
             '01573603000038036452083001140175760440005801121102300031'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000002090205900078'.
               10  FILLER                  PIC X(56) VALUE
             '01176703700047008490027000340125560370005000787202600034'.
               10  FILLER                  PIC X(56) VALUE
             '01584103600050016794049000660101020350004500691802500031'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000005722812700169'.
               10  FILLER                  PIC X(56) VALUE
             '02306605000069011935022000280453971170014802260306200081'.
               10  FILLER                  PIC X(56) VALUE
             '01271202700038048680109001400217650530006801340902800034'.
               10  FILLER                  PIC X(56) VALUE
             '03033506400096011804025000330000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000051622099001610221330510008301099202800040'.
               10  FILLER                  PIC X(56) VALUE
             '06488116700225027537072001020124120470005603010307700105'.
               10  FILLER                  PIC X(56) VALUE
             '01619204800064010450030000400187190590007901221604300056'.
               10  FILLER                  PIC X(56) VALUE
             '00861202900038024374057000830104470290003500787802400030'.
               10  FILLER                  PIC X(56) VALUE
             '01339604600062000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '05343111300146025583073000880153310350004904812510500140'.
               10  FILLER                  PIC X(56) VALUE
             '02064905800074012534038000470000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000020099057000760098220380004700844302900037'.
               10  FILLER                  PIC X(56) VALUE
             '01518104400062007594028000340258610700009401076203900049'.
               10  FILLER                  PIC X(56) VALUE
             '00741502800035058399126001480188030520006901098804200050'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000002709707500122'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000647402200030'.
               10  FILLER                  PIC X(56) VALUE
             '00635603200043006271031000420136130470008100985003900054'.
               10  FILLER                  PIC X(56) VALUE
             '00953905400074007812038000610094730310004700000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000004278021000300109630920011701527104800067'.
               10  FILLER                  PIC X(56) VALUE
             '00678803200040000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '04347709900149017079050000690098900300004002914507000101'.
               10  FILLER                  PIC X(56) VALUE
             '01263003400046011596024000360385650770010901951904500060'.
               10  FILLER                  PIC X(56) VALUE
             '01205102600033000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01227303800051006998025000310151680370005100504201700021'.
               10  FILLER                  PIC X(56) VALUE
             '01454203600049006304021000270166150440006000969303100040'.
               10  FILLER                  PIC X(56) VALUE
             '00663702200028014305039000570064380220002900000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000001640262250029604791911200153'.
               10  FILLER                  PIC X(56) VALUE
             '02242005200073000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '02374002500053015123040000570134100330005000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000277690620009101810803600053'.
               10  FILLER                  PIC X(56) VALUE
             '01177602100027000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01320408300101012530065000740111310360004800701002700033'.
               10  FILLER                  PIC X(56) VALUE
             '00937202800042005693023000330081050240005900000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000541700810011503637206900084'.
               10  FILLER                  PIC X(56) VALUE
             '06418209900139039004072000910256460470005800000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000284830580008501497504400055'.
               10  FILLER                  PIC X(56) VALUE
             '00960003000036000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '05481512000163026631055000740000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000025943068000960131420480006200841603300041'.
               10  FILLER                  PIC X(56) VALUE
             '01051703500047000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '05027010500137028276060000780171750290003803621710600131'.
               10  FILLER                  PIC X(56) VALUE
             '02089506100082010710025000360333740860011401814105000067'.
               10  FILLER                  PIC X(56) VALUE
             '01015002200030000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
           05  DRGX-TAB REDEFINES D-TAB.                                
               10  DRGX-PERIOD               OCCURS 1                   
                                              INDEXED BY DX5.           
                   15  DRGX-EFF-DATE         PIC X(08).                 
                   15  DRG-DATA              OCCURS 1000                
                                              INDEXED BY DX6.           
                       20  DRG-WT            PIC 9(02)V9(04).           
                       20  DRG-ALOS          PIC 9(02)V9(01).           
                       20  DRG-DAYS-TRIM     PIC 9(02).                 
                       20  DRG-ARITH-ALOS    PIC 9(02)V9(01).           
068000
