       01  DRG-TABLE.
           05  D-TAB.
               10  FILLER                  PIC X(08) VALUE
             '20051001'.
               10  FILLER                  PIC X(56) VALUE
             '03434707600101019587035000460198601270012700000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000007878022000300269780670009701563502000030'.
               10  FILLER                  PIC X(56) VALUE
             '01404504500064012222046000620087360290003800899804300055'.
               10  FILLER                  PIC X(56) VALUE
             '00857504000050012456045000580094210370004601335105000065'.
               10  FILLER                  PIC X(56) VALUE
             '00722902500032009903041000530070770270003502786508000104'.
               10  FILLER                  PIC X(56) VALUE
             '01445104900063011304040000520077120300003900997003600048'.
               10  FILLER                  PIC X(56) VALUE
             '00618002500031018191034000630135310320005201335304400059'.
               10  FILLER                  PIC X(56) VALUE
             '00721202600034003359020000200095670300004000619401900024'.
               10  FILLER                  PIC X(56) VALUE
             '00210901600016010062037000480062410240003000728801300016'.
               10  FILLER                  PIC X(56) VALUE
             '01185802700042006975025000350071080170002400962703000041'.
               10  FILLER                  PIC X(56) VALUE
             '00341901600016007852020000280061410240003100687403900048'.
               10  FILLER                  PIC X(56) VALUE
             '00747402500031007524032000420052030230002900301202900029'.
               10  FILLER                  PIC X(56) VALUE
             '01636103100044008690015000180088090190002800834801500019'.
               10  FILLER                  PIC X(56) VALUE
             '01326902400039004882032000320095970200003100871101800026'.
               10  FILLER                  PIC X(56) VALUE
             '01042802300036002772015000150080820180002600211001500015'.
               10  FILLER                  PIC X(56) VALUE
             '01286703300054002989013000130139830300004501166304100061'.
               10  FILLER                  PIC X(56) VALUE
             '00599102300028005958024000310077250290003700661103200040'.
               10  FILLER                  PIC X(56) VALUE
             '00485002500030004210021000230075240320004000744902600034'.
               10  FILLER                  PIC X(56) VALUE
             '00852703300044003398021000210307320760009902883008400111'.
               10  FILLER                  PIC X(56) VALUE
             '01185703300047012427054000640162380670008500894704400055'.
               10  FILLER                  PIC X(56) VALUE
             '01538306100061013936051000680098280420005300579902600032'.
               10  FILLER                  PIC X(56) VALUE
             '01240504800063006974028000360136540490006400877804000049'.
               10  FILLER                  PIC X(56) VALUE
             '01032004700057006104032000380081240340004401185304800061'.
               10  FILLER                  PIC X(56) VALUE
             '00715003100039011354046000620060350290003600730303600044'.
               10  FILLER                  PIC X(56) VALUE
             '00536402800034005560037000370070940240003100538201700021'.
               10  FILLER                  PIC X(56) VALUE
             '00873303300043005402020000251856172370037708220112700149'.
               10  FILLER                  PIC X(56) VALUE
             '06019208400102070346095001120000001350013505878908600110'.
               10  FILLER                  PIC X(56) VALUE
             '00000012100121038417057000840248400260003400000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '03168210800137017354067000890000001580015800000009300093'.
               10  FILLER                  PIC X(56) VALUE
             '01322302600042016380021000300134560330005502385305900092'.
               10  FILLER                  PIC X(56) VALUE
             '01613605300066009847028000350154070290004801442503300044'.
               10  FILLER                  PIC X(56) VALUE
             '01094802100027027440094001200103450410005200694904400052'.
               10  FILLER                  PIC X(56) VALUE
             '01040401700026009425044000550055660320003900627302200028'.
               10  FILLER                  PIC X(56) VALUE
             '00533701800022006068024000310089170320004300621402200028'.
               10  FILLER                  PIC X(56) VALUE
             '00828803300033008287030000390052270200002400511602000024'.
               10  FILLER                  PIC X(56) VALUE
             '00752102700035005852020000250056590170002101276104100058'.
               10  FILLER                  PIC X(56) VALUE
             '00583502100026026621086001000147810520005803447910000123'.
               10  FILLER                  PIC X(56) VALUE
             '01432405400060028061089001100126410400005101878306700080'.
               10  FILLER                  PIC X(56) VALUE
             '01082104500050040399099001330128890310004100853506000060'.
               10  FILLER                  PIC X(56) VALUE
             '01335604100058006657021000260140810380005100843102200027'.
               10  FILLER                  PIC X(56) VALUE
             '01193103100044006785017000210067230220002902247606600080'.
               10  FILLER                  PIC X(56) VALUE
             '01186803600042014521033000450089290190002201266203300049'.
               10  FILLER                  PIC X(56) VALUE
             '00729701800023029612078001100119050310004101412505100070'.
               10  FILLER                  PIC X(56) VALUE
             '00744302700036010060038000470056460240002901124604100052'.
               10  FILLER                  PIC X(56) VALUE
             '00916603600044007013026000310109110450005900978404200054'.
               10  FILLER                  PIC X(56) VALUE
             '00561402800033008413034000440058480230002900566302500033'.
               10  FILLER                  PIC X(56) VALUE
             '00870203200045003253029000290083630310004201129004200056'.
               10  FILLER                  PIC X(56) VALUE
             '00606402400031006179031000440396800900012901679304300057'.
               10  FILLER                  PIC X(56) VALUE
             '03281809900121015748056000670305300880010601603104900057'.
               10  FILLER                  PIC X(56) VALUE
             '02542507500092011604037000430240730680009502786806500098'.
               10  FILLER                  PIC X(56) VALUE
             '03733909900137013318047000620135520490006501124904200056'.
               10  FILLER                  PIC X(56) VALUE
             '01205904400060007292030000390117460410005300689502300029'.
               10  FILLER                  PIC X(56) VALUE
             '00000017100171019059061000690126900440004701287702400029'.
               10  FILLER                  PIC X(56) VALUE
             '02042807200097000000000000000000000000000001913103300058'.
               10  FILLER                  PIC X(56) VALUE
             '03059609300132016648044000560104430260003100591305300053'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000111640230003200818501600019'.
               10  FILLER                  PIC X(56) VALUE
             '01225103700052015884045000650083110210002601145902800041'.
               10  FILLER                  PIC X(56) VALUE
             '00697601900025013174037000560000000000000000970201800028'.
               10  FILLER                  PIC X(56) VALUE
             '01918404600068012219020000280077680380004800740703800046'.
               10  FILLER                  PIC X(56) VALUE
             '00609003000037014401067000870107670500006201405105000067'.
               10  FILLER                  PIC X(56) VALUE
             '00662903000037011504051000670076580360004500720003600045'.
               10  FILLER                  PIC X(56) VALUE
             '00458302500031005932028000360057950260003300855403800048'.
               10  FILLER                  PIC X(56) VALUE
             '00709502700039006974032000390047490230002800256701800018'.
               10  FILLER                  PIC X(56) VALUE
             '00774703800046004588026000310029900290002900850903900051'.
               10  FILLER                  PIC X(56) VALUE
             '00896702000026007138015000170096710180002800703201200014'.
               10  FILLER                  PIC X(56) VALUE
             '00973201600022009766033000480211300860011401063505000065'.
               10  FILLER                  PIC X(56) VALUE
             '01659304400068008637023000320089620280004201132602400035'.
               10  FILLER                  PIC X(56) VALUE
             '01835206200086008313027000390101950560007100986004500059'.
               10  FILLER                  PIC X(56) VALUE
             '00553902900037011294047000630053400240003300689203500045'.
               10  FILLER                  PIC X(56) VALUE
             '00867604600056005391034000410078220420004200731303200041'.
               10  FILLER                  PIC X(56) VALUE
             '00491302300029002600022000220074230350004600456302400030'.
               10  FILLER                  PIC X(56) VALUE
             '02183108200105019390040000550194700780010402038403200041'.
               10  FILLER                  PIC X(56) VALUE
             '00931501700026008891016000210108770160002802639507300103'.
               10  FILLER                  PIC X(56) VALUE
             '01347203200045007652033000430072670280003700818703700048'.
               10  FILLER                  PIC X(56) VALUE
             '00487902500031005486025000390103290370005201092204600060'.
               10  FILLER                  PIC X(56) VALUE
             '00611802700034031679070000820221830580007402376106100086'.
               10  FILLER                  PIC X(56) VALUE
             '01159502600032012700036000550062020170002101634903900061'.
               10  FILLER                  PIC X(56) VALUE
             '00908501600020011898030000450064320150001901115903200048'.
               10  FILLER                  PIC X(56) VALUE
             '00678301700022005012023000230208230360006801269204900064'.
               10  FILLER                  PIC X(56) VALUE
             '00794202400035011539042000580063850210002800865804200052'.
               10  FILLER                  PIC X(56) VALUE
             '00565203000036005498029000340082140230003100505001600019'.
               10  FILLER                  PIC X(56) VALUE
             '00643602900037004391021000260037480310003100707902600035'.
               10  FILLER                  PIC X(56) VALUE
             '00470101500018003227016000160106190410005500616002400031'.
               10  FILLER                  PIC X(56) VALUE
             '00966903500053014368035000430110040240002700842502500033'.
               10  FILLER                  PIC X(56) VALUE
             '00574701700019013772039000620118660320005100286802400024'.
               10  FILLER                  PIC X(56) VALUE
             '01262201900032008737025000340015590170001701247501700027'.
               10  FILLER                  PIC X(56) VALUE
             '01147203100048010441042000570061040220003100718803200041'.
               10  FILLER                  PIC X(56) VALUE
             '00421001900024007289035000450023920130001300736002900040'.
               10  FILLER                  PIC X(56) VALUE
             '01850404700063015135046000570088240280003100742801700019'.
               10  FILLER                  PIC X(56) VALUE
             '02223706500081011448032000400079480220002400858202000026'.
               10  FILLER                  PIC X(56) VALUE
             '01084702200030003057014000140097280270003800870903000042'.
               10  FILLER                  PIC X(56) VALUE
             '02040805300077012348048000660057280230003001168405200067'.
               10  FILLER                  PIC X(56) VALUE
             '00631002400033008974041000520060660310003400502702500032'.
               10  FILLER                  PIC X(56) VALUE
             '00355602000022006712025000280058370440004400524202600034'.
               10  FILLER                  PIC X(56) VALUE
             '01699602900045007472019000230035780200002800392501600021'.
               10  FILLER                  PIC X(56) VALUE
             '00603401600022002070013000140050530260003700322501800026'.
               10  FILLER                  PIC X(56) VALUE
             '01393001800018045935179001790313721330013301892908600086'.
               10  FILLER                  PIC X(56) VALUE
             '03222604700047011406034000340015440310003103045906500092'.
               10  FILLER                  PIC X(56) VALUE
             '01364509100091019109045000740083280320004300832302600043'.
               10  FILLER                  PIC X(56) VALUE
             '01298603700051012082044000570066740270003300000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '02967808000113011810028000410184320580008100926503000042'.
               10  FILLER                  PIC X(56) VALUE
             '01934604900049027897070000990122890300003802246004800082'.
               10  FILLER                  PIC X(56) VALUE
             '01207404300058011069030000380036350250003300845101800028'.
               10  FILLER                  PIC X(56) VALUE
             '01304805000068007788030000400398901100014801677405600075'.
               10  FILLER                  PIC X(56) VALUE
             '01168903200041010716048000620084530340004400607702700034'.
               10  FILLER                  PIC X(56) VALUE
             '00766403100041006171026000370191960600008402277307300124'.
               10  FILLER                  PIC X(56) VALUE
             '00619102600035004656030000410051350320004700698104600073'.
               10  FILLER                  PIC X(56) VALUE
             '00791904300056006483058000790051780400005900628202900043'.
               10  FILLER                  PIC X(56) VALUE
             '00277602200030000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000193980540008901945705900092'.
               10  FILLER                  PIC X(56) VALUE
             '00938202300034025660060000890099430260003400755603200041'.
               10  FILLER                  PIC X(56) VALUE
             '00503302200028002999024000240055690190002600098702900029'.
               10  FILLER                  PIC X(56) VALUE
             '00852902600037004282016000200026630210002101046203500049'.
               10  FILLER                  PIC X(56) VALUE
             '00528502200028008141029000410047250170002200000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01397403000051008700089001080069600310003900505502400029'.
               10  FILLER                  PIC X(56) VALUE
             '00622402400038007806028000530048030200002704003109700132'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000313910450005100000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '03423107400127000000000000000360910810011302182207400105'.
               10  FILLER                  PIC X(56) VALUE
             '02060705800087000000000000000144340210002808969313700180'.
               10  FILLER                  PIC X(56) VALUE
             '06232118200217033387096001210000000000000005143809300128'.
               10  FILLER                  PIC X(56) VALUE
             '03495208400102047323085001250194590530007304435311800164'.
               10  FILLER                  PIC X(56) VALUE
             '01805805900084010639038000540167800260003103592608800137'.
               10  FILLER                  PIC X(56) VALUE
             '01833304500061010285021000270857361400017306093206400088'.
               10  FILLER                  PIC X(56) VALUE
             '03622405000059027791034000380138310310004300904601800022'.
               10  FILLER                  PIC X(56) VALUE
             '02646208500104014462049000590120380290003811801821700273'.
               10  FILLER                  PIC X(56) VALUE
             '02295302400046040939112001590173690580008501276705100074'.
               10  FILLER                  PIC X(56) VALUE
             '00821703600052011817044000640074240260004105366010700128'.
               10  FILLER                  PIC X(56) VALUE
             '05966908900099000000000000000552050260004300000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000016544018000250246950300004801678801600020'.
               10  FILLER                  PIC X(56) VALUE
             '00693904200056004794077000960037930320003900728802600032'.
               10  FILLER                  PIC X(56) VALUE
             '11428207200136000000000000000000000000000007050513800172'.
               10  FILLER                  PIC X(56) VALUE
             '02316005300083012041024000310312790650009601419502800037'.
               10  FILLER                  PIC X(56) VALUE
             '01576702400038010201015000180797380790010306914405900076'.
               10  FILLER                  PIC X(56) VALUE
             '01836004800069009833021000280327820700010801194002600036'.
               10  FILLER                  PIC X(56) VALUE
             '19803838100457128719291003510441840850012301964304100045'.
               10  FILLER                  PIC X(56) VALUE
             '02482704500052050739071000880619481080012304719808200090'.
               10  FILLER                  PIC X(56) VALUE
             '05098008700103036151062000690310070440006402099602500035'.
               10  FILLER                  PIC X(56) VALUE
             '03095706600097020721040000590243150340004701913201600021'.
               10  FILLER                  PIC X(56) VALUE
             '02871703000041022108015000190224730580007200000000000000'.
           05  DRGX-TAB REDEFINES D-TAB.
               10  DRGX-PERIOD               OCCURS 1
                                              INDEXED BY DX5.
                   15  DRGX-EFF-DATE         PIC X(08).
                   15  DRG-DATA              OCCURS 560
                                              INDEXED BY DX6.
                       20  DRG-WT            PIC 9(02)V9(04).
                       20  DRG-ALOS          PIC 9(02)V9(01).
                       20  DRG-DAYS-TRIM     PIC 9(02).
                       20  DRG-ARITH-ALOS    PIC 9(02)V9(01).
