       01 DRG-TABLE.                                                    
                 05 D-TAB.                                              
                     10 FILLER             PIC X(08) VALUE              
                   '20101001'.                                          
                     10 FILLER             PIC X(56) VALUE              
             '26344131600419136127176002261812393010036611240322200271'.
                     10 FILLER             PIC X(56) VALUE              
             '10177114900199048353083000930933501540018604963210100117'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000037831086000970476661230015503131108500101'.
                     10 FILLER             PIC X(56) VALUE              
             '01950505700068115947211002820595041670019300000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000008247914100173'.
                     10 FILLER             PIC X(56) VALUE              
             '06288612100139041581067000840508830820011803495205700081'.
                     10 FILLER             PIC X(56) VALUE              
             '04757508800115029825058000730213070300003905354910100131'.
                     10 FILLER             PIC X(56) VALUE              
             '02874104700066016433025000330412610860012301922003600053'.
                     10 FILLER             PIC X(56) VALUE              
             '01362602100026035242047000700214370220003201639001300015'.
                     10 FILLER             PIC X(56) VALUE              
             '03154305700084015462024000350101850140001703935309000121'.
                     10 FILLER             PIC X(56) VALUE              
             '02143005000067016905024000320000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000001610904500067'.
                     10 FILLER             PIC X(56) VALUE              
             '00844102900036014863046000630106490350004601674805500071'.
                     10 FILLER             PIC X(56) VALUE              
             '00935003700048015856054000720098110410004900757803200038'.
                     10 FILLER             PIC X(56) VALUE              
             '02956806400084019479048000560152510340003901867405100069'.
                     10 FILLER             PIC X(56) VALUE              
             '01166704000048008198027000330142310420005500875102700033'.
                     10 FILLER             PIC X(56) VALUE              
             '00731102300028018417056000730110540410005100749902500031'.
                     10 FILLER             PIC X(56) VALUE              
             '01290704200056008606032000410165670550007000905003300039'.
                     10 FILLER             PIC X(56) VALUE              
             '01737605100064010154035000440075330260003101190903600049'.
                     10 FILLER             PIC X(56) VALUE              
             '00739202700034020130035000610132640340004700895902200028'.
                     10 FILLER             PIC X(56) VALUE              
             '02142305200072012051037000460079290230002901487204200055'.
                     10 FILLER             PIC X(56) VALUE              
             '00966702900037006927019000230163180440006200940403300042'.
                     10 FILLER             PIC X(56) VALUE              
             '00682702400029036769089001170239770660008401924704600056'.
                     10 FILLER             PIC X(56) VALUE              
             '03219109000116019106064000790120840410005201510704500060'.
                     10 FILLER             PIC X(56) VALUE              
             '00761902800034010288031000430067010240003000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '01831103900056008989020000260120840350004601267503000044'.
                     10 FILLER             PIC X(56) VALUE              
             '00730501600020000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00910404100051006522033000400071440220002701190303800053'.
                     10 FILLER             PIC X(56) VALUE              
             '00685902700034000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '02234903700052012299023000290209150410005601244702100027'.
                     10 FILLER             PIC X(56) VALUE              
             '01700003600054008514017000210190820430006400975101700023'.
                     10 FILLER             PIC X(56) VALUE              
             '01300703600050007841019000250087560140001800000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000021886065000910124130410005700806602400033'.
                     10 FILLER             PIC X(56) VALUE              
             '00638902200026012808037000500063930230002900958403300043'.
                     10 FILLER             PIC X(56) VALUE              
             '00629002500031013965043000580090170330004200622602400029'.
                     10 FILLER             PIC X(56) VALUE              
             '01579404800067009027034000440058970220002700000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000508281150014002623606200074'.
                     10 FILLER             PIC X(56) VALUE              
             '01775803700044037383095001190205670580007401300803300043'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000160960570006801070604200049'.
                     10 FILLER             PIC X(56) VALUE              
             '02066706800085014887056000680098610410005001736105700075'.
                     10 FILLER             PIC X(56) VALUE              
             '01218204200054008096028000370149420520006500975503600043'.
                     10 FILLER             PIC X(56) VALUE              
             '00680302600030015637053000670110270390004900767802800035'.
                     10 FILLER             PIC X(56) VALUE              
             '01280904300055011924045000550097350380004600722003100037'.
                     10 FILLER             PIC X(56) VALUE              
             '01479605300065010152042000500070960310003701606205600069'.
                     10 FILLER             PIC X(56) VALUE              
             '01117604200051008203031000380178950630008001025203700048'.
                     10 FILLER             PIC X(56) VALUE              
             '00721002800036008424034000410060810260003200671402100027'.
                     10 FILLER             PIC X(56) VALUE              
             '01297203900053007575026000330520681260014702263005100070'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000001260860690012210023814600170'.
                     10 FILLER             PIC X(56) VALUE              
             '06803809800109053293072000800808311080013105378707200080'.
                     10 FILLER             PIC X(56) VALUE              
             '04480105600060085230094001180642500450006207581907700097'.
                     10 FILLER             PIC X(56) VALUE              
             '06020204200053064510050000770519360200003107588111800142'.
                     10 FILLER             PIC X(56) VALUE              
             '04774507200083035451046000550785821090012905818308500094'.
                     10 FILLER             PIC X(56) VALUE              
             '07208112100137048281082000890585300930010803770706000065'.
                     10 FILLER             PIC X(56) VALUE              
             '05190307100101030830029000420455441120014302658907800096'.
                     10 FILLER             PIC X(56) VALUE              
             '01463105000060037277063000810265080390004902039802200028'.
                     10 FILLER             PIC X(56) VALUE              
             '04248602500038031802035000500196910180002302924804400060'.
                     10 FILLER             PIC X(56) VALUE              
             '01773202200028028836050000700179920220003002975405200079'.
                     10 FILLER             PIC X(56) VALUE              
             '02401404400060016152020000270250430700009201596905600070'.
                     10 FILLER             PIC X(56) VALUE              
             '00975003400043028880052000700183340240003203550007700107'.
                     10 FILLER             PIC X(56) VALUE              
             '01646903200045011246020000260175650350005602530505500082'.
                     10 FILLER             PIC X(56) VALUE              
             '02315702300034000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000001850305200066'.
                     10 FILLER             PIC X(56) VALUE              
             '01191203600044008064022000280171510320005100888802100030'.
                     10 FILLER             PIC X(56) VALUE              
             '00571201400018020014048000650108790250003202939708600108'.
                     10 FILLER             PIC X(56) VALUE              
             '01849206400078012959044000560149430480006201030204000049'.
                     10 FILLER             PIC X(56) VALUE              
             '00685302800033010373044000540064030340004001169201800028'.
                     10 FILLER             PIC X(56) VALUE              
             '00679201400017004497011000120140720470006100977603900049'.
                     10 FILLER             PIC X(56) VALUE              
             '00661502800035009755030000400058300200002401026303500046'.
                     10 FILLER             PIC X(56) VALUE              
             '00613802200028014667044000590079740270003401233904000052'.
                     10 FILLER             PIC X(56) VALUE              
             '00838703000037005709021000250050700180002200717202400029'.
                     10 FILLER             PIC X(56) VALUE              
             '00549901700021018145050000680096810330004200614702100026'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000058142126001620272310690008801429802900038'.
                     10 FILLER             PIC X(56) VALUE              
             '05280712500154025830078000910162670480005304863511800142'.
                     10 FILLER             PIC X(56) VALUE              
             '02496007100081015979042000490427771140013702345607200088'.
                     10 FILLER             PIC X(56) VALUE              
             '01478904000051032115083001000186590560006501239303200037'.
                     10 FILLER             PIC X(56) VALUE              
             '02264304900066013246030000380095680170002003158608900112'.
                     10 FILLER             PIC X(56) VALUE              
             '01703506000070011883042000460241830630008801370504100054'.
                     10 FILLER             PIC X(56) VALUE              
             '00798102300029024877056000790135390350004500862801900024'.
                     10 FILLER             PIC X(56) VALUE              
             '02751006300084015523040000500103290230002804029309200127'.
                     10 FILLER             PIC X(56) VALUE              
             '02146605700074013010030000400000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000001757805100067'.
                     10 FILLER             PIC X(56) VALUE              
             '01077203700045007546026000310209860680008801293505300065'.
                     10 FILLER             PIC X(56) VALUE              
             '00859903900046020674063000840128010440005800847802800036'.
                     10 FILLER             PIC X(56) VALUE              
             '01754105000064010274035000420071460260003001965605800076'.
                     10 FILLER             PIC X(56) VALUE              
             '01120703900048008130029000350119820420005300832603000036'.
                     10 FILLER             PIC X(56) VALUE              
             '01910206300084010435042000530078130320003901645705500072'.
                     10 FILLER             PIC X(56) VALUE              
             '00934403900048006369028000330115500390005100717302800034'.
                     10 FILLER             PIC X(56) VALUE              
             '01659304900068009939037000470067490250003100000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '05574312000158027791065000840186650420005203936811000135'.
                     10 FILLER             PIC X(56) VALUE              
             '02487507400089016114049000580368180990011802491207000083'.
                     10 FILLER             PIC X(56) VALUE              
             '01718004500054036675093001140208970620007301308003700044'.
                     10 FILLER             PIC X(56) VALUE              
             '02502906200078016996044000540116980240003003644309200130'.
                     10 FILLER             PIC X(56) VALUE              
             '01891005100070012742030000410445771090014402433507100091'.
                     10 FILLER             PIC X(56) VALUE              
             '01627304400057000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000001700105000065'.
                     10 FILLER             PIC X(56) VALUE              
             '00954803600046006152025000320180180560007401221504200055'.
                     10 FILLER             PIC X(56) VALUE              
             '00900402800037018342054000750100890400005000689002900035'.
                     10 FILLER             PIC X(56) VALUE              
             '01824205100071009857037000480066150270003301558604800062'.
                     10 FILLER             PIC X(56) VALUE              
             '01068803600045007411025000310000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '10265310700135072559055000670543080310003709288510800134'.
                     10 FILLER             PIC X(56) VALUE              
             '06202405900070049379035000400650650740009103871303300039'.
                     10 FILLER             PIC X(56) VALUE              
             '04938506700082033425037000410499831100015102852806900089'.
                     10 FILLER             PIC X(56) VALUE              
             '01790504100053049144073000900323210430005002572803300036'.
                     10 FILLER             PIC X(56) VALUE              
             '03472406700080021039034000370473010660009302772202600038'.
                     10 FILLER             PIC X(56) VALUE              
             '02076801500018034905091001190195940610007700992003200041'.
                     10 FILLER             PIC X(56) VALUE              
             '03328608900111022546053000680163670240003403093907700090'.
                     10 FILLER             PIC X(56) VALUE              
             '01888605100056015372041000450240190300003701955402000022'.
                     10 FILLER             PIC X(56) VALUE              
             '03213109000110020339061000720147240440005101721703800047'.
                     10 FILLER             PIC X(56) VALUE              
             '01214102500029017916030000430099140170002103067006800086'.
                     10 FILLER             PIC X(56) VALUE              
             '01851904200050013140027000320286830760010201620704100054'.
                     10 FILLER             PIC X(56) VALUE              
             '01077002000026019912054000730099170220003003028807600103'.
                     10 FILLER             PIC X(56) VALUE              
             '01584604600060010305023000280228090650008501568505000062'.
                     10 FILLER             PIC X(56) VALUE              
             '01077002500031011815027000380187110340004501395601700021'.
                     10 FILLER             PIC X(56) VALUE              
             '01314802300035021704050000630146900320003901046101800021'.
                     10 FILLER             PIC X(56) VALUE              
             '01300703500048008209021000270318940770009801924404700059'.
                     10 FILLER             PIC X(56) VALUE              
             '01479702600034000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '01565704900065007601031000390135270450005800719103200037'.
                     10 FILLER             PIC X(56) VALUE              
             '00827503500041006108026000310204670710009401312605400068'.
                     10 FILLER             PIC X(56) VALUE              
             '00871303700047019521063000830115970450005600777503400041'.
                     10 FILLER             PIC X(56) VALUE              
             '02546706400090011712042000540073480290003601964806700088'.
                     10 FILLER             PIC X(56) VALUE              
             '01203504800061008276033000400163980520006800820403300040'.
                     10 FILLER             PIC X(56) VALUE              
             '01135504300055006812030000370109540360004900656802600032'.
                     10 FILLER             PIC X(56) VALUE              
             '01602105400068008823036000440177170520007201002203600046'.
                     10 FILLER             PIC X(56) VALUE              
             '00621102100026013944045000580071530300003601470204900065'.
                     10 FILLER             PIC X(56) VALUE              
             '00909503800047006625028000340000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '03246109100125018675067000850108990420005203924809100130'.
                     10 FILLER             PIC X(56) VALUE              
             '01703504100062010416024000330295760770010401495903800054'.
                     10 FILLER             PIC X(56) VALUE              
             '00922301800024010567020000270084540150001701515303500050'.
                     10 FILLER             PIC X(56) VALUE              
             '01041101700022000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000001766906200082'.
                     10 FILLER             PIC X(56) VALUE              
             '01070904800058007591036000460186900590007800877903700046'.
                     10 FILLER             PIC X(56) VALUE              
             '01559605500075010611041000540062650250003200960204100049'.
                     10 FILLER             PIC X(56) VALUE              
             '00672803000036014748053000670083770380004501236103900052'.
                     10 FILLER             PIC X(56) VALUE              
             '00718202700033013082043000600068570280003700000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000024554047000650139700250003004493412400156'.
                     10 FILLER             PIC X(56) VALUE              
             '02000606500079012006041000510352140460007401862702600034'.
                     10 FILLER             PIC X(56) VALUE              
             '01474701600019034166094001250185580610007601012203800047'.
                     10 FILLER             PIC X(56) VALUE              
             '02242304600069011701021000300078210120001403381907200106'.
                     10 FILLER             PIC X(56) VALUE              
             '02265006500080014164034000450000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '01446204500059008306032000400055440230002801140003600051'.
                     10 FILLER             PIC X(56) VALUE              
             '00691602900036010290034000470181590600007601065504200052'.
                     10 FILLER             PIC X(56) VALUE              
             '00719802900036000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000003044206300074'.
                     10 FILLER             PIC X(56) VALUE              
             '06092913600166030054082000930195670480005603571307700100'.
                     10 FILLER             PIC X(56) VALUE              
             '02000404900059014224030000340349880790010801903004500060'.
                     10 FILLER             PIC X(56) VALUE              
             '01264102400029030158075001070147180360005201107401500019'.
                     10 FILLER             PIC X(56) VALUE              
             '02865308700113016440045000640079190180002402517506600089'.
                     10 FILLER             PIC X(56) VALUE              
             '01259703200044007770018000230144000410005600788501800022'.
                     10 FILLER             PIC X(56) VALUE              
             '02926005900095020934046000670133790160002100000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000016407051000680102430400004900658702800034'.
                     10 FILLER             PIC X(56) VALUE              
             '00894402500034018238058000780108380380005000647902200028'.
                     10 FILLER             PIC X(56) VALUE              
             '01218504600058007864034000410161560330004301118601800023'.
                     10 FILLER             PIC X(56) VALUE              
             '01350503900052007096021000260120820430005700659002600032'.
                     10 FILLER             PIC X(56) VALUE              
             '00777102400031016098052000680099990370004700675702600032'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000177470320004201258101600019'.
                     10 FILLER             PIC X(56) VALUE              
             '01863003400057012712014000170176390520007300808402100027'.
                     10 FILLER             PIC X(56) VALUE              
             '01180202900041006544016000180174330410006000997401200014'.
                     10 FILLER             PIC X(56) VALUE              
             '01613804600064008044020000260000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000016891054000770101900390005100621102100027'.
                     10 FILLER             PIC X(56) VALUE              
             '01274204700061007013028000350136570490006400761203300041'.
                     10 FILLER             PIC X(56) VALUE              
             '00989203600047006414023000290000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000024364052000700116840220002704394311500140'.
                     10 FILLER             PIC X(56) VALUE              
             '02037505700066012324032000360343000740009801528003800047'.
                     10 FILLER             PIC X(56) VALUE              
             '01097902200026013883032000410090790180002101515104000055'.
                     10 FILLER             PIC X(56) VALUE              
             '00804502000024013373030000420088520150001800916901400017'.
                     10 FILLER             PIC X(56) VALUE              
             '02527506200085009368022000280000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000020295064000880114440400005300636102300031'.
                     10 FILLER             PIC X(56) VALUE              
             '01656506000078010963047000570073680330004000838802900038'.
                     10 FILLER             PIC X(56) VALUE              
             '00521901800022000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '01126903900049007995029000310091110240002701811204700058'.
                     10 FILLER             PIC X(56) VALUE              
             '02063103500057007017016000210000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000006848026000320052560210002300651302600034'.
                     10 FILLER             PIC X(56) VALUE              
             '00740601700021004942021000320053110160002100228401200016'.
                     10 FILLER             PIC X(56) VALUE              
             '00680902700039004744019000260000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '01487701800018049058179001790335051330013302021608600086'.
                     10 FILLER             PIC X(56) VALUE              
             '03441704700047012181034000340016490310003100000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000494341040013502587405900075'.
                     10 FILLER             PIC X(56) VALUE              
             '01558603100039036171085001210189050480006501044602300030'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000002147906300082'.
                     10 FILLER             PIC X(56) VALUE              
             '01195104000051009230030000370125440380005200795702800036'.
                     10 FILLER             PIC X(56) VALUE              
             '01437203600050016431050000690100240360004600681802600032'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000005711213100172'.
                     10 FILLER             PIC X(56) VALUE              
             '02399805300074012253023000310456401220015902305506600087'.
                     10 FILLER             PIC X(56) VALUE              
             '01241802800040048666112001470214590530006901386103100038'.
                     10 FILLER             PIC X(56) VALUE              
             '02709306300094010976024000320000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000049277101001620242840570009201138603000045'.
                     10 FILLER             PIC X(56) VALUE              
             '06659917800235031428081001220128230460005702931707800106'.
                     10 FILLER             PIC X(56) VALUE              
             '01637605100068010389032000420183630600008001194004300056'.
                     10 FILLER             PIC X(56) VALUE              
             '00802902900037021961054000800098600280003400807802400030'.
                     10 FILLER             PIC X(56) VALUE              
             '01262704400061000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '05523712000156027883082001000137970390005305129611200150'.
                     10 FILLER             PIC X(56) VALUE              
             '02097506200079013050041000510000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000019511058000770097900400004900827603000038'.
                     10 FILLER             PIC X(56) VALUE              
             '01565104500065007462028000350247080670009201161404300054'.
                     10 FILLER             PIC X(56) VALUE              
             '00720703000036058305128001510190740540007201154504500054'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000002814308100127'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000616102300030'.
                     10 FILLER             PIC X(56) VALUE              
             '00617803100042006276031000430106940490007700930804000053'.
                     10 FILLER             PIC X(56) VALUE              
             '00904105400074007903038000590078880290004100000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000004074021000300102750850010901456504700065'.
                     10 FILLER             PIC X(56) VALUE              
             '00651303200040000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '03904209100140017922054000750106240330004402933507200109'.
                     10 FILLER             PIC X(56) VALUE              
             '01171403400045010356021000310382680780011101925104700063'.
                     10 FILLER             PIC X(56) VALUE              
             '01155402600034000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '01344404000056006994026000320142520360005100486701700021'.
                     10 FILLER             PIC X(56) VALUE              
             '01486803700051006269021000270159030440006200978503200043'.
                     10 FILLER             PIC X(56) VALUE              
             '00621602200028013478038000540068080230003200000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000001266512180028504772410800148'.
                     10 FILLER             PIC X(56) VALUE              
             '02055705200077000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '02197902300051013556041000580129190350005200000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000287020690010001679703600054'.
                     10 FILLER             PIC X(56) VALUE              
             '01145702000026000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '01279508200101011273066000750109520370004900686502700034'.
                     10 FILLER             PIC X(56) VALUE              
             '01000602600044005040022000280065930220004000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000553360890012603370407000085'.
                     10 FILLER             PIC X(56) VALUE              
             '06251910100142037692075000960232080470005900000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000281230600008701490104500056'.
                     10 FILLER             PIC X(56) VALUE              
             '00938603100038000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '05507312000171026755063000860000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000025849068000960136400510006600897503500044'.
                     10 FILLER             PIC X(56) VALUE              
             '01048603700049000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '05063411000141029402068000870177670310004303324210500133'.
                     10 FILLER             PIC X(56) VALUE              
             '02150806800090011140027000400344950930012101873905600074'.
                     10 FILLER             PIC X(56) VALUE              
             '01058902500035000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                     10 FILLER             PIC X(56) VALUE              
             '00000000000000000000000000000000000000000000000000000000'.
                 05 DRGX-TAB REDEFINES D-TAB.                           
                     10 DRGX-PERIOD          OCCURS 1                   
                                                    INDEXED BY DX5.     
                         15 DRGX-EFF-DATE    PIC X(08).                 
                         15 DRG-DATA         OCCURS 1000                
                                                    INDEXED BY DX6.     
                             20 DRG-WT       PIC 9(02)V9(04).           
                             20 DRG-ALOS     PIC 9(02)V9(01).           
                             20 DRG-DAYS-TRIM PIC 9(02).                
                             20 DRG-ARITH-ALOS PIC 9(02)V9(01).         
