       01  DRG-TABLE.
           05  D-TAB.
               10  FILLER                  PIC X(08) VALUE
             '20061001'.
               10  FILLER                  PIC X(56) VALUE
             '03465107300098019525034000440201131270012700000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000007910021000310266090650009401595302000028'.
               10  FILLER                  PIC X(56) VALUE
             '01364704400062012556046000600085920270003600932204300055'.
               10  FILLER                  PIC X(56) VALUE
             '00854104000049012118043000550094420310004001357905000065'.
               10  FILLER                  PIC X(56) VALUE
             '00714102400030010038041000520071940270003400000007600076'.
               10  FILLER                  PIC X(56) VALUE
             '01413004700062011652039000500080150300003900000005600056'.
               10  FILLER                  PIC X(56) VALUE
             '00000004900049010076027000380134990310004701335704200057'.
               10  FILLER                  PIC X(56) VALUE
             '00740102600032003402020000200097960300003900640801900023'.
               10  FILLER                  PIC X(56) VALUE
             '00213601600016010175036000480065870250003100805601400019'.
               10  FILLER                  PIC X(56) VALUE
             '01206402700041006195022000280064610160002101030903100042'.
               10  FILLER                  PIC X(56) VALUE
             '00346201600016007717017000250061920240003000718603800048'.
               10  FILLER                  PIC X(56) VALUE
             '00743402500030007915032000420055200240003000305002900029'.
               10  FILLER                  PIC X(56) VALUE
             '01668403200045008800015000190087880190002700649801300015'.
               10  FILLER                  PIC X(56) VALUE
             '01354002500040004944032000320096520190002900893601900027'.
               10  FILLER                  PIC X(56) VALUE
             '00997502100033002807015000150068120180002400213701500015'.
               10  FILLER                  PIC X(56) VALUE
             '01598703700061003027013000130139590300004501249804200062'.
               10  FILLER                  PIC X(56) VALUE
             '00615902300028006280024000310082420280003700660503200039'.
               10  FILLER                  PIC X(56) VALUE
             '00491002500030003579021000240077580340004400778402600033'.
               10  FILLER                  PIC X(56) VALUE
             '00850003300043003441021000210303500740009702838608200107'.
               10  FILLER                  PIC X(56) VALUE
             '01188603300045012357053000620162680670008300894304300053'.
               10  FILLER                  PIC X(56) VALUE
             '01557906100061014121051000680103080420005300602802600031'.
               10  FILLER                  PIC X(56) VALUE
             '01245904700062007132027000350138380490006400887804000049'.
               10  FILLER                  PIC X(56) VALUE
             '01037604600056006148032000370055980250003401197904800060'.
               10  FILLER                  PIC X(56) VALUE
             '00743703000038011474045000590058710270003400735003500043'.
               10  FILLER                  PIC X(56) VALUE
             '00542902800034005870028000310071550240003100541101700021'.
               10  FILLER                  PIC X(56) VALUE
             '00861403200042005622020000251886532220035408290312800151'.
               10  FILLER                  PIC X(56) VALUE
             '06056708400102067383093001090000001350013505754408800109'.
               10  FILLER                  PIC X(56) VALUE
             '00000012100121038064054000810248790230003100000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '03264610800137017527066000870000001580015800000009300093'.
               10  FILLER                  PIC X(56) VALUE
             '01371302600043016687020000300145540330005402417306000092'.
               10  FILLER                  PIC X(56) VALUE
             '01616605200065009621027000340149020290004701409903300044'.
               10  FILLER                  PIC X(56) VALUE
             '01053002100027026653090001120104900410005200749904400052'.
               10  FILLER                  PIC X(56) VALUE
             '01011801600025009712043000550057550310003700631802200028'.
               10  FILLER                  PIC X(56) VALUE
             '00549401800021006189025000310094050330004300658002100027'.
               10  FILLER                  PIC X(56) VALUE
             '00839303300033008365030000390052970200002400504101900024'.
               10  FILLER                  PIC X(56) VALUE
             '00763302700034006012021000250056370170002101338104300059'.
               10  FILLER                  PIC X(56) VALUE
             '00583402000026027431084000990151240490005600000017000170'.
               10  FILLER                  PIC X(56) VALUE
             '01435705100057027871087001080128630400005001885906500079'.
               10  FILLER                  PIC X(56) VALUE
             '01098304400049000000148001480129480300004000864406000060'.
               10  FILLER                  PIC X(56) VALUE
             '01343004100058006577021000270143160370005100867502200027'.
               10  FILLER                  PIC X(56) VALUE
             '01240303200045006916017000210068090210002102147406400077'.
               10  FILLER                  PIC X(56) VALUE
             '01184303400040014035032000430090010180002101282703300048'.
               10  FILLER                  PIC X(56) VALUE
             '00767901800023029921078001090122420310004201429305100069'.
               10  FILLER                  PIC X(56) VALUE
             '00764502700036010296038000470058080240002901127504000051'.
               10  FILLER                  PIC X(56) VALUE
             '00933303600044006900026000310108040450005800993004100053'.
               10  FILLER                  PIC X(56) VALUE
             '00578402800033007853032000410058410230002800619202500037'.
               10  FILLER                  PIC X(56) VALUE
             '00888603300045003294029000290084210310004201093104000054'.
               10  FILLER                  PIC X(56) VALUE
             '00591602400030006351023000300393840880012501674004200055'.
               10  FILLER                  PIC X(56) VALUE
             '03383110100126015879054000630305010880010601541204500053'.
               10  FILLER                  PIC X(56) VALUE
             '02551807400091011781037000430223500640009002840206500104'.
               10  FILLER                  PIC X(56) VALUE
             '03790510000136013396046000620136720480006501098904100054'.
               10  FILLER                  PIC X(56) VALUE
             '01201304400059007287030000380118390410005300689002400030'.
               10  FILLER                  PIC X(56) VALUE
             '00000017100171019022059000670129390430004600916402200025'.
               10  FILLER                  PIC X(56) VALUE
             '02117407100095000000000000000000000000000001874403100054'.
               10  FILLER                  PIC X(56) VALUE
             '03049909000129017053044000550110330270003200598805300053'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000117260240003300857401600019'.
               10  FILLER                  PIC X(56) VALUE
             '01277503800054016340046000650086180210002601152802900042'.
               10  FILLER                  PIC X(56) VALUE
             '00720802000025013385036000540000000000000000973201900027'.
               10  FILLER                  PIC X(56) VALUE
             '01903304300064012565019000270082260380004800768803800045'.
               10  FILLER                  PIC X(56) VALUE
             '00657303000038014100065000830112030490006201380704900065'.
               10  FILLER                  PIC X(56) VALUE
             '00663703000037011045051000650079700360004500739403600045'.
               10  FILLER                  PIC X(56) VALUE
             '00494302500031006311028000360059340260003300887603800048'.
               10  FILLER                  PIC X(56) VALUE
             '00750602800040007230032000390051220230002800260001800018'.
               10  FILLER                  PIC X(56) VALUE
             '00818003800046004978026000310030280290002900871403900050'.
               10  FILLER                  PIC X(56) VALUE
             '00912302000026007130015000170100600180002800681901200014'.
               10  FILLER                  PIC X(56) VALUE
             '00953501600022009621033000470212300830011101098004900064'.
               10  FILLER                  PIC X(56) VALUE
             '01695104200067009136023000300094440290004201221902400036'.
               10  FILLER                  PIC X(56) VALUE
             '01792006000083008209027000360107630560007101035604500059'.
               10  FILLER                  PIC X(56) VALUE
             '00585302900037011315045000620059540240003300743003600046'.
               10  FILLER                  PIC X(56) VALUE
             '00895804500055005649034000400079220420004200771603200040'.
               10  FILLER                  PIC X(56) VALUE
             '00520702300028002633022000220076050340004600458402300029'.
               10  FILLER                  PIC X(56) VALUE
             '02177408100103019098038000520195070760009901913002900037'.
               10  FILLER                  PIC X(56) VALUE
             '00924501600024008806015000200058490130001502698507300102'.
               10  FILLER                  PIC X(56) VALUE
             '01391203500048007869033000430076550280003700833403600047'.
               10  FILLER                  PIC X(56) VALUE
             '00509002500030005753025000350104900370005101119304600059'.
               10  FILLER                  PIC X(56) VALUE
             '00620902700034031152067000790197760500006302347305800083'.
               10  FILLER                  PIC X(56) VALUE
             '01152002500030013390036000560064110170002001459403300053'.
               10  FILLER                  PIC X(56) VALUE
             '00902201400017012131031000450065520150001901176703300049'.
               10  FILLER                  PIC X(56) VALUE
             '00746501800024005076023000230211730370006801260204800063'.
               10  FILLER                  PIC X(56) VALUE
             '00806702400035012376044000600060840190002600876904100051'.
               10  FILLER                  PIC X(56) VALUE
             '00579303000036006160031000360082590230003100504901600018'.
               10  FILLER                  PIC X(56) VALUE
             '00690402900037004544021000260021090180002000729402600034'.
               10  FILLER                  PIC X(56) VALUE
             '00519801400017003268016000160109600420005500625502400031'.
               10  FILLER                  PIC X(56) VALUE
             '01017003700054014202033000400111740220002500857602400032'.
               10  FILLER                  PIC X(56) VALUE
             '00587701600018013797038000580125530330005200290402400024'.
               10  FILLER                  PIC X(56) VALUE
             '01341901900032008103023000300015790170001701212401700027'.
               10  FILLER                  PIC X(56) VALUE
             '01298703400054010716045000590053850200002700742903100040'.
               10  FILLER                  PIC X(56) VALUE
             '00461502100026007748036000450024220130001300781903000042'.
               10  FILLER                  PIC X(56) VALUE
             '01819204500060014966045000560090740280003000757101600019'.
               10  FILLER                  PIC X(56) VALUE
             '02225006400080011418031000390080530210002300881102000025'.
               10  FILLER                  PIC X(56) VALUE
             '01062602100029003096014000140110280290004200893602700038'.
               10  FILLER                  PIC X(56) VALUE
             '02050805300079012466046000630058650230003001169705000064'.
               10  FILLER                  PIC X(56) VALUE
             '00659802500033009002041000500065650310003400566002600034'.
               10  FILLER                  PIC X(56) VALUE
             '00391102100022006505024000300112520410006500615002500033'.
               10  FILLER                  PIC X(56) VALUE
             '01245703200045007163018000220041380220003300443001500020'.
               10  FILLER                  PIC X(56) VALUE
             '00707001700025001817013000150051030260003700379001700026'.
               10  FILLER                  PIC X(56) VALUE
             '01410701800018046519179001790317711330013301917008600086'.
               10  FILLER                  PIC X(56) VALUE
             '03263604700047011551034000340015640310003103020206300089'.
               10  FILLER                  PIC X(56) VALUE
             '01381909100091019299045000730079920310004100665402600031'.
               10  FILLER                  PIC X(56) VALUE
             '01326703700051011269041000550067200260003200000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '02965208100113011612028000390186250570008000922403000041'.
               10  FILLER                  PIC X(56) VALUE
             '01959204900049027201067000940115450280003502165105100082'.
               10  FILLER                  PIC X(56) VALUE
             '01294804500060010908029000380036810470004700855902000020'.
               10  FILLER                  PIC X(56) VALUE
             '01334705000067007678030000410000001510015100000009200092'.
               10  FILLER                  PIC X(56) VALUE
             '01884105200065010993047000610086140340004400595702600032'.
               10  FILLER                  PIC X(56) VALUE
             '00774703100040006176026000370183790600008202248707400115'.
               10  FILLER                  PIC X(56) VALUE
             '00629902600035005122031000430055800310004600779704500073'.
               10  FILLER                  PIC X(56) VALUE
             '00838804300056007261058000790067290420006700661102700040'.
               10  FILLER                  PIC X(56) VALUE
             '00328402100028000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000190710540008301929105600085'.
               10  FILLER                  PIC X(56) VALUE
             '00992002300034025533060000890104980270003500779503200041'.
               10  FILLER                  PIC X(56) VALUE
             '00530102300028003037024000240057380190002600100002900029'.
               10  FILLER                  PIC X(56) VALUE
             '00873202700037004420016000200026970210002101068603500050'.
               10  FILLER                  PIC X(56) VALUE
             '00529702200028008616030000410048640180002300000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01570703300056009460084001000071580310003900527102400029'.
               10  FILLER                  PIC X(56) VALUE
             '00595402400035007634027000490047590190002703992509600130'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000304240410004600000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '03362307300127000000000000000000000000000002165406900099'.
               10  FILLER                  PIC X(56) VALUE
             '02091005900087000000000000000144010190002609409614000191'.
               10  FILLER                  PIC X(56) VALUE
             '06392918700220033490094001180000000000000005096708500128'.
               10  FILLER                  PIC X(56) VALUE
             '03504808100100048346085001230189300520007005129812200177'.
               10  FILLER                  PIC X(56) VALUE
             '01792105800082010408039000530172030250003003489208900138'.
               10  FILLER                  PIC X(56) VALUE
             '01828004600060010320021000270841821420017306378206400088'.
               10  FILLER                  PIC X(56) VALUE
             '03819204800057029896033000370138870300004200922301800022'.
               10  FILLER                  PIC X(56) VALUE
             '02642708400104014274049000580124500310003911252420700280'.
               10  FILLER                  PIC X(56) VALUE
             '02633002800069037856108001520193280540007701415705300074'.
               10  FILLER                  PIC X(56) VALUE
             '00834703700053012477041000610068190260003606258811100136'.
               10  FILLER                  PIC X(56) VALUE
             '03977108900106000000000000000522930220003800000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000016388018000250254390290004701756901600019'.
               10  FILLER                  PIC X(56) VALUE
             '00733804000053005993080001040041960310003800737302600031'.
               10  FILLER                  PIC X(56) VALUE
             '12226807700143000000000000000000000000000007062613300164'.
               10  FILLER                  PIC X(56) VALUE
             '02173704600074012186023000290311690640009301457702800037'.
               10  FILLER                  PIC X(56) VALUE
             '01546302400037009926014000170737410690009306604305500073'.
               10  FILLER                  PIC X(56) VALUE
             '01836004700066010282022000290319070680010601175902600035'.
               10  FILLER                  PIC X(56) VALUE
             '19255137000443116440272003260435570790011601987804000044'.
               10  FILLER                  PIC X(56) VALUE
             '02533704400052053812070000880613901090012404644008100089'.
               10  FILLER                  PIC X(56) VALUE
             '05024608600102035904062000680303640420006102086002500035'.
               10  FILLER                  PIC X(56) VALUE
             '03012406200092020773037000560230660340004801774701600020'.
               10  FILLER                  PIC X(56) VALUE
             '02761603000041020814015000180225240540006902906608200106'.
               10  FILLER                  PIC X(56) VALUE
             '02218707400095010586037000490064400260003200693102600034'.
               10  FILLER                  PIC X(56) VALUE
             '05243013400158023355056000780522101270016003366608300115'.
               10  FILLER                  PIC X(56) VALUE
             '04342711900146026997084001010111090380004801337805600071'.
               10  FILLER                  PIC X(56) VALUE
             '03348909100111012703043000570597141320016001599605500073'.
               10  FILLER                  PIC X(56) VALUE
             '01785901600023048650127001660284080840011500000000000000'.
           05  DRGX-TAB REDEFINES D-TAB.
               10  DRGX-PERIOD               OCCURS 1
                                              INDEXED BY DX5.
                   15  DRGX-EFF-DATE         PIC X(08).
                   15  DRG-DATA              OCCURS 580
                                              INDEXED BY DX6.
                       20  DRG-WT            PIC 9(02)V9(04).
                       20  DRG-ALOS          PIC 9(02)V9(01).
                       20  DRG-DAYS-TRIM     PIC 9(02).
                       20  DRG-ARITH-ALOS    PIC 9(02)V9(01).
