       01  DRG-TABLE.                                                   
           05  D-TAB.                                                   
               10  FILLER                  PIC X(08) VALUE
             '20111001'.
               10  FILLER                  PIC X(56) VALUE
             '24279428600374139700167002131799272910035310925121400260'.
               10  FILLER                  PIC X(56) VALUE
             '10481415900209051059082000940987101540018905117610100120'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000038900085000990499671210015203095708500100'.
               10  FILLER                  PIC X(56) VALUE
             '01898305600064102792180002480000000000000006312718100198'.
               10  FILLER                  PIC X(56) VALUE
             '04322411600146000000000000000000000000000008503313400168'.
               10  FILLER                  PIC X(56) VALUE
             '06436912600143041500056000760536250840011703632705400075'.
               10  FILLER                  PIC X(56) VALUE
             '04692708500109029770055000700213170290003705647610100130'.
               10  FILLER                  PIC X(56) VALUE
             '02830804500062016924024000310445290870012501949103500052'.
               10  FILLER                  PIC X(56) VALUE
             '01408502000026035003045000690214590210003101655001300015'.
               10  FILLER                  PIC X(56) VALUE
             '03084505600080015804024000350103050140001704033108900120'.
               10  FILLER                  PIC X(56) VALUE
             '02177505100066017442025000330000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001539004300057'.
               10  FILLER                  PIC X(56) VALUE
             '00855402700033014680044000600107600330004501765605500073'.
               10  FILLER                  PIC X(56) VALUE
             '00965203800049015223053000680101810400004800761803100037'.
               10  FILLER                  PIC X(56) VALUE
             '02880406200080019506046000540153610330003801855504900068'.
               10  FILLER                  PIC X(56) VALUE
             '01148503800046008105026000310144750420005400890102600032'.
               10  FILLER                  PIC X(56) VALUE
             '00734702200027018030053000700105780390004900723702400030'.
               10  FILLER                  PIC X(56) VALUE
             '01295504100054008644032000400171960540006800875103200038'.
               10  FILLER                  PIC X(56) VALUE
             '01658704700060010200035000420072180240002901186503600049'.
               10  FILLER                  PIC X(56) VALUE
             '00737402600033020265035000600135670350004600842202100026'.
               10  FILLER                  PIC X(56) VALUE
             '02148305200072011759035000440078340230002801617704100054'.
               10  FILLER                  PIC X(56) VALUE
             '00980902800036007297019000230162380430005900924703200040'.
               10  FILLER                  PIC X(56) VALUE
             '00675102200028034244087001150237620620007701906904500056'.
               10  FILLER                  PIC X(56) VALUE
             '03213908700111018279060000760122990400005101525404300058'.
               10  FILLER                  PIC X(56) VALUE
             '00762002700033010129031000430066770230002900000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01884104300057009275020000260122460330004401298203000045'.
               10  FILLER                  PIC X(56) VALUE
             '00765701800024000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01044004100053006304031000370071350210002601170203600051'.
               10  FILLER                  PIC X(56) VALUE
             '00691802500032000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '02214303700054011858023000280225580410005701197402100027'.
               10  FILLER                  PIC X(56) VALUE
             '01724103700054008722017000210199630430006501011401700023'.
               10  FILLER                  PIC X(56) VALUE
             '01316003800050007784018000240090090140001700000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000020669059000840122680410005600752102200032'.
               10  FILLER                  PIC X(56) VALUE
             '00635002100025013103038000520066010230002800957003200041'.
               10  FILLER                  PIC X(56) VALUE
             '00629602400030014235042000560089850320004100619202300028'.
               10  FILLER                  PIC X(56) VALUE
             '01609204900067008971032000420058010210002600000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000509101140013902602905900071'.
               10  FILLER                  PIC X(56) VALUE
             '01785403600043037322092001170205750560007101279103200042'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000162120560006701048504000047'.
               10  FILLER                  PIC X(56) VALUE
             '02065306700083014653054000650100250400004801740305600073'.
               10  FILLER                  PIC X(56) VALUE
             '01223704000053008446027000360146950510006201008603500043'.
               10  FILLER                  PIC X(56) VALUE
             '00701302500030015824051000660111230370004800769902700034'.
               10  FILLER                  PIC X(56) VALUE
             '01269404200053011684044000530096280370004500708103000035'.
               10  FILLER                  PIC X(56) VALUE
             '01494805200064010026040000480070370300003601657105600070'.
               10  FILLER                  PIC X(56) VALUE
             '01094304000049007839029000360181450610007800989203500045'.
               10  FILLER                  PIC X(56) VALUE
             '00712102700035008519033000410061330260003100656402100026'.
               10  FILLER                  PIC X(56) VALUE
             '01332403900053007565025000320529331260014702270405000070'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000001376290750013409692214100167'.
               10  FILLER                  PIC X(56) VALUE
             '06498709400106051734070000780808151040012805260206900076'.
               10  FILLER                  PIC X(56) VALUE
             '04366305200057086807098001200633090450006207715408000099'.
               10  FILLER                  PIC X(56) VALUE
             '05951104100051067895060000870515000210003107344511200135'.
               10  FILLER                  PIC X(56) VALUE
             '04655207200081036603046000540790841080012805669008000088'.
               10  FILLER                  PIC X(56) VALUE
             '07141811800133048314082000880590630930010803772006000065'.
               10  FILLER                  PIC X(56) VALUE
             '05122107100102030979028000400474011120014302606307500092'.
               10  FILLER                  PIC X(56) VALUE
             '01493904800058036835061000780263630380004802053802300028'.
               10  FILLER                  PIC X(56) VALUE
             '04196702700039031727036000510198280190002402939604500061'.
               10  FILLER                  PIC X(56) VALUE
             '01813202300029028921050000680184470220002902986505100077'.
               10  FILLER                  PIC X(56) VALUE
             '02443204400060016521021000270251920670009001603505600069'.
               10  FILLER                  PIC X(56) VALUE
             '00907103100041029714053000700182170250003303629707600105'.
               10  FILLER                  PIC X(56) VALUE
             '01675003200043011756021000260162260320004802558005400080'.
               10  FILLER                  PIC X(56) VALUE
             '02313302400035000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001790105000063'.
               10  FILLER                  PIC X(56) VALUE
             '01147803400042007856022000270171180320005000840002000028'.
               10  FILLER                  PIC X(56) VALUE
             '00540101400017020360049000650107430240003102865408300103'.
               10  FILLER                  PIC X(56) VALUE
             '01850206100074011141041000500150100470006101021403900047'.
               10  FILLER                  PIC X(56) VALUE
             '00675602700032009916044000530069920350004101289501900030'.
               10  FILLER                  PIC X(56) VALUE
             '00657401300016004048011000110137190460005800969703800047'.
               10  FILLER                  PIC X(56) VALUE
             '00664602800034010029030000400057370190002400979703200042'.
               10  FILLER                  PIC X(56) VALUE
             '00613002100026013321040000530077320260003201228304000051'.
               10  FILLER                  PIC X(56) VALUE
             '00815502900036005608020000240050670180002200713902300029'.
               10  FILLER                  PIC X(56) VALUE
             '00543401700020018386050000680096120320004100606802100025'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000056803122001550274700670008601384802600035'.
               10  FILLER                  PIC X(56) VALUE
             '05321512300151025911076000890162540460005104869111200137'.
               10  FILLER                  PIC X(56) VALUE
             '02475806800079016038041000480428761130013602339207100086'.
               10  FILLER                  PIC X(56) VALUE
             '01495604000050032639083001010184840540006301230803200037'.
               10  FILLER                  PIC X(56) VALUE
             '02357005000068013477029000370095870170001903274008800112'.
               10  FILLER                  PIC X(56) VALUE
             '01698605700067011679040000450253300640008801403104100054'.
               10  FILLER                  PIC X(56) VALUE
             '00807502200028025207059000790138370350004500862501900023'.
               10  FILLER                  PIC X(56) VALUE
             '02843306300083015691039000490107430230002803962809000120'.
               10  FILLER                  PIC X(56) VALUE
             '02183805600072013062030000390000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001852605100066'.
               10  FILLER                  PIC X(56) VALUE
             '01088203600044007469025000310203640660008501281105100062'.
               10  FILLER                  PIC X(56) VALUE
             '00843703700044020951062000840128510430005600871502800036'.
               10  FILLER                  PIC X(56) VALUE
             '01764004900063010238034000410070670250002901885505500071'.
               10  FILLER                  PIC X(56) VALUE
             '01131103800046008023027000330125090420005200847403000036'.
               10  FILLER                  PIC X(56) VALUE
             '01852506100080010598041000520077470320003901660305400071'.
               10  FILLER                  PIC X(56) VALUE
             '00934503800047006399028000330118440390005100724102700034'.
               10  FILLER                  PIC X(56) VALUE
             '01675004800067009898036000450066430250003000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '05716711600155026577062000790185570400005104019710500131'.
               10  FILLER                  PIC X(56) VALUE
             '02312006800082015243046000550358210970011702398506700078'.
               10  FILLER                  PIC X(56) VALUE
             '01740904300051036689091001100206370610007001358803700044'.
               10  FILLER                  PIC X(56) VALUE
             '02531906200078016909043000520118140250003003810808600117'.
               10  FILLER                  PIC X(56) VALUE
             '01908104900066012324029000370419921030013702441106900089'.
               10  FILLER                  PIC X(56) VALUE
             '01702403700050000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001673704800064'.
               10  FILLER                  PIC X(56) VALUE
             '00942403500044006084024000290179500550007101196504100052'.
               10  FILLER                  PIC X(56) VALUE
             '00930902700036017781053000730098640390004800677202800034'.
               10  FILLER                  PIC X(56) VALUE
             '01887305200071009596036000460065430260003301608304700062'.
               10  FILLER                  PIC X(56) VALUE
             '01067803500044007222024000290000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '10919310500132073268053000630564490310003609815210600133'.
               10  FILLER                  PIC X(56) VALUE
             '06342505800067050565034000390649200720008903858003200038'.
               10  FILLER                  PIC X(56) VALUE
             '05398506700086033359036000390504381100014702965806700085'.
               10  FILLER                  PIC X(56) VALUE
             '01740603900048049812072000880324370420004802570003200034'.
               10  FILLER                  PIC X(56) VALUE
             '03441806500077020866033000360454440640008902790602600038'.
               10  FILLER                  PIC X(56) VALUE
             '02081201500018036088089001180197280580007401055803200040'.
               10  FILLER                  PIC X(56) VALUE
             '03459609000112022781054000690168270290003803055707400088'.
               10  FILLER                  PIC X(56) VALUE
             '01909305000054015498040000440240120290003601993901900021'.
               10  FILLER                  PIC X(56) VALUE
             '03142508700107020641060000700149250440005001718403700045'.
               10  FILLER                  PIC X(56) VALUE
             '01228402400028017987030000420100670170002103049806700083'.
               10  FILLER                  PIC X(56) VALUE
             '01877104000048013518026000310289910750009901640304000052'.
               10  FILLER                  PIC X(56) VALUE
             '01090801900025020297052000710094120210002703169608000108'.
               10  FILLER                  PIC X(56) VALUE
             '01570404500058010373023000280230220650008401545705000061'.
               10  FILLER                  PIC X(56) VALUE
             '01129702500032011621025000350187300390005401207401700021'.
               10  FILLER                  PIC X(56) VALUE
             '01398602600038022506049000640150090310003801078101800022'.
               10  FILLER                  PIC X(56) VALUE
             '01327603600048008295021000260323360770009801980104700058'.
               10  FILLER                  PIC X(56) VALUE
             '01555602700034000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01614804600063007553031000380132670430005500725603100036'.
               10  FILLER                  PIC X(56) VALUE
             '00842203400040006270026000310199030670008701337305200064'.
               10  FILLER                  PIC X(56) VALUE
             '00880603700048020419063000820117190440005500766003300039'.
               10  FILLER                  PIC X(56) VALUE
             '02473706000085011849041000520074350290003501886106500082'.
               10  FILLER                  PIC X(56) VALUE
             '01240004700059007363033000400167510520006700841003300039'.
               10  FILLER                  PIC X(56) VALUE
             '01190304400055006994029000360118240360004900668802500031'.
               10  FILLER                  PIC X(56) VALUE
             '01533905300065008979036000430188390520007001023403500045'.
               10  FILLER                  PIC X(56) VALUE
             '00610402000025014004045000580073920300003501480304800063'.
               10  FILLER                  PIC X(56) VALUE
             '00949803800047006371026000320000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000025158076001010154270570006900987203900047'.
               10  FILLER                  PIC X(56) VALUE
             '03424908400125026984077001080122710400005203493607100107'.
               10  FILLER                  PIC X(56) VALUE
             '01811803900058010684023000310269350730009701480103600051'.
               10  FILLER                  PIC X(56) VALUE
             '00949701800024011504021000270087620150001701648803700053'.
               10  FILLER                  PIC X(56) VALUE
             '01100401700022000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001475305400070'.
               10  FILLER                  PIC X(56) VALUE
             '01027904400054006981033000410196360570007900892403600046'.
               10  FILLER                  PIC X(56) VALUE
             '01659005500075011630039000540067980240003400978803900049'.
               10  FILLER                  PIC X(56) VALUE
             '00608602800034014597052000650084440370004401302504000054'.
               10  FILLER                  PIC X(56) VALUE
             '00738802600032013600043000590069520280003600000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000024580045000610143190240002804393311700145'.
               10  FILLER                  PIC X(56) VALUE
             '02018806300077011616036000490349530450007601838402500031'.
               10  FILLER                  PIC X(56) VALUE
             '01483501600019038339100001390185420600007600996503500043'.
               10  FILLER                  PIC X(56) VALUE
             '02258704400065011682020000290080080120001403252606800098'.
               10  FILLER                  PIC X(56) VALUE
             '02207706300078013128032000430000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01439804400058008167031000390055030220002701112503400048'.
               10  FILLER                  PIC X(56) VALUE
             '00698802800035011212035000480170570560007101058304000050'.
               10  FILLER                  PIC X(56) VALUE
             '00725202800035000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000003050706000071'.
               10  FILLER                  PIC X(56) VALUE
             '05924913300161030568080000920199340460005503635907500099'.
               10  FILLER                  PIC X(56) VALUE
             '02012704700056014698029000330346340790010801885104400059'.
               10  FILLER                  PIC X(56) VALUE
             '01302002300028029733076001020147910360005101126901500019'.
               10  FILLER                  PIC X(56) VALUE
             '03377509500122015904044000630081280180002302551206600089'.
               10  FILLER                  PIC X(56) VALUE
             '01270203100042007806018000220148000380005400844301800023'.
               10  FILLER                  PIC X(56) VALUE
             '02987506200095021338048000670134250170002400000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000016410050000670101830390004800640902700032'.
               10  FILLER                  PIC X(56) VALUE
             '00890502500034017795056000780104580370004800648202100027'.
               10  FILLER                  PIC X(56) VALUE
             '01199704500056007870033000400152890300004001090301700020'.
               10  FILLER                  PIC X(56) VALUE
             '01350503900051007090020000250126080420005600644902500031'.
               10  FILLER                  PIC X(56) VALUE
             '00809902400032016066052000660099980360004500678302600032'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000182490320004301275701600018'.
               10  FILLER                  PIC X(56) VALUE
             '01929903600059012640014000170189780500007300790102000027'.
               10  FILLER                  PIC X(56) VALUE
             '01205602900041006710016000180175560400005900870401200014'.
               10  FILLER                  PIC X(56) VALUE
             '01634804400061008146020000250000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000015734052000710101780390005000672402100028'.
               10  FILLER                  PIC X(56) VALUE
             '01245704600060007279028000350142440510006500784803300041'.
               10  FILLER                  PIC X(56) VALUE
             '01090303600050006256022000280000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000024618050000690122080210002504527610600131'.
               10  FILLER                  PIC X(56) VALUE
             '02022105600065012170031000350336720730009901543103500043'.
               10  FILLER                  PIC X(56) VALUE
             '01120102000023014262030000400093060180002001478503900055'.
               10  FILLER                  PIC X(56) VALUE
             '00795601900023012993028000400090380150001700944701400017'.
               10  FILLER                  PIC X(56) VALUE
             '02528306200085010799022000290000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000020512064000880115600390005200620202200030'.
               10  FILLER                  PIC X(56) VALUE
             '01558505900074010657046000550073240320004000789202800036'.
               10  FILLER                  PIC X(56) VALUE
             '00515001800023000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01225504000052008497029000300085470230002601818004700058'.
               10  FILLER                  PIC X(56) VALUE
             '01525903400049006353015000190000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000007406027000340052830210002300643602500033'.
               10  FILLER                  PIC X(56) VALUE
             '00813301700020004646019000270051340170002200194701200013'.
               10  FILLER                  PIC X(56) VALUE
             '00667402600038003175015000180000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01493301800018049243179001790336311330013302029308600086'.
               10  FILLER                  PIC X(56) VALUE
             '03454704700047012227034000340016560310003100000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000502010980013002537505700072'.
               10  FILLER                  PIC X(56) VALUE
             '01513803100039034676084001150172770450005901029302200029'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000002090706000079'.
               10  FILLER                  PIC X(56) VALUE
             '01211403900050008718028000350121820370005000792002700035'.
               10  FILLER                  PIC X(56) VALUE
             '01509803600050016769050000670098110350004500718702600032'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000006071713100172'.
               10  FILLER                  PIC X(56) VALUE
             '02366605000071012183023000300445981190015502319306400084'.
               10  FILLER                  PIC X(56) VALUE
             '01276202900041050537111001420226580550007201308202700034'.
               10  FILLER                  PIC X(56) VALUE
             '02856006600098011616023000310000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000053606105001700236400530008901096702900043'.
               10  FILLER                  PIC X(56) VALUE
             '06505517500229032689081001210126230470005603035007800108'.
               10  FILLER                  PIC X(56) VALUE
             '01634205000066010133031000410188990580007801175004200054'.
               10  FILLER                  PIC X(56) VALUE
             '00796602800036022853056000800101460280003400764302300029'.
               10  FILLER                  PIC X(56) VALUE
             '01312704300058000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '05466811600150026551078000940160080380005504958810900145'.
               10  FILLER                  PIC X(56) VALUE
             '02072606000076013212041000500000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000019223057000750099430390004800833703000037'.
               10  FILLER                  PIC X(56) VALUE
             '01580904400062007446028000350255230690009301081604000050'.
               10  FILLER                  PIC X(56) VALUE
             '00672402800034058339127001490190900530007001133904300052'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000002831907600123'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000633702300030'.
               10  FILLER                  PIC X(56) VALUE
             '00615603200042006566033000460118640480007900952904000053'.
               10  FILLER                  PIC X(56) VALUE
             '00920905400073007466039000570081890290004500000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000004304021000300109520920011901455504700064'.
               10  FILLER                  PIC X(56) VALUE
             '00668703200040000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '04103009200144017938054000750105620310004103105707000107'.
               10  FILLER                  PIC X(56) VALUE
             '01170203400045010566023000330396610780011301929804600060'.
               10  FILLER                  PIC X(56) VALUE
             '01161202500033000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01245803900052007097025000320146000350005000483601700021'.
               10  FILLER                  PIC X(56) VALUE
             '01497703600051006228021000270162820440006100962903100041'.
               10  FILLER                  PIC X(56) VALUE
             '00633202200028014748039000570067410230003000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000001210332000027304890910900153'.
               10  FILLER                  PIC X(56) VALUE
             '02177904900072000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '02285002600054013998040000570125720320004800000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000306560690010301767803500052'.
               10  FILLER                  PIC X(56) VALUE
             '01149202000026000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01331208300100012889068000760113090370004900692302700034'.
               10  FILLER                  PIC X(56) VALUE
             '00950502800045005175023000330072450210004700000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000545290820011703632206900085'.
               10  FILLER                  PIC X(56) VALUE
             '06601710000145037491075000920247110450005700000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000282940590008501516504400055'.
               10  FILLER                  PIC X(56) VALUE
             '01011403000037000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '05615812800172023655058000830000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000027063069000980134550490006400864903400043'.
               10  FILLER                  PIC X(56) VALUE
             '01078303600049000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '05067310800139029352063000810174040300004103529410800139'.
               10  FILLER                  PIC X(56) VALUE
             '02124006400087010980026000380340390890011701856705300070'.
               10  FILLER                  PIC X(56) VALUE
             '01058302400033000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
           05  DRGX-TAB REDEFINES D-TAB.                                
               10  DRGX-PERIOD               OCCURS 1                   
                                              INDEXED BY DX5.           
                   15  DRGX-EFF-DATE         PIC X(08).                 
                   15  DRG-DATA              OCCURS 1000                
                                              INDEXED BY DX6.           
                       20  DRG-WT            PIC 9(02)V9(04).           
                       20  DRG-ALOS          PIC 9(02)V9(01).           
                       20  DRG-DAYS-TRIM     PIC 9(02).                 
                       20  DRG-ARITH-ALOS    PIC 9(02)V9(01).           
068000
