       01  DRG-TABLE.
           05  D-TAB.
               10  FILLER                  PIC X(08) VALUE
             '20071001'.
               10  FILLER                  PIC X(56) VALUE
             '23111730800456162735161002281877073340040611421923800293'.
               10  FILLER                  PIC X(56) VALUE
             '10612017600235072562091001050840021460017305172610100118'.
               10  FILLER                  PIC X(56) VALUE
             '06484218100217038902092001050414821290016203247208900109'.
               10  FILLER                  PIC X(56) VALUE
             '02676006100072000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000007707315200191'.
               10  FILLER                  PIC X(56) VALUE
             '06702113400155056085078000960470360900012803897806100089'.
               10  FILLER                  PIC X(56) VALUE
             '04236210300133031582065000820232590350004604233910800147'.
               10  FILLER                  PIC X(56) VALUE
             '02835605300073017617028000370322260920013201934203800058'.
               10  FILLER                  PIC X(56) VALUE
             '01428102300031025438048000730189960200002901697701300016'.
               10  FILLER                  PIC X(56) VALUE
             '02263006000087014686025000370109090150001803255010000136'.
               10  FILLER                  PIC X(56) VALUE
             '02359505400073018710025000360000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001432904700070'.
               10  FILLER                  PIC X(56) VALUE
             '01117203100040014228053000720112130380005001282005800078'.
               10  FILLER                  PIC X(56) VALUE
             '00895103900049012669058000800092260430005200816003400041'.
               10  FILLER                  PIC X(56) VALUE
             '02554107300096020886053000630186420390004501547005600076'.
               10  FILLER                  PIC X(56) VALUE
             '01190104300053010303031000380121940470006200913102800036'.
               10  FILLER                  PIC X(56) VALUE
             '00733902500031016212060000790125220450005600958602900037'.
               10  FILLER                  PIC X(56) VALUE
             '01171704800064008954034000440153690600007601143903400042'.
               10  FILLER                  PIC X(56) VALUE
             '01461105600072010996037000460098390280003400901403600049'.
               10  FILLER                  PIC X(56) VALUE
             '00716102700034016724039000640133280370005201110602300031'.
               10  FILLER                  PIC X(56) VALUE
             '01694605700079012337040000510092350260003401296804300061'.
               10  FILLER                  PIC X(56) VALUE
             '00947903000038007405020000250132420470006600952903500044'.
               10  FILLER                  PIC X(56) VALUE
             '00771002600032031499097001250256790720009102348204900062'.
               10  FILLER                  PIC X(56) VALUE
             '02666509300118020568068000850181770510006301250004700063'.
               10  FILLER                  PIC X(56) VALUE
             '00825802900037008710036000510066770250003200000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01414103800055010292020000270111850330004500889102200034'.
               10  FILLER                  PIC X(56) VALUE
             '00709401500019000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00880004600058006608033000410072240240002900930803900053'.
               10  FILLER                  PIC X(56) VALUE
             '00679202700035000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01799203700051013987024000320163000400005801205402100026'.
               10  FILLER                  PIC X(56) VALUE
             '01433103700058009474017000210153180430006401109401800026'.
               10  FILLER                  PIC X(56) VALUE
             '01267703700054008474019000240084700140001800000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000017734071001030121820420005801007002500035'.
               10  FILLER                  PIC X(56) VALUE
             '00615402200027009916040000550062270230002900816003700047'.
               10  FILLER                  PIC X(56) VALUE
             '00620702800034011294048000650086300350004500741202500032'.
               10  FILLER                  PIC X(56) VALUE
             '01190905000069008653034000440073610240003100000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000404521220015002808106900083'.
               10  FILLER                  PIC X(56) VALUE
             '02410604500054032677101001300241510650008101818104000054'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000141520610007401158004700055'.
               10  FILLER                  PIC X(56) VALUE
             '01844407200092015636060000740127540460005601555006100080'.
               10  FILLER                  PIC X(56) VALUE
             '01312604500060011455033000430126640570007200961103800046'.
               10  FILLER                  PIC X(56) VALUE
             '00729802700033014542058000750119470420005500974503200041'.
               10  FILLER                  PIC X(56) VALUE
             '01366004800062011138051000650094050420005100814503400040'.
               10  FILLER                  PIC X(56) VALUE
             '01250505500069010235045000530083980350004101378105800073'.
               10  FILLER                  PIC X(56) VALUE
             '01145804400054009654035000430146990660008501075303900051'.
               10  FILLER                  PIC X(56) VALUE
             '00858803200041007841036000450062520290003500665802200029'.
               10  FILLER                  PIC X(56) VALUE
             '01063604200056007848027000350512311260015002246305200073'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000001200160630012009304015900187'.
               10  FILLER                  PIC X(56) VALUE
             '07581310900122068595083000910720721170014505727807600086'.
               10  FILLER                  PIC X(56) VALUE
             '05246306000064080234108001330688090500006607317809200115'.
               10  FILLER                  PIC X(56) VALUE
             '06295604500057059123062000940504110180002806740012000146'.
               10  FILLER                  PIC X(56) VALUE
             '05319107900090047847056000660729931080013206194708000090'.
               10  FILLER                  PIC X(56) VALUE
             '06449612400143049216082000890513810970011503730706100066'.
               10  FILLER                  PIC X(56) VALUE
             '04495407800112031891034000490394541210015602998308400105'.
               10  FILLER                  PIC X(56) VALUE
             '02470905700069032586069000890254830380005102136702200029'.
               10  FILLER                  PIC X(56) VALUE
             '03107302100033029046037000550212550170002202518004300062'.
               10  FILLER                  PIC X(56) VALUE
             '01812401900025024870053000750174800210003002756405600088'.
               10  FILLER                  PIC X(56) VALUE
             '02253604100060016786020000280214860730009901684705800075'.
               10  FILLER                  PIC X(56) VALUE
             '01399003700049022926055000760165530190002602162507200102'.
               10  FILLER                  PIC X(56) VALUE
             '01321202800039011245019000250149770350005502484005900090'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001739105900075'.
               10  FILLER                  PIC X(56) VALUE
             '01312604000049010617026000320157870340005501207402300035'.
               10  FILLER                  PIC X(56) VALUE
             '01042101600022016667052000710114120250003202914309600122'.
               10  FILLER                  PIC X(56) VALUE
             '02307507100087019733052000660125850510006601013404100050'.
               10  FILLER                  PIC X(56) VALUE
             '00876503100037008665046000550069500380004401114402000033'.
               10  FILLER                  PIC X(56) VALUE
             '00849001500019007207012000140122200520006900945104100051'.
               10  FILLER                  PIC X(56) VALUE
             '00718303100038008236033000440060550210002600831203900052'.
               10  FILLER                  PIC X(56) VALUE
             '00594202300029012007045000650082240270003501084104300058'.
               10  FILLER                  PIC X(56) VALUE
             '00823303100039006439023000280051180190002300719702500032'.
               10  FILLER                  PIC X(56) VALUE
             '00548901700021015606051000710117200350004600907502400030'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000051660134001720329410810010301801703300044'.
               10  FILLER                  PIC X(56) VALUE
             '04505912800159028935084000980184150540006003713912200147'.
               10  FILLER                  PIC X(56) VALUE
             '02578707800089017856049000560347851180014402477607700093'.
               10  FILLER                  PIC X(56) VALUE
             '01698404400057027254091001090198050610007101384903600043'.
               10  FILLER                  PIC X(56) VALUE
             '01882405300073013562034000430098870190002302515609400120'.
               10  FILLER                  PIC X(56) VALUE
             '01702806200072012617044000500176580620008401278104100055'.
               10  FILLER                  PIC X(56) VALUE
             '00862902400030018330059000810124490340004500896701900024'.
               10  FILLER                  PIC X(56) VALUE
             '02024106600088014092040000510101470230002903379009600133'.
               10  FILLER                  PIC X(56) VALUE
             '02494606100080017333034000460000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001378805100066'.
               10  FILLER                  PIC X(56) VALUE
             '01083903700046009558028000340162630660008801305905500068'.
               10  FILLER                  PIC X(56) VALUE
             '01110904200050017229065000880133370460006001026803100041'.
               10  FILLER                  PIC X(56) VALUE
             '01336705000065010195037000450084760290003401433405500072'.
               10  FILLER                  PIC X(56) VALUE
             '01130204200051009662030000360110240460005900839903200038'.
               10  FILLER                  PIC X(56) VALUE
             '01493606700090010766046000570094880360004401286005500074'.
               10  FILLER                  PIC X(56) VALUE
             '00953304000050007260030000360095650410005500712102800035'.
               10  FILLER                  PIC X(56) VALUE
             '01323705000070010257038000490078740270003400000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '04827312800173033149071000950224430420005503854012200151'.
               10  FILLER                  PIC X(56) VALUE
             '02912608200099020794057000680341281090013102638207600088'.
               10  FILLER                  PIC X(56) VALUE
             '01941205200060030942097001190227490660007701539804100049'.
               10  FILLER                  PIC X(56) VALUE
             '02136106600084017104045000560124000250003203485110100142'.
               10  FILLER                  PIC X(56) VALUE
             '02255705600078019432034000450395931140015503010407800102'.
               10  FILLER                  PIC X(56) VALUE
             '02581204500056000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001503305100069'.
               10  FILLER                  PIC X(56) VALUE
             '01143103800049010125028000360156610580007701290604500059'.
               10  FILLER                  PIC X(56) VALUE
             '01170903300044014201056000770106090430005400891203200039'.
               10  FILLER                  PIC X(56) VALUE
             '01397305100070010935040000510090790310003801374405000066'.
               10  FILLER                  PIC X(56) VALUE
             '01103003800048008521026000330000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '08431312700159065810068000840570230410004706766912100159'.
               10  FILLER                  PIC X(56) VALUE
             '05465006400078049437041000460486790780009603487003800043'.
               10  FILLER                  PIC X(56) VALUE
             '03834506900085030993039000430396151230016902882107800104'.
               10  FILLER                  PIC X(56) VALUE
             '02341704600062035408076000950275230480005602454503700040'.
               10  FILLER                  PIC X(56) VALUE
             '02666407100084019871037000400347230700010102481902900043'.
               10  FILLER                  PIC X(56) VALUE
             '01944601600020028432095001250213080660008601679903800050'.
               10  FILLER                  PIC X(56) VALUE
             '02655509600125019836048000680167840190002802402708000095'.
               10  FILLER                  PIC X(56) VALUE
             '01848505400060015644045000490199050350004401737602200025'.
               10  FILLER                  PIC X(56) VALUE
             '02936210200124023382068000810177710500005801658404100051'.
               10  FILLER                  PIC X(56) VALUE
             '01451202700031014912033000470100660180002302241306900087'.
               10  FILLER                  PIC X(56) VALUE
             '01718604400053012752028000340257650830011101779204600060'.
               10  FILLER                  PIC X(56) VALUE
             '01230102300031017563058000820118870230003102409608100113'.
               10  FILLER                  PIC X(56) VALUE
             '01559804400059010342023000290175380690008901405805000064'.
               10  FILLER                  PIC X(56) VALUE
             '01158402600034010877023000320142960360005201133001700020'.
               10  FILLER                  PIC X(56) VALUE
             '01076901900028016616050000660125120310003900960201700021'.
               10  FILLER                  PIC X(56) VALUE
             '01174803700051008313020000260248580810010901830704400060'.
               10  FILLER                  PIC X(56) VALUE
             '01419202000029000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01129405100069007560032000400108360480006400734003400040'.
               10  FILLER                  PIC X(56) VALUE
             '00752803800047005986026000310176480770010201402605800072'.
               10  FILLER                  PIC X(56) VALUE
             '01210104400057014877068000870111510480006000939503700045'.
               10  FILLER                  PIC X(56) VALUE
             '01833006500090012092043000550090540320003901537207000093'.
               10  FILLER                  PIC X(56) VALUE
             '01152205000062009567036000450116320550007200783903400042'.
               10  FILLER                  PIC X(56) VALUE
             '00919904800061006475030000370078860360004900595802500032'.
               10  FILLER                  PIC X(56) VALUE
             '01217105400069008480035000430121040510007300852103600047'.
               10  FILLER                  PIC X(56) VALUE
             '00675302100027011163050000650069810310003701160605300071'.
               10  FILLER                  PIC X(56) VALUE
             '00900304000051007790029000370000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '02748310100138020177072000950142160470005902476607800121'.
               10  FILLER                  PIC X(56) VALUE
             '01626204100060010742025000340230930810011101425603600055'.
               10  FILLER                  PIC X(56) VALUE
             '00912401900026009432021000290075230160001801248403700057'.
               10  FILLER                  PIC X(56) VALUE
             '00906601700022000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001455506600089'.
               10  FILLER                  PIC X(56) VALUE
             '01106005200065009335039000490139970600008200876603800048'.
               10  FILLER                  PIC X(56) VALUE
             '01403405900082010695042000560072320260003600847104100054'.
               10  FILLER                  PIC X(56) VALUE
             '00671503100038011522055000700080870390004700968104100054'.
               10  FILLER                  PIC X(56) VALUE
             '00686302800035009223042000590065050290003800000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000021978052000730165020280003403144912600156'.
               10  FILLER                  PIC X(56) VALUE
             '02207107200090017554049000610276250640009301929403400042'.
               10  FILLER                  PIC X(56) VALUE
             '01687602100024027257097001320200650680008701605604600059'.
               10  FILLER                  PIC X(56) VALUE
             '01592805000075010183022000330081690130001503060207800118'.
               10  FILLER                  PIC X(56) VALUE
             '02473007000088017767037000510000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01089104600062008021034000430067420250003100979304100056'.
               10  FILLER                  PIC X(56) VALUE
             '00724803100039010616038000530139260600007801063804300054'.
               10  FILLER                  PIC X(56) VALUE
             '00831003200039000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000003065406600079'.
               10  FILLER                  PIC X(56) VALUE
             '04571013300168031860088001010270750580006602660308400108'.
               10  FILLER                  PIC X(56) VALUE
             '01899705100061016556033000380281190820011302060504800065'.
               10  FILLER                  PIC X(56) VALUE
             '01400402600033020375073001050142540360005301038801600021'.
               10  FILLER                  PIC X(56) VALUE
             '02139309300122014691043000630093350200002701720806300086'.
               10  FILLER                  PIC X(56) VALUE
             '01207903100044008838019000250128080390005800842201900025'.
               10  FILLER                  PIC X(56) VALUE
             '02523506000102021024040000660171960140001900000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000014664053000730119420450005700983503100038'.
               10  FILLER                  PIC X(56) VALUE
             '00859902400035014513060000810111470400005300857702500032'.
               10  FILLER                  PIC X(56) VALUE
             '01058705000064008000036000430115080300004200945701800023'.
               10  FILLER                  PIC X(56) VALUE
             '01045903900052007110020000260094220430005700627602600032'.
               10  FILLER                  PIC X(56) VALUE
             '00722302400033013017051000680103520380004900823202700035'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000155210350004501185802000024'.
               10  FILLER                  PIC X(56) VALUE
             '01613403600065012986015000190160510530007801084202100030'.
               10  FILLER                  PIC X(56) VALUE
             '00985002900042006710017000200153000380006101131001300015'.
               10  FILLER                  PIC X(56) VALUE
             '01565305000075010329021000270000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000012827056000740106030420005400767702500033'.
               10  FILLER                  PIC X(56) VALUE
             '00907104400057006886028000350100830510006500724103300040'.
               10  FILLER                  PIC X(56) VALUE
             '00954203700051007058024000320000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000020185058000760137980300003503210811500139'.
               10  FILLER                  PIC X(56) VALUE
             '02102206200074016754035000390220810790010201457704400052'.
               10  FILLER                  PIC X(56) VALUE
             '01030802800031012422035000460086720210002301189604000058'.
               10  FILLER                  PIC X(56) VALUE
             '00866002100025010488030000410084990170001900791601500018'.
               10  FILLER                  PIC X(56) VALUE
             '02281307100098014993026000330000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000015596064000890116080420005600770202500033'.
               10  FILLER                  PIC X(56) VALUE
             '01432806800089011147049000610096090370004600691002900038'.
               10  FILLER                  PIC X(56) VALUE
             '00556902000025000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00994304100053007664030000320072460250002901734804700058'.
               10  FILLER                  PIC X(56) VALUE
             '01911403200057007336016000260000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000005914026000320044610210002300646002600035'.
               10  FILLER                  PIC X(56) VALUE
             '00708701800021003744020000280060130170002600284501300027'.
               10  FILLER                  PIC X(56) VALUE
             '00568902700039004297017000280000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01425001800018046990179001790320931330013301936408600086'.
               10  FILLER                  PIC X(56) VALUE
             '03296604700047011668034000340015800310003100000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000395131070014302761706400082'.
               10  FILLER                  PIC X(56) VALUE
             '02325203700048027940091001280182590470006501475402400032'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001617106000080'.
               10  FILLER                  PIC X(56) VALUE
             '01203103900050010741031000390100060400005500778002800037'.
               10  FILLER                  PIC X(56) VALUE
             '01342603800052013226053000720102330390004900799002700034'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000004497013800184'.
               10  FILLER                  PIC X(56) VALUE
             '02684705400078015989027000370351881200015402516406600088'.
               10  FILLER                  PIC X(56) VALUE
             '01620103300047039780130001740242300570007501510902900037'.
               10  FILLER                  PIC X(56) VALUE
             '02489406900105016396025000350000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000036361089001470256260530008202178503400051'.
               10  FILLER                  PIC X(56) VALUE
             '04778817200227029919062000900239800490006102145406800096'.
               10  FILLER                  PIC X(56) VALUE
             '01644405000066012188032000430163410630008701240304500060'.
               10  FILLER                  PIC X(56) VALUE
             '00966403300043016523058000850102960270003300911602300029'.
               10  FILLER                  PIC X(56) VALUE
             '01266304300060000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '05184012800168039291091001120336620560007303925712100162'.
               10  FILLER                  PIC X(56) VALUE
             '02491906800089020996047000600000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000015454062000830105600420005200824003200041'.
               10  FILLER                  PIC X(56) VALUE
             '01207404900068007527028000350219710720009901525804600059'.
               10  FILLER                  PIC X(56) VALUE
             '01361103500044057579126001530174840560007701378304700058'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000002463206900114'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000608502400032'.
               10  FILLER                  PIC X(56) VALUE
             '00519803100042005685031000440089990460007400843104000054'.
               10  FILLER                  PIC X(56) VALUE
             '00778305500076006983040000590083410310004600000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000003571021000300075570820010501041904800066'.
               10  FILLER                  PIC X(56) VALUE
             '00614503300041000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '02853409300144018611057000790149660350004902524607200122'.
               10  FILLER                  PIC X(56) VALUE
             '01592603500047009803022000330310300810011702186505000069'.
               10  FILLER                  PIC X(56) VALUE
             '01411202700036000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01063104600062006890027000340086600330004700498601700021'.
               10  FILLER                  PIC X(56) VALUE
             '01171703700052006886021000270128300440006200979703200043'.
               10  FILLER                  PIC X(56) VALUE
             '00710102300029011338041000600070710240003300000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000001230422300028804395612100162'.
               10  FILLER                  PIC X(56) VALUE
             '02353305600077000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '02662602700059013745047000680116050370005500000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000216720750010901682304400064'.
               10  FILLER                  PIC X(56) VALUE
             '01353102300030000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01100508400103010143070000790087670380005000654202700034'.
               10  FILLER                  PIC X(56) VALUE
             '00732302500041005948024000340061090210003800000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000510280850012203485407600095'.
               10  FILLER                  PIC X(56) VALUE
             '05796010500160044786079001050369880490006100000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000229850630009301701505000063'.
               10  FILLER                  PIC X(56) VALUE
             '01410803300041000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '05139513500187036849066000950000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000021382074001040159180530007301335703800049'.
               10  FILLER                  PIC X(56) VALUE
             '01038703800053000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '04516811900153035417078001000297370390005402721711700146'.
               10  FILLER                  PIC X(56) VALUE
             '02086507400097016706035000510285000990013202013405900080'.
               10  FILLER                  PIC X(56) VALUE
             '01631002900041000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
           05  DRGX-TAB REDEFINES D-TAB.
               10  DRGX-PERIOD               OCCURS 1
                                              INDEXED BY DX5.
                   15  DRGX-EFF-DATE         PIC X(08).
                   15  DRG-DATA              OCCURS 1000
                                              INDEXED BY DX6.
                       20  DRG-WT            PIC 9(02)V9(04).
                       20  DRG-ALOS          PIC 9(02)V9(01).
                       20  DRG-DAYS-TRIM     PIC 9(02).
                       20  DRG-ARITH-ALOS    PIC 9(02)V9(01).
