       01  DRG-TABLE.                                                   
           05  D-TAB.                                                   
             10  FILLER                  PIC X(08) VALUE                
           '20091001'.                                                  
             10  FILLER                  PIC X(56) VALUE                
           '24854831500439117540164002121826673160038511194122900282'.  
             10  FILLER                  PIC X(56) VALUE                
           '10135814900203047569083000920945431560018605061510400123'.  
             10  FILLER                  PIC X(56) VALUE                
           '06541917700213042752089001000473411270016303030608800105'.  
             10  FILLER                  PIC X(56) VALUE                
           '01864305700069000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000008439214800183'.  
             10  FILLER                  PIC X(56) VALUE                
           '06206812200144043765074000890494010850012103256605700080'.  
             10  FILLER                  PIC X(56) VALUE                
           '04823609400121029421061000770209020310004105109010200134'.  
             10  FILLER                  PIC X(56) VALUE                
           '02776804800067016019027000350453410900013201918603700055'.  
             10  FILLER                  PIC X(56) VALUE                
           '01333102200028031900044000690201650200002901574401300016'.  
             10  FILLER                  PIC X(56) VALUE                
           '02919005700083014783024000340100330140001703951809400129'.  
             10  FILLER                  PIC X(56) VALUE                
           '02124905200070016448024000330000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000001483604500063'.  
             10  FILLER                  PIC X(56) VALUE                
           '00838203100040015637050000680106130360004901695205700077'.  
             10  FILLER                  PIC X(56) VALUE                
           '00902803900050015512058000780095810420005100708303200038'.  
             10  FILLER                  PIC X(56) VALUE                
           '02916806500087019290050000590151870360004201825805300072'.  
             10  FILLER                  PIC X(56) VALUE                
           '01158004100050008223029000350133350430005500859302700034'.  
             10  FILLER                  PIC X(56) VALUE                
           '00728902400029017919057000740110270410005200761602600033'.  
             10  FILLER                  PIC X(56) VALUE                
           '01293904500060008380033000410166700570007300833603300039'.  
             10  FILLER                  PIC X(56) VALUE                
           '01624505300066009822036000430073590270003201146103700050'.  
             10  FILLER                  PIC X(56) VALUE                
           '00711302700034020130037000630130310360004900853202200029'.  
             10  FILLER                  PIC X(56) VALUE                
           '02057205300074012098038000490078150240003101474104200055'.  
             10  FILLER                  PIC X(56) VALUE                
           '00929802900037006818019000240154650450006200916703400043'.  
             10  FILLER                  PIC X(56) VALUE                
           '00669102400030034161090001170224160640008101792704700059'.  
             10  FILLER                  PIC X(56) VALUE                
           '03023309100115017985063000800120840460005501477804500061'.  
             10  FILLER                  PIC X(56) VALUE                
           '00757702800036009772032000440063550240003000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '01770204000057008825020000260115890320004401141802700040'.  
             10  FILLER                  PIC X(56) VALUE                
           '00691401600021000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '01000604400056006713034000420071530230002801184304100056'.  
             10  FILLER                  PIC X(56) VALUE                
           '00662702600033000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '02066103600052012054024000300201460390005701135502100027'.  
             10  FILLER                  PIC X(56) VALUE                
           '01588403700055008166017000220185200430006500901501700021'.  
             10  FILLER                  PIC X(56) VALUE                
           '01400404000054007458019000240080800140001700000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000021291067000950123450400005800699502300032'.  
             10  FILLER                  PIC X(56) VALUE                
           '00629302200027013363040000540061940230002900939603600046'.  
             10  FILLER                  PIC X(56) VALUE                
           '00608402700033013872045000610088230340004300620102400030'.  
             10  FILLER                  PIC X(56) VALUE                
           '01476304800066009235035000460059490230003000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000495491170014302516406300075'.  
             10  FILLER                  PIC X(56) VALUE                
           '01766204000047037227098001250200680600007601302603400046'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000161210590007101068504300051'.  
             10  FILLER                  PIC X(56) VALUE                
           '02048307100089014860058000710100880430005201726305900077'.  
             10  FILLER                  PIC X(56) VALUE                
           '01206204300056008159030000380144320520006600948303700045'.  
             10  FILLER                  PIC X(56) VALUE                
           '00666502600032015917055000710106200390005000761202900036'.  
             10  FILLER                  PIC X(56) VALUE                
           '01345504700060012076047000580096220400004800717503200038'.  
             10  FILLER                  PIC X(56) VALUE                
           '01437805300066009977043000510070950330003901539605600070'.  
             10  FILLER                  PIC X(56) VALUE                
           '01064704200051008137032000390182660640008300974503700048'.  
             10  FILLER                  PIC X(56) VALUE                
           '00714402900038008374035000430060550270003300647202100028'.  
             10  FILLER                  PIC X(56) VALUE                
           '01256604000054007294026000330517801280015102235805100072'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000001283040700014410196715500181'.  
             10  FILLER                  PIC X(56) VALUE                
           '06593210100112052809076000830793361110013605176707300080'.  
             10  FILLER                  PIC X(56) VALUE                
           '04392605700061084829098001240622290380005407547707800099'.  
             10  FILLER                  PIC X(56) VALUE                
           '05832103900050065457057000850505190180002807540111800142'.  
             10  FILLER                  PIC X(56) VALUE                
           '04842807500085037989050000590767841080012905558908300092'.  
             10  FILLER                  PIC X(56) VALUE                
           '06924012000137046212081000870568980950011103612806000065'.  
             10  FILLER                  PIC X(56) VALUE                
           '05035507300105029366030000430472751220015502537707900097'.  
             10  FILLER                  PIC X(56) VALUE                
           '01492205300063035878063000810257370360004801988802100027'.  
             10  FILLER                  PIC X(56) VALUE                
           '04053402200034030955035000500191210170002102841904300060'.  
             10  FILLER                  PIC X(56) VALUE                
           '01684002000025027546050000700164550200002702944305300082'.  
             10  FILLER                  PIC X(56) VALUE                
           '02281704200059015713019000260253880740009901551805600071'.  
             10  FILLER                  PIC X(56) VALUE                
           '00952903400045028006050000680171910200002803295607400107'.  
             10  FILLER                  PIC X(56) VALUE                
           '01467702900041010412019000250161630330005402508705600085'.  
             10  FILLER                  PIC X(56) VALUE                
           '02240702300034000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000001831305400068'.  
             10  FILLER                  PIC X(56) VALUE                
           '01162003600045008177023000290167170330005300802401900027'.  
             10  FILLER                  PIC X(56) VALUE                
           '00560201500019019634050000670103210240003103088809200118'.  
             10  FILLER                  PIC X(56) VALUE                
           '01849606600080012313045000550146090500006400974003900047'.  
             10  FILLER                  PIC X(56) VALUE                
           '00694002900034010104046000570065040360004201166501900030'.  
             10  FILLER                  PIC X(56) VALUE                
           '00670401400018004469011000120140450500006400937804000050'.  
             10  FILLER                  PIC X(56) VALUE                
           '00652202900036009999031000420056810200002401024203700048'.  
             10  FILLER                  PIC X(56) VALUE                
           '00595902200028013076041000560076240260003301218804000053'.  
             10  FILLER                  PIC X(56) VALUE                
           '00820703000038005710021000260051280190002300721502500031'.  
             10  FILLER                  PIC X(56) VALUE                
           '00540401700021017589050000690095980340004400621102200027'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000056845129001660270620720009201395003000040'.  
             10  FILLER                  PIC X(56) VALUE                
           '05139612700157024981079000920159520490005504776212100145'.  
             10  FILLER                  PIC X(56) VALUE                
           '02415007300084016208045000520414221150014002245807300088'.  
             10  FILLER                  PIC X(56) VALUE                
           '01444104200052030677086001030179790570006601219703400039'.  
             10  FILLER                  PIC X(56) VALUE                
           '02210905100068013112031000390093600170002103034509100113'.  
             10  FILLER                  PIC X(56) VALUE                
           '01617905900070011755043000480226570640008701323704200055'.  
             10  FILLER                  PIC X(56) VALUE                
           '00766502300029022798057000780126280340004400821001900024'.  
             10  FILLER                  PIC X(56) VALUE                
           '02534906400084014337039000490098780230002803959709500130'.  
             10  FILLER                  PIC X(56) VALUE                
           '02116005900077013008033000430000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000001658405000066'.  
             10  FILLER                  PIC X(56) VALUE                
           '01048003800046007501027000320192140670008701286505400066'.  
             10  FILLER                  PIC X(56) VALUE                
           '00861904100048020149064000860126310450005900888303000039'.  
             10  FILLER                  PIC X(56) VALUE                
           '01614904900063009873036000430071790270003201733305500070'.  
             10  FILLER                  PIC X(56) VALUE                
           '01085303900048007785029000350123990440005500814603100037'.  
             10  FILLER                  PIC X(56) VALUE                
           '01708906100080010423043000540078710340004101506005300070'.  
             10  FILLER                  PIC X(56) VALUE                
           '00926803900049006341029000350109580390005100692102800035'.  
             10  FILLER                  PIC X(56) VALUE                
           '01563204900068009572037000470066660260003200000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '05591112500166026729067000850180680410005204084411300140'.  
             10  FILLER                  PIC X(56) VALUE                
           '02310307500088016134052000610396551030012402398207300084'.  
             10  FILLER                  PIC X(56) VALUE                
           '01622204500054036023096001170198240620007301290403900045'.  
             10  FILLER                  PIC X(56) VALUE                
           '02405006400080016354043000530113340240003004118210200140'.  
             10  FILLER                  PIC X(56) VALUE                
           '01698704900068011791032000440422551120014902210506900090'.  
             10  FILLER                  PIC X(56) VALUE                
           '01447703900052000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000001636905100068'.  
             10  FILLER                  PIC X(56) VALUE                
           '00907603600046006489027000340172930570007401183104300056'.  
             10  FILLER                  PIC X(56) VALUE                
           '00878003000039016993055000740099600400005100686503000036'.  
             10  FILLER                  PIC X(56) VALUE                
           '01729005200072009407037000480066310280003501505504900064'.  
             10  FILLER                  PIC X(56) VALUE                
           '01038603700046007239025000310000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '10010811200144069533058000720501970330004008741211200140'.  
             10  FILLER                  PIC X(56) VALUE                
           '05961706100072048966038000430615060750009303709703500040'.  
             10  FILLER                  PIC X(56) VALUE                
           '04561406500081032056038000420530251220016802838407300095'.  
             10  FILLER                  PIC X(56) VALUE                
           '01789604400057046698074000920312070450005202516703400037'.  
             10  FILLER                  PIC X(56) VALUE                
           '03328206600079020613035000380461820720010102754702800041'.  
             10  FILLER                  PIC X(56) VALUE                
           '02003301500019035040097001250192300620008001065003500046'.  
             10  FILLER                  PIC X(56) VALUE                
           '03134308700111021321047000650151210190002802875207600089'.  
             10  FILLER                  PIC X(56) VALUE                
           '01837305200057015071043000470230240320003901835802000023'.  
             10  FILLER                  PIC X(56) VALUE                
           '03087109300114020558064000760143380450005201677403900050'.  
             10  FILLER                  PIC X(56) VALUE                
           '01183002500029017718030000430095220170002102850006800085'.  
             10  FILLER                  PIC X(56) VALUE                
           '01780604200051012619027000320287430740010101625404200057'.  
             10  FILLER                  PIC X(56) VALUE                
           '01034402000026019228054000740089750220002803024408100110'.  
             10  FILLER                  PIC X(56) VALUE                
           '01516904600060009834023000290218350670008801508205100064'.  
             10  FILLER                  PIC X(56) VALUE                
           '01028202500033011381025000360181880350004801256801700020'.  
             10  FILLER                  PIC X(56) VALUE                
           '01206502200031021482050000640137470320003901003301800022'.  
             10  FILLER                  PIC X(56) VALUE                
           '01232703500047007712020000250304140780010101835504500058'.  
             10  FILLER                  PIC X(56) VALUE                
           '01364002200030000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '01563205000069007386032000390129140450005900712703300039'.  
             10  FILLER                  PIC X(56) VALUE                
           '00883103700043005863025000300228390790010501383905700072'.  
             10  FILLER                  PIC X(56) VALUE                
           '00942204100052019540066000860112110460005800771703600042'.  
             10  FILLER                  PIC X(56) VALUE                
           '02278306300087010758043000530074750300003701928106700090'.  
             10  FILLER                  PIC X(56) VALUE                
           '01175805000063007082033000410154420540006900793703300041'.  
             10  FILLER                  PIC X(56) VALUE                
           '01105704500057006478029000360096980340004700602702500031'.  
             10  FILLER                  PIC X(56) VALUE                
           '01468505400066008387036000430175140520007200985203700048'.  
             10  FILLER                  PIC X(56) VALUE                
           '00595902100027013793048000610069270310003601506805300070'.  
             10  FILLER                  PIC X(56) VALUE                
           '00907003900048006498028000350000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '03528610000139019090068000890112600450005603359808200126'.  
             10  FILLER                  PIC X(56) VALUE                
           '01723504100062009925024000320285560800010701399703600053'.  
             10  FILLER                  PIC X(56) VALUE                
           '00858901800024010226021000280078890150001801487703600055'.  
             10  FILLER                  PIC X(56) VALUE                
           '00859301700021000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000001849906600088'.  
             10  FILLER                  PIC X(56) VALUE                
           '01080704900063007523037000470176910600008200828503700047'.  
             10  FILLER                  PIC X(56) VALUE                
           '01630205600080010650042000570061020260003500980104200054'.  
             10  FILLER                  PIC X(56) VALUE                
           '00594103000036014300055000690081780380004601171904100055'.  
             10  FILLER                  PIC X(56) VALUE                
           '00682402700034011964043000590064030280003600000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000026525050000710138590260003104853713200168'.  
             10  FILLER                  PIC X(56) VALUE                
           '02031606900085012713050000610358390500007901825802600034'.  
             10  FILLER                  PIC X(56) VALUE                
           '01450001700019042285113001600202710690008901130404500056'.  
             10  FILLER                  PIC X(56) VALUE                
           '02238004700071011339020000300075450130001403397807400111'.  
             10  FILLER                  PIC X(56) VALUE                
           '02300306800085014359035000480000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '01330304400058008263033000420055470240002901089603700051'.  
             10  FILLER                  PIC X(56) VALUE                
           '00684303000037010463036000490163250580007301045304200053'.  
             10  FILLER                  PIC X(56) VALUE                
           '00718703000037000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000002973606500075'.  
             10  FILLER                  PIC X(56) VALUE                
           '05818913300165028942083000940191800500005903259207700099'.  
             10  FILLER                  PIC X(56) VALUE                
           '01852304800056013668030000340328120780010701813604400060'.  
             10  FILLER                  PIC X(56) VALUE                
           '01281702400030027753074001020137130340004901019301500019'.  
             10  FILLER                  PIC X(56) VALUE                
           '02805209000114015506041000610076150180002302248106100084'.  
             10  FILLER                  PIC X(56) VALUE                
           '01193803000042007573018000230146980400006000769901900024'.  
             10  FILLER                  PIC X(56) VALUE                
           '02919205700097020576045000680131290150002100000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000016422051000700105230420005200674602900035'.  
             10  FILLER                  PIC X(56) VALUE                
           '00899402500034015362055000730102600390005100685202300030'.  
             10  FILLER                  PIC X(56) VALUE                
           '01212204800060007708035000420147110310004101104401900023'.  
             10  FILLER                  PIC X(56) VALUE                
           '01149603500046006539020000250123960420005700645302600032'.  
             10  FILLER                  PIC X(56) VALUE                
           '00814002500035014877050000660095180370004700653302600033'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000166910320004201202401700020'.  
             10  FILLER                  PIC X(56) VALUE                
           '01835003600060013227013000160171280500007400766601900026'.  
             10  FILLER                  PIC X(56) VALUE                
           '01128502900041006364016000190174600410006301005301300015'.  
             10  FILLER                  PIC X(56) VALUE                
           '01678204800068007921020000270000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000014962054000700097320390005100628802100028'.  
             10  FILLER                  PIC X(56) VALUE                
           '01068503900051006979028000350131620500006400733103300041'.  
             10  FILLER                  PIC X(56) VALUE                
           '00964203700049005786023000280000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000025091056000770113700250003004349011400140'.  
             10  FILLER                  PIC X(56) VALUE                
           '01965105800068011766033000370305530770010001502804100049'.  
             10  FILLER                  PIC X(56) VALUE                
           '01056802400028013481033000430087870190002201469904100057'.  
             10  FILLER                  PIC X(56) VALUE                
           '00772102000025012251029000400084710160001800878401500017'.  
             10  FILLER                  PIC X(56) VALUE                
           '02437806600091010159023000300000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000018829062000850111840410005500588302200029'.  
             10  FILLER                  PIC X(56) VALUE                
           '01718906500084010980048000590077190360004400799203000039'.  
             10  FILLER                  PIC X(56) VALUE                
           '00495201900024000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '01108304000052007526029000300083890250003001775404700058'.  
             10  FILLER                  PIC X(56) VALUE                
           '01890003900069005367015000190000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000006873026000330049710210002300680802600035'.  
             10  FILLER                  PIC X(56) VALUE                
           '00778601900023004229019000300043860160002100202301200013'.  
             10  FILLER                  PIC X(56) VALUE                
           '00635702700038004504017000240000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '01458301800018048090179001790328441330013301981708600086'.  
             10  FILLER                  PIC X(56) VALUE                
           '03373804700047011941034000340016170310003100000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000510871050013702531505700074'.  
             10  FILLER                  PIC X(56) VALUE                
           '01586503200040034788088001190176800490006901038802400032'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000002048706300082'.  
             10  FILLER                  PIC X(56) VALUE                
           '01172504100052008689031000390124310390005400775102800037'.  
             10  FILLER                  PIC X(56) VALUE                
           '01384603700052015144051000680095960360004600695302700034'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000005367312800168'.  
             10  FILLER                  PIC X(56) VALUE                
           '02267205200075011632024000330390101150014802152006300086'.  
             10  FILLER                  PIC X(56) VALUE                
           '01200302900041045104117001490201110520006901238402800035'.  
             10  FILLER                  PIC X(56) VALUE                
           '02608806400096009784023000310000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000043709093001510248170590009701259503200049'.  
             10  FILLER                  PIC X(56) VALUE                
           '06361618100234030949085001290124960480005902725807700105'.  
             10  FILLER                  PIC X(56) VALUE                
           '01507105000067009803032000430168520590007901199704500060'.  
             10  FILLER                  PIC X(56) VALUE                
           '00804303100041021717060000850094510270003400823502500032'.  
             10  FILLER                  PIC X(56) VALUE                
           '01283704400062000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '05494612500163027290088001080170400550007304924911400155'.  
             10  FILLER                  PIC X(56) VALUE                
           '02043906300081013521044000550000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000019008060000800097020410005100815303100039'.  
             10  FILLER                  PIC X(56) VALUE                
           '01360104400062006736028000350237050690009401068004200054'.  
             10  FILLER                  PIC X(56) VALUE                
           '00741903300041058007129001550184370540007301115504600056'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000002589208000131'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000619102400032'.  
             10  FILLER                  PIC X(56) VALUE                
           '00604803100043006676031000440111880490008200945204200056'.  
             10  FILLER                  PIC X(56) VALUE                
           '00889905500075007895037000600083360310004700000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000004021021000290097420820010601415504900068'.  
             10  FILLER                  PIC X(56) VALUE                
           '00628803200040000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '04054510000150017850057000800101370330004502860107300113'.  
             10  FILLER                  PIC X(56) VALUE                
           '01090103400046009991021000310380720810011601873604700065'.  
             10  FILLER                  PIC X(56) VALUE                
           '01113502600034000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '01347304200060006789026000340125450330004600451301700021'.  
             10  FILLER                  PIC X(56) VALUE                
           '01444903700052005839020000270158830440006300940503200043'.  
             10  FILLER                  PIC X(56) VALUE                
           '00612102300028013114038000550065560230003200000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000001373512440032705305211700164'.  
             10  FILLER                  PIC X(56) VALUE                
           '02008605000074000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '02308102400057013403042000620125070350005300000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000285930720010901682103500057'.  
             10  FILLER                  PIC X(56) VALUE                
           '01129802000026000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '01238808200100011159067000770109220380005100668902800035'.  
             10  FILLER                  PIC X(56) VALUE                
           '00975802700048005459025000340072390210004200000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000567810890012803436407300091'.  
             10  FILLER                  PIC X(56) VALUE                
           '06299310500151036544073000950220000450005800000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000276870620009201502604600058'.  
             10  FILLER                  PIC X(56) VALUE                
           '00978103100038000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '05507413200188025627061000890000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000024810071001000135970520006800896703700047'.  
             10  FILLER                  PIC X(56) VALUE                
           '01053803700050000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '05038911300146028954070000900180720340004603344311700146'.  
             10  FILLER                  PIC X(56) VALUE                
           '01948106200087011079029000430340200940012601783605400073'.  
             10  FILLER                  PIC X(56) VALUE                
           '01035802600037000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
             10  FILLER                  PIC X(56) VALUE                
           '00000000000000000000000000000000000000000000000000000000'.  
           05  DRGX-TAB REDEFINES D-TAB.                                
               10  DRGX-PERIOD               OCCURS 1                   
                                              INDEXED BY DX5.           
                   15  DRGX-EFF-DATE         PIC X(08).                 
                   15  DRG-DATA              OCCURS 1000                
                                              INDEXED BY DX6.           
                       20  DRG-WT            PIC 9(02)V9(04).           
                       20  DRG-ALOS          PIC 9(02)V9(01).           
                       20  DRG-DAYS-TRIM     PIC 9(02).                 
                       20  DRG-ARITH-ALOS    PIC 9(02)V9(01).           
