       01  DRG-TABLE.
           05  D-TAB.
               10  FILLER                  PIC X(08) VALUE
             '20081001'.
               10  FILLER                  PIC X(56) VALUE
             '23670129600411128157187002531836943260039811136623500289'.
               10  FILLER                  PIC X(56) VALUE
             '10818016100215048839090001050959981580019604881110100119'.
               10  FILLER                  PIC X(56) VALUE
             '06641118300220037246091001080488341310016703052708800107'.
               10  FILLER                  PIC X(56) VALUE
             '01896605900069000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000008292014800183'.
               10  FILLER                  PIC X(56) VALUE
             '06359613700155041535076000930505840890012703459706200090'.
               10  FILLER                  PIC X(56) VALUE
             '05010909900130030058064000820210290350004505191910700143'.
               10  FILLER                  PIC X(56) VALUE
             '02794305100071015385028000370438610930013101951804000060'.
               10  FILLER                  PIC X(56) VALUE
             '01328902300030032220046000730202270210003301567301300016'.
               10  FILLER                  PIC X(56) VALUE
             '03026305900086015525025000380100050150001803964509700133'.
               10  FILLER                  PIC X(56) VALUE
             '02151805300072016759025000360000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001621604800067'.
               10  FILLER                  PIC X(56) VALUE
             '00866903300040015860052000700108280380005101634905700078'.
               10  FILLER                  PIC X(56) VALUE
             '00880203900050015706057000770094440420005100699403400040'.
               10  FILLER                  PIC X(56) VALUE
             '02871706800089019537053000630151430390004501845005500075'.
               10  FILLER                  PIC X(56) VALUE
             '01176004300052008439031000370138730440005800845702700034'.
               10  FILLER                  PIC X(56) VALUE
             '00715702400030018246060000790113610440005600765002800035'.
               10  FILLER                  PIC X(56) VALUE
             '01308204700062008423034000430167300570007300859503400041'.
               10  FILLER                  PIC X(56) VALUE
             '01623305200067010082036000440073980280003401103203800051'.
               10  FILLER                  PIC X(56) VALUE
             '00710402700035020201037000640129930370004900875302400031'.
               10  FILLER                  PIC X(56) VALUE
             '02090805500076012072039000500080110260003301582904200059'.
               10  FILLER                  PIC X(56) VALUE
             '00918603000037006751020000250157470460006400921803500045'.
               10  FILLER                  PIC X(56) VALUE
             '00677702600032033505092001180219350690008601821705000062'.
               10  FILLER                  PIC X(56) VALUE
             '03207309900126018504067000830125930470005901506904700063'.
               10  FILLER                  PIC X(56) VALUE
             '00761702900037009584033000450062390250003100000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01578703800056008289019000260106750330004301134602600041'.
               10  FILLER                  PIC X(56) VALUE
             '00669901600022000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00959004300055006148033000400068760230002901064203900053'.
               10  FILLER                  PIC X(56) VALUE
             '00668902800035000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '02010903700052011513023000290199330400005801098102100026'.
               10  FILLER                  PIC X(56) VALUE
             '01555203600053008213017000220168320380005900897401700023'.
               10  FILLER                  PIC X(56) VALUE
             '01261903800054007366019000250081470140001800000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000020472066000940124500430006100820602700038'.
               10  FILLER                  PIC X(56) VALUE
             '00610902200027012254037000520060340230002900899403400045'.
               10  FILLER                  PIC X(56) VALUE
             '00597402600032013776046000630087840350004400631202500032'.
               10  FILLER                  PIC X(56) VALUE
             '01474604600066008615034000450059660240003000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000499781220015002595306700081'.
               10  FILLER                  PIC X(56) VALUE
             '01803604300051036912100001290202640630008001343303900052'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000157960600007301071304600053'.
               10  FILLER                  PIC X(56) VALUE
             '02039307200091014983060000740104190450005601695006000079'.
               10  FILLER                  PIC X(56) VALUE
             '01231604500059008736032000420153460580007200945803800046'.
               10  FILLER                  PIC X(56) VALUE
             '00681102900034016252057000740109420410005300813303100040'.
               10  FILLER                  PIC X(56) VALUE
             '01348804800061013030050000630097570410005000725403300040'.
               10  FILLER                  PIC X(56) VALUE
             '01432705400067010056044000530073160350004101602205800073'.
               10  FILLER                  PIC X(56) VALUE
             '01099204400054008198033000410174010640008301010703900051'.
               10  FILLER                  PIC X(56) VALUE
             '00740303100041008157035000430059560280003400654802200029'.
               10  FILLER                  PIC X(56) VALUE
             '01236304000055007289027000340510551280015102180105200072'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000001225160760014010094315700184'.
               10  FILLER                  PIC X(56) VALUE
             '06990010900123054211083000910803291140014005279907600086'.
               10  FILLER                  PIC X(56) VALUE
             '04386906000064086466107001310628650460006307952109200114'.
               10  FILLER                  PIC X(56) VALUE
             '05900604500056067117062000930499610180002807786312100147'.
               10  FILLER                  PIC X(56) VALUE
             '05021307900091040573056000650764381120013405529108200092'.
               10  FILLER                  PIC X(56) VALUE
             '07014412400142046075083000890567120950011203594506100066'.
               10  FILLER                  PIC X(56) VALUE
             '05074107500108028874032000460450441200015402667408300104'.
               10  FILLER                  PIC X(56) VALUE
             '01572205600068037029067000880258870380005102005902200029'.
               10  FILLER                  PIC X(56) VALUE
             '03984202100032031468036000530191270170002202804604200060'.
               10  FILLER                  PIC X(56) VALUE
             '01639501900025029915054000780160380210002802955005500086'.
               10  FILLER                  PIC X(56) VALUE
             '02254504100060015426020000270241100710009701592005800075'.
               10  FILLER                  PIC X(56) VALUE
             '01025703700049028325054000740168990200002803410108100112'.
               10  FILLER                  PIC X(56) VALUE
             '01438003000042010152020000260154150340005402532905800089'.
               10  FILLER                  PIC X(56) VALUE
             '02209502200035000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001940405800073'.
               10  FILLER                  PIC X(56) VALUE
             '01221303900048008696026000320169250330005400911102200032'.
               10  FILLER                  PIC X(56) VALUE
             '00605301700022019769052000690102520240003103083909200118'.
               10  FILLER                  PIC X(56) VALUE
             '01958807000087014465051000650146010500006501006904100050'.
               10  FILLER                  PIC X(56) VALUE
             '00722003100037009595046000550064080370004301194702000031'.
               10  FILLER                  PIC X(56) VALUE
             '00647601400018004447011000130143700500006700928604100050'.
               10  FILLER                  PIC X(56) VALUE
             '00660603000037010294032000440056680200002501086503900052'.
               10  FILLER                  PIC X(56) VALUE
             '00591802300029015703044000630075020270003501299204100055'.
               10  FILLER                  PIC X(56) VALUE
             '00833603100039005843023000280049720190002300709702500031'.
               10  FILLER                  PIC X(56) VALUE
             '00531401700021017552050000700099360350004600652802400030'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000057896132001710283630780010001453003200044'.
               10  FILLER                  PIC X(56) VALUE
             '05166612800160025589083000970162240520005904524312000144'.
               10  FILLER                  PIC X(56) VALUE
             '02445207700088016221047000550408681160014102236907500091'.
               10  FILLER                  PIC X(56) VALUE
             '01451704400056031760088001070185640600007001225903500042'.
               10  FILLER                  PIC X(56) VALUE
             '02159805300071013098032000410090420180002203067209200117'.
               10  FILLER                  PIC X(56) VALUE
             '01634606100072011881044000490220470650008801288304400057'.
               10  FILLER                  PIC X(56) VALUE
             '00767902400031022608058000800125970340004500811702000025'.
               10  FILLER                  PIC X(56) VALUE
             '02485906400084014020040000510096480240002903856909500129'.
               10  FILLER                  PIC X(56) VALUE
             '02170906200081013474033000450000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001628905100066'.
               10  FILLER                  PIC X(56) VALUE
             '01071503800048007819028000340191360670008701307205600068'.
               10  FILLER                  PIC X(56) VALUE
             '00868404200049019075063000860125430450006000882003200042'.
               10  FILLER                  PIC X(56) VALUE
             '01607304900064010043037000440075650290003401800605600073'.
               10  FILLER                  PIC X(56) VALUE
             '01113704200052008218031000370117440440005500783803100038'.
               10  FILLER                  PIC X(56) VALUE
             '01856806500088010616045000570077860350004301540805400073'.
               10  FILLER                  PIC X(56) VALUE
             '00926504000050006351030000350108560390005200670302800035'.
               10  FILLER                  PIC X(56) VALUE
             '01540904900069009519038000480067650260003300000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '05640512400170027858070000910183880420005504258512200151'.
               10  FILLER                  PIC X(56) VALUE
             '02564908300098016467055000650374961040012402364107500086'.
               10  FILLER                  PIC X(56) VALUE
             '01687705000059035699097001170203380650007601328904100048'.
               10  FILLER                  PIC X(56) VALUE
             '02476506500084016507045000560112640250003204108709900138'.
               10  FILLER                  PIC X(56) VALUE
             '01895905600077012284032000430458121190016002518807900104'.
               10  FILLER                  PIC X(56) VALUE
             '01375204000054000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001679005200070'.
               10  FILLER                  PIC X(56) VALUE
             '00939403800049006550029000370172050570007601192104500058'.
               10  FILLER                  PIC X(56) VALUE
             '00953103200042017013055000750102410420005300697703200038'.
               10  FILLER                  PIC X(56) VALUE
             '01663905100070009830039000510069820300003801558305000066'.
               10  FILLER                  PIC X(56) VALUE
             '01038903800047007231026000330000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '09825312000156069914065000800514760370004408491011600147'.
               10  FILLER                  PIC X(56) VALUE
             '05645906200075046762040000450595870760009503560703600042'.
               10  FILLER                  PIC X(56) VALUE
             '04541906800084031438039000420469471200016602616707700102'.
               10  FILLER                  PIC X(56) VALUE
             '01496604400058045431074000920306300480005502450003600039'.
               10  FILLER                  PIC X(56) VALUE
             '03290106900082020077036000390441220700009802608402800041'.
               10  FILLER                  PIC X(56) VALUE
             '01914001600020034491096001260197870650008401099903700048'.
               10  FILLER                  PIC X(56) VALUE
             '03278108900119021226046000660147420190002802899807800093'.
               10  FILLER                  PIC X(56) VALUE
             '01817505400059014949045000480225080340004201744302100024'.
               10  FILLER                  PIC X(56) VALUE
             '03295909800121021592067000800155380490005701680504100052'.
               10  FILLER                  PIC X(56) VALUE
             '01160102600030017202030000430093830180002202763906800085'.
               10  FILLER                  PIC X(56) VALUE
             '01762004300053012353028000340317410810010901772204600060'.
               10  FILLER                  PIC X(56) VALUE
             '01124902300030020238055000790090900230003002841507800108'.
               10  FILLER                  PIC X(56) VALUE
             '01470004500060009573023000290230470720009401469605100064'.
               10  FILLER                  PIC X(56) VALUE
             '00986002600034010237025000340171660370005101114301700020'.
               10  FILLER                  PIC X(56) VALUE
             '01171802000031019947049000640133920320004000950901800022'.
               10  FILLER                  PIC X(56) VALUE
             '01293203600051008060021000280306690790010501808304500060'.
               10  FILLER                  PIC X(56) VALUE
             '01329302100030000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01424304800067007339033000400134090480006200696303300039'.
               10  FILLER                  PIC X(56) VALUE
             '00892403600045005808027000320202870750009801348105700071'.
               10  FILLER                  PIC X(56) VALUE
             '00926504200053019045067000880113020480005900769803700044'.
               10  FILLER                  PIC X(56) VALUE
             '02349906400091010969044000550072310310003801876906700089'.
               10  FILLER                  PIC X(56) VALUE
             '01161805100064008073037000450153230540007100765703400041'.
               10  FILLER                  PIC X(56) VALUE
             '01106804700060006352030000370100740360004800576702500031'.
               10  FILLER                  PIC X(56) VALUE
             '01429505200066008036035000430170540530007500955503600047'.
               10  FILLER                  PIC X(56) VALUE
             '00580502100028013961049000640067830310003701411105200070'.
               10  FILLER                  PIC X(56) VALUE
             '00888203900050006694030000370000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '03193209600132019517072000940112160470005803438408400129'.
               10  FILLER                  PIC X(56) VALUE
             '01577504200061009782024000330279460780010701411003700055'.
               10  FILLER                  PIC X(56) VALUE
             '00859501900026009649021000280074800160001801432904000060'.
               10  FILLER                  PIC X(56) VALUE
             '00803601700022000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001751506600089'.
               10  FILLER                  PIC X(56) VALUE
             '01108005200065007910041000510182060620008300822503800047'.
               10  FILLER                  PIC X(56) VALUE
             '01606106000082010808043000570073100270003700948504100051'.
               10  FILLER                  PIC X(56) VALUE
             '00658603100039014033055000700080270390004701191504300057'.
               10  FILLER                  PIC X(56) VALUE
             '00676902800035012458044000630064620290003800000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000024984051000700137220270003204706813300171'.
               10  FILLER                  PIC X(56) VALUE
             '02103307000088013333051000640330490520008201864102900037'.
               10  FILLER                  PIC X(56) VALUE
             '01419101900022031728094001320188780670008601094604800060'.
               10  FILLER                  PIC X(56) VALUE
             '02124404700071011332021000310073440130001503267007500111'.
               10  FILLER                  PIC X(56) VALUE
             '02287306800087015075040000550000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01359604500061008164034000430055980250003001113803900054'.
               10  FILLER                  PIC X(56) VALUE
             '00682003100038010168037000520164640580007601046004400055'.
               10  FILLER                  PIC X(56) VALUE
             '00718803100039000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000002955606600077'.
               10  FILLER                  PIC X(56) VALUE
             '05815213600169029415087000980202470580006503278208000101'.
               10  FILLER                  PIC X(56) VALUE
             '01862605000060013765033000370333510800011201891904800065'.
               10  FILLER                  PIC X(56) VALUE
             '01256302600033027108074001030144290360005300992201600021'.
               10  FILLER                  PIC X(56) VALUE
             '02558208200110015536043000630082360210002902238906200085'.
               10  FILLER                  PIC X(56) VALUE
             '01203103100044007683019000250142230410006000794401900025'.
               10  FILLER                  PIC X(56) VALUE
             '02770405800098021587046000720130910150002100000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000016413052000720113040450005600730503200039'.
               10  FILLER                  PIC X(56) VALUE
             '00857802500035016234056000760107480410005300682202500032'.
               10  FILLER                  PIC X(56) VALUE
             '01230104900062007581035000420145340290004001156301900024'.
               10  FILLER                  PIC X(56) VALUE
             '01193903600048006565020000260117110420005500632202600033'.
               10  FILLER                  PIC X(56) VALUE
             '00693102400031014718050000660097250370004800682802800035'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000161990340004401177801800021'.
               10  FILLER                  PIC X(56) VALUE
             '01886403800066012521014000180202380550008100806402200030'.
               10  FILLER                  PIC X(56) VALUE
             '01118302900042006325017000190170720390006200963601200014'.
               10  FILLER                  PIC X(56) VALUE
             '01808705100072007809022000280000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000015686057000760099220400005300597102400031'.
               10  FILLER                  PIC X(56) VALUE
             '01049204200055006696027000350128970510006400694403300040'.
               10  FILLER                  PIC X(56) VALUE
             '01099504000056005968024000310000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000023472060000800112730290003404178311200138'.
               10  FILLER                  PIC X(56) VALUE
             '01956806000072011572035000390300480780010201464104300052'.
               10  FILLER                  PIC X(56) VALUE
             '00998302700030013429035000450084370200002301392304100058'.
               10  FILLER                  PIC X(56) VALUE
             '00744802100026012643030000420083700160001900816201500017'.
               10  FILLER                  PIC X(56) VALUE
             '02483406700093009614025000310000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000017546062000830107800430005700633702500031'.
               10  FILLER                  PIC X(56) VALUE
             '01580306500081010640049000610076640360004500793403000040'.
               10  FILLER                  PIC X(56) VALUE
             '00502401900024000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01053604000050007427030000320095230260003301731904700058'.
               10  FILLER                  PIC X(56) VALUE
             '01274003200046006627016000230000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000006511026000320048000200002200621502500033'.
               10  FILLER                  PIC X(56) VALUE
             '00767901800022004388019000300049210160002100197801300015'.
               10  FILLER                  PIC X(56) VALUE
             '00617002600037003944017000250000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01422601800018046911179001790320391330013301933208600086'.
               10  FILLER                  PIC X(56) VALUE
             '03291104700047011648034000340015770310003100000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000476141080014102562406200078'.
               10  FILLER                  PIC X(56) VALUE
             '01640003800049034208090001230176520470006701052602500034'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000001988606300082'.
               10  FILLER                  PIC X(56) VALUE
             '01174404200053008980032000400127530400005700763002800037'.
               10  FILLER                  PIC X(56) VALUE
             '01353203700051014920050000670099590380005000699402800035'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000005631313200177'.
               10  FILLER                  PIC X(56) VALUE
             '02251405500079012343026000350409461200015402179706600087'.
               10  FILLER                  PIC X(56) VALUE
             '01207303000043046021111001510227120590007901299903000038'.
               10  FILLER                  PIC X(56) VALUE
             '02892907000106010798025000370000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000045869095001550258140620010401211703400052'.
               10  FILLER                  PIC X(56) VALUE
             '06377417600231029436079001220141540500006402596507600104'.
               10  FILLER                  PIC X(56) VALUE
             '01553005200069010258034000450182300620008501203604500061'.
               10  FILLER                  PIC X(56) VALUE
             '00823003300044021272058000840094210270003400797002500031'.
               10  FILLER                  PIC X(56) VALUE
             '01209404400060000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '05432812700167029172091001110181400560007104752211500154'.
               10  FILLER                  PIC X(56) VALUE
             '02052206600085013595045000570000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000019142061000820096050420005200825703200041'.
               10  FILLER                  PIC X(56) VALUE
             '01504904700067006708028000350234410700009601078604500058'.
               10  FILLER                  PIC X(56) VALUE
             '00765003500043057258129001550182220550007501120904700057'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000002483407800121'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000589702400032'.
               10  FILLER                  PIC X(56) VALUE
             '00582803100042006115031000440102340440007400899204100055'.
               10  FILLER                  PIC X(56) VALUE
             '00847705500076007549040000600073030300004600000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000003878021000290089020810010501382704800066'.
               10  FILLER                  PIC X(56) VALUE
             '00619803300041000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '03988810000153017006055000780100090340004602927507100114'.
               10  FILLER                  PIC X(56) VALUE
             '01115103400047010086021000320368040800011601909404900068'.
               10  FILLER                  PIC X(56) VALUE
             '01134202700036000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01230404200057006650027000340122980330004700442301700021'.
               10  FILLER                  PIC X(56) VALUE
             '01415503700052005812021000270152230450006400923403300044'.
               10  FILLER                  PIC X(56) VALUE
             '00610902300030013572041000600061570240003200000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000001385012340031105015611600159'.
               10  FILLER                  PIC X(56) VALUE
             '02144405300077000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '02116502300044012921044000610122130360005400000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000265700670010101635203600054'.
               10  FILLER                  PIC X(56) VALUE
             '01073102100027000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '01302208600105010995069000790105750380005000650002800035'.
               10  FILLER                  PIC X(56) VALUE
             '00805002600041005614025000350076160220004800000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000509850850012303541707600093'.
               10  FILLER                  PIC X(56) VALUE
             '05990410100147035803079001030239130490006400000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000288850660009601611404900062'.
               10  FILLER                  PIC X(56) VALUE
             '00995503400042000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '05382612900189025403067001030000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000025656073001040136120530007000895103800049'.
               10  FILLER                  PIC X(56) VALUE
             '01095403900053000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '05023811800152030783076000970199480390005403317711800146'.
               10  FILLER                  PIC X(56) VALUE
             '02203507300096012775035000530344060980013001879205800078'.
               10  FILLER                  PIC X(56) VALUE
             '01100902900041000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
               10  FILLER                  PIC X(56) VALUE
             '00000000000000000000000000000000000000000000000000000000'.
           05  DRGX-TAB REDEFINES D-TAB.
               10  DRGX-PERIOD               OCCURS 1
                                              INDEXED BY DX5.
                   15  DRGX-EFF-DATE         PIC X(08).
                   15  DRG-DATA              OCCURS 1000
                                              INDEXED BY DX6.
                       20  DRG-WT            PIC 9(02)V9(04).
                       20  DRG-ALOS          PIC 9(02)V9(01).
                       20  DRG-DAYS-TRIM     PIC 9(02).
                       20  DRG-ARITH-ALOS    PIC 9(02)V9(01).
