       01  W-DRG-FILLS.
           03                          PIC X(45)   VALUE
               '003423806430536004302494670389009114172900242'.
           03                          PIC X(45)   VALUE
               '011155453520252012155453520167013155453520112'.
           03                          PIC X(45)   VALUE
               '020155453520293021054722030169022054722030161'.
           03                          PIC X(45)   VALUE
               '023155453520222024054722030158025155453520221'.
           03                          PIC X(45)   VALUE
               '026155453520132027155453520075028114172900242'.
           03                          PIC X(45)   VALUE
               '029114172900124030054722030059031155453520229'.
           03                          PIC X(45)   VALUE
               '032054722030094033054722030047034155453520125'.
           03                          PIC X(45)   VALUE
               '035114172900044036114172900022037155453520149'.
           03                          PIC X(45)   VALUE
               '038114172900058039114172900026040127043620227'.
           03                          PIC X(45)   VALUE
               '041108103430123042073052290057052106293230107'.
           03                          PIC X(45)   VALUE
               '053106293230064054072052360117055067792200081'.
           03                          PIC X(45)   VALUE
               '056074072640123057063092440076058073052290125'.
           03                          PIC X(45)   VALUE
               '059055952260080060054722030062061078972420160'.
           03                          PIC X(45)   VALUE
               '062065632270096063054722030068064077462510127'.
           03                          PIC X(45)   VALUE
               '065066912330082066054722030058067054722030101'.
           03                          PIC X(45)   VALUE
               '068054722030056069054722030047070078972420127'.
           03                          PIC X(45)   VALUE
               '071065632270088072054722030058073078492560102'.
           03                          PIC X(45)   VALUE
               '074062602340069075073052290121076054722030065'.
           03                          PIC X(45)   VALUE
               '077073052290114078073052290072079054722030053'.
           03                          PIC X(45)   VALUE
               '080063122460078081056182310053082088642950109'.
           03                          PIC X(45)   VALUE
               '083073052290086084073052290049085090442830132'.
           03                          PIC X(45)   VALUE
               '086074372510082087063612040053088114172900099'.
           03                          PIC X(45)   VALUE
               '089114172900060090114172900037091080192560107'.
           03                          PIC X(45)   VALUE
               '092067042200069093058112010049094103282790208'.
           03                          PIC X(45)   VALUE
               '095093062700149096093062700101097092892680196'.
           03                          PIC X(45)   VALUE
               '098086292270137099073052290101100079042650101'.
           03                          PIC X(45)   VALUE
               '101061772140058102082492500081103082492500050'.
           03                          PIC X(45)   VALUE
               '113073052290092114073052290041115082492500072'.
           03                          PIC X(45)   VALUE
               '116082492500052117082492500028121073052290091'.
           03                          PIC X(45)   VALUE
               '122054722030063123054722030045124114172900084'.
           03                          PIC X(45)   VALUE
               '125082492500055129119772640081130073052290048'.
           03                          PIC X(45)   VALUE
               '131155453520095132155453520040133073052290094'.
           03                          PIC X(45)   VALUE
               '134073052290032135073052290108136073052290039'.
           03                          PIC X(45)   VALUE
               '137155453520087138155453520037139155453520025'.
           03                          PIC X(45)   VALUE
               '146119772640169147104162490093148073052290056'.
           03                          PIC X(45)   VALUE
               '149054722030042150073052290088151073052290045'.
           03                          PIC X(45)   VALUE
               '152073052290074153073052290052154077032100105'.
           03                          PIC X(45)   VALUE
               '155077032100072156073052290049157082492500113'.
           03                          PIC X(45)   VALUE
               '158082492500071159054722030048163221573970236'.
           03                          PIC X(45)   VALUE
               '164155453520130165155453520083166243924230206'.
           03                          PIC X(45)   VALUE
               '167215943800131168114172900089175071602200116'.
           03                          PIC X(45)   VALUE
               '176059892010084177083932350149178076712220117'.
           03                          PIC X(45)   VALUE
               '179068851900089180081402020131181071031930097'.
           03                          PIC X(45)   VALUE
               '182054722030069183054722030115184054722030073'.
           03                          PIC X(45)   VALUE
               '185054722030050186082592360122187070422110088'.
           03                          PIC X(45)   VALUE
               '188070422110065189097432400101190068582090102'.
           03                          PIC X(45)   VALUE
               '191062561950079192058321720062193070882160109'.
           03                          PIC X(45)   VALUE
               '194064291980082195059621820063196065292000116'.
           03                          PIC X(45)   VALUE
               '197061331960085198059561970067199082492500138'.
           03                          PIC X(45)   VALUE
               '200073052290083201054722030065202069032110069'.
           03                          PIC X(45)   VALUE
               '203056501710053204081872200044205082072240090'.
           03                          PIC X(45)   VALUE
               '206076672150055207202663430226208155142780125'.
           03                          PIC X(45)   VALUE
               '215082492500205216155453520287217082492500177'.
           03                          PIC X(45)   VALUE
               '218082492500127219155453520226220082492500125'.
           03                          PIC X(45)   VALUE
               '221082492500087222155453520209223155453520110'.
           03                          PIC X(45)   VALUE
               '224155453520182225155453520092226155453520168'.
           03                          PIC X(45)   VALUE
               '227155453520041228154103500232229126813080135'.
           03                          PIC X(45)   VALUE
               '230082492500102231155453520209232082492500131'.
           03                          PIC X(45)   VALUE
               '233155453520210234082492500122235155453520170'.
           03                          PIC X(45)   VALUE
               '236082492500090237155453520196238082492500081'.
           03                          PIC X(45)   VALUE
               '239137943740247240128723610166241114172900107'.
           03                          PIC X(45)   VALUE
               '242155453520145243155453520085244114172900046'.
           03                          PIC X(45)   VALUE
               '245073052290049246082492500091247082492500033'.
           03                          PIC X(45)   VALUE
               '248155453520103249155453520039250082492500127'.
           03                          PIC X(45)   VALUE
               '251082492500046252154103500151253126813080102'.
           03                          PIC X(45)   VALUE
               '254082492500043255117133370167256095162940123'.
           03                          PIC X(45)   VALUE
               '257095162940082258155453520126259155453520040'.
           03                          PIC X(45)   VALUE
               '260155453520174261054722030064262054722030037'.
           03                          PIC X(45)   VALUE
               '263082492500092264106673160154280072632140120'.
           03                          PIC X(45)   VALUE
               '281069312280078282069312280051283066091700090'.
           03                          PIC X(45)   VALUE
               '284066091700054285066091700033286114172900116'.
           03                          PIC X(45)   VALUE
               '287082492500050288090822640197289085802640137'.
           03                          PIC X(45)   VALUE
               '290076642550106291069682140107292062522040077'.
           03                          PIC X(45)   VALUE
               '293057751850056294082492500086295082492500067'.
           03                          PIC X(45)   VALUE
               '296066091700048297066091700027298066091700019'.
           03                          PIC X(45)   VALUE
               '299071522480112300061502220082301055571940060'.
           03                          PIC X(45)   VALUE
               '302061702190069303056732050039304082492500083'.
           03                          PIC X(45)   VALUE
               '305058562260044306087862420102307077672310055'.
           03                          PIC X(45)   VALUE
               '308074312470093309059402040062310051841700042'.
           03                          PIC X(45)   VALUE
               '311073052290035312053361970049313054722030031'.
           03                          PIC X(45)   VALUE
               '314081232310118315071142160073316062431890047'.
           03                          PIC X(45)   VALUE
               '326186463620281327155453520168328054722030072'.
           03                          PIC X(45)   VALUE
               '329155453520253330155453520146331054722030087'.
           03                          PIC X(45)   VALUE
               '332150573610226333133093070130334082492500086'.
           03                          PIC X(45)   VALUE
               '335155453520229336073052290146337073052290093'.
           03                          PIC X(45)   VALUE
               '338088842410167339076672220108340068561990066'.
           03                          PIC X(45)   VALUE
               '341088842410120342076672220068343068561990034'.
           03                          PIC X(45)   VALUE
               '344088842410191345076672220109346068561990074'.
           03                          PIC X(45)   VALUE
               '347114172900138348082492500089349054722030047'.
           03                          PIC X(45)   VALUE
               '350155453520136351114172900074352082492500037'.
           03                          PIC X(45)   VALUE
               '353082492500145354082492500082355082492500044'.
           03                          PIC X(45)   VALUE
               '356150573610225357133093070133358082492500076'.
           03                          PIC X(45)   VALUE
               '368114172900105369114172900071370114172900052'.
           03                          PIC X(45)   VALUE
               '371088842410141372076672220106373068561990077'.
           03                          PIC X(45)   VALUE
               '374083402290144375075631970097376054722030065'.
           03                          PIC X(45)   VALUE
               '377070322250103378063342150068379054722030052'.
           03                          PIC X(45)   VALUE
               '380082492500114381082492500079382073052290055'.
           03                          PIC X(45)   VALUE
               '383082492500091384073052290059385088742460144'.
           03                          PIC X(45)   VALUE
               '386076552290090387076552290069388089672280120'.
           03                          PIC X(45)   VALUE
               '389078932190080390078932190055391085092440087'.
           03                          PIC X(45)   VALUE
               '392069432040055393099152550114394085232200077'.
           03                          PIC X(45)   VALUE
               '395072142090053405155453520290406155453520160'.
           03                          PIC X(45)   VALUE
               '407114172900092408155453520237409155453520154'.
           03                          PIC X(45)   VALUE
               '410155453520106411114172900203412114172900135'.
           03                          PIC X(45)   VALUE
               '413114172900093414114172900184415114172900116'.
           03                          PIC X(45)   VALUE
               '416114172900075417155453520135418114172900090'.
           03                          PIC X(45)   VALUE
               '419114172900050420114172900242421082492500129'.
           03                          PIC X(45)   VALUE
               '422082492500073423114172900242424082492500171'.
           03                          PIC X(45)   VALUE
               '425082492500092432062231900111433062231900077'.
           03                          PIC X(45)   VALUE
               '434054722030057435074222020126436070861960095'.
           03                          PIC X(45)   VALUE
               '437070861960071438100572430125439084372190085'.
           03                          PIC X(45)   VALUE
               '440072041880059441075882180113442069252120081'.
           03                          PIC X(45)   VALUE
               '443069252120060444081812400107445069772170076'.
           03                          PIC X(45)   VALUE
               '446054722030052453155453520249454155453520127'.
           03                          PIC X(45)   VALUE
               '455155453520071456155453520249457155453520116'.
           03                          PIC X(45)   VALUE
               '458155453520068459155453520147460155453520064'.
           03                          PIC X(45)   VALUE
               '461155453520126462114172900058463135143880274'.
           03                          PIC X(45)   VALUE
               '464119063630168465107472960100466155453520145'.
           03                          PIC X(45)   VALUE
               '467155453520080468155453520055469155453520126'.
           03                          PIC X(45)   VALUE
               '470155453520054471155453520173472155453520070'.
           03                          PIC X(45)   VALUE
               '473155453520029474133383660204475113903270139'.
           03                          PIC X(45)   VALUE
               '476113903270080477155453520207478114172900119'.
           03                          PIC X(45)   VALUE
               '479114172900043480155453520141481155453520084'.
           03                          PIC X(45)   VALUE
               '482114172900068483155453520066484114172900036'.
           03                          PIC X(45)   VALUE
               '485155453520189486114172900123487114172900085'.
           03                          PIC X(45)   VALUE
               '488155453520078489155453520047490114172900076'.
           03                          PIC X(45)   VALUE
               '491114172900034492155453520136493114172900082'.
           03                          PIC X(45)   VALUE
               '494082492500051495136503810182496119813680098'.
           03                          PIC X(45)   VALUE
               '497114172900049498155453520134499073052290049'.
           03                          PIC X(45)   VALUE
               '500132123520188501129033070096502082492500045'.
           03                          PIC X(45)   VALUE
               '503114172900146504082492500105505054722030053'.
           03                          PIC X(45)   VALUE
               '506073052290050507082492500084508082492500030'.
           03                          PIC X(45)   VALUE
               '509054722030042510114172900107511114172900062'.
           03                          PIC X(45)   VALUE
               '512054722030031513155453520084514073052290040'.
           03                          PIC X(45)   VALUE
               '515132303480181516114172900101517082492500045'.
           03                          PIC X(45)   VALUE
               '533082492500112534073052290063535073052290101'.
           03                          PIC X(45)   VALUE
               '536059982370060537054722030073538054722030048'.
           03                          PIC X(45)   VALUE
               '539090132970162540081072870113541077872690089'.
           03                          PIC X(45)   VALUE
               '542073592170140543063472130094544054722030068'.
           03                          PIC X(45)   VALUE
               '545085012390147546064922070087547054722030061'.
           03                          PIC X(45)   VALUE
               '548085842820150549073472640098550067042350072'.
           03                          PIC X(45)   VALUE
               '551073052660116552060222280065553082492500096'.
           03                          PIC X(45)   VALUE
               '554048222050058555073052290078556073052290050'.
           03                          PIC X(45)   VALUE
               '557081772590110558069192140066559071572620119'.
           03                          PIC X(45)   VALUE
               '560063932460075561058892170042562114172900104'.
           03                          PIC X(45)   VALUE
               '563054722030057564081342490116565073822480081'.
           03                          PIC X(45)   VALUE
               '566068622210059573130683800222574115673710149'.
           03                          PIC X(45)   VALUE
               '575099383170094576155453520203577114172900099'.
           03                          PIC X(45)   VALUE
               '578073052290054579127933680185580110013480090'.
           03                          PIC X(45)   VALUE
               '581091002990039582155453520043583155453520026'.
           03                          PIC X(45)   VALUE
               '584114172900095585114172900032592088752710142'.
           03                          PIC X(45)   VALUE
               '593078772680100594073422430077595075252450132'.
           03                          PIC X(45)   VALUE
               '596061552380076597082492500137598073052290090'.
           03                          PIC X(45)   VALUE
               '599073052290057600073052290085601073052290060'.
           03                          PIC X(45)   VALUE
               '602066432250111603055281940073604082492500088'.
           03                          PIC X(45)   VALUE
               '605056852120054606083242320095607067762260059'.
           03                          PIC X(45)   VALUE
               '614120083310116615073052290051616145054100242'.
           03                          PIC X(45)   VALUE
               '617124143330145618082492500099619082492500146'.
           03                          PIC X(45)   VALUE
               '620082492500063621082492500036622114623560211'.
           03                          PIC X(45)   VALUE
               '623101973220135624082492500094625133853660124'.
           03                          PIC X(45)   VALUE
               '626120083310050627073052290021628133853660201'.
           03                          PIC X(45)   VALUE
               '629120083310143630073052290084637077262580098'.
           03                          PIC X(45)   VALUE
               '638067572400067639060642060047640078792320091'.
           03                          PIC X(45)   VALUE
               '641068892200060642073052290083643073582490124'.
           03                          PIC X(45)   VALUE
               '644073582490086645054722030061653114172900242'.
           03                          PIC X(45)   VALUE
               '654073052290147655054722030100656082492500168'.
           03                          PIC X(45)   VALUE
               '657082492500092658082492500057659114172900185'.
           03                          PIC X(45)   VALUE
               '660073052290106661054722030051662082492500177'.
           03                          PIC X(45)   VALUE
               '663082492500085664155453520030665082492500202'.
           03                          PIC X(45)   VALUE
               '666082492500107667114172900040668155453520144'.
           03                          PIC X(45)   VALUE
               '669155453520070670082492500037671073052290096'.
           03                          PIC X(45)   VALUE
               '672054722030038673132553360176674125573060111'.
           03                          PIC X(45)   VALUE
               '675114172900027682085532360121683077522180090'.
           03                          PIC X(45)   VALUE
               '684071212050059685077262600054686089332360132'.
           03                          PIC X(45)   VALUE
               '687073052290085688054722030051689066242290099'.
           03                          PIC X(45)   VALUE
               '690056552020066691155453520066692155453520034'.
           03                          PIC X(45)   VALUE
               '693073052290084694073052290039695082492500091'.
           03                          PIC X(45)   VALUE
               '696054722030050697054722030051698079192260109'.
           03                          PIC X(45)   VALUE
               '699072932210077700060521960054707073052290069'.
           03                          PIC X(45)   VALUE
               '708054722030035709114172900103710114172900027'.
           03                          PIC X(45)   VALUE
               '711114172900132712114172900046713155453520065'.
           03                          PIC X(45)   VALUE
               '714054722030029715155453520101716155453520020'.
           03                          PIC X(45)   VALUE
               '717114172900124718054722030041722082492500121'.
           03                          PIC X(45)   VALUE
               '723073052290086724054722030053725114172900090'.
           03                          PIC X(45)   VALUE
               '726054722030055727077542590104728061722080062'.
           03                          PIC X(45)   VALUE
               '729103192660084730073052290049734114172900118'.
           03                          PIC X(45)   VALUE
               '735054722030053736114172900215737082492500110'.
           03                          PIC X(45)   VALUE
               '738054722030056739114172900159740082492500077'.
           03                          PIC X(45)   VALUE
               '741054722030045742082492500069743054722030033'.
           03                          PIC X(45)   VALUE
               '744082492500093745082492500038746082492500064'.
           03                          PIC X(45)   VALUE
               '747082492500028748082492500026749082492500163'.
           03                          PIC X(45)   VALUE
               '750082492500051754114172900147755082492500091'.
           03                          PIC X(45)   VALUE
               '756054722030051757083752260139758083172720095'.
           03                          PIC X(45)   VALUE
               '759054722030072760114172900060761054722030038'.
           03                          PIC X(45)   VALUE
               '765082492500074766073052290043767073052290041'.
           03                          PIC X(45)   VALUE
               '768073052290089769073052290086770073052290035'.
           03                          PIC X(45)   VALUE
               '774073052290045775073052290031776114172900054'.
           03                          PIC X(45)   VALUE
               '777073052290030778054722030042779054722030036'.
           03                          PIC X(45)   VALUE
               '780054722030027781114172900059782054722030036'.
           03                          PIC X(45)   VALUE
               '789054722030015790054722030169791114172900133'.
           03                          PIC X(45)   VALUE
               '792054722030086793114172900176794114172900017'.
           03                          PIC X(45)   VALUE
               '795054722030031799114172900235800082492500130'.
           03                          PIC X(45)   VALUE
               '801082492500075802155453520214803073052290108'.
           03                          PIC X(45)   VALUE
               '804073052290052808080092070128809080092070079'.
           03                          PIC X(45)   VALUE
               '810080092070062811066552320090812056991950059'.
           03                          PIC X(45)   VALUE
               '813080152150083814074742260117815073052290078'.
           03                          PIC X(45)   VALUE
               '816073052290053820082492500208821082492500133'.
           03                          PIC X(45)   VALUE
               '822082492500059823114172900242824114172900148'.
           03                          PIC X(45)   VALUE
               '825054722030078826082492500208827082492500124'.
           03                          PIC X(45)   VALUE
               '828082492500059829155453520178830155453520055'.
           03                          PIC X(45)   VALUE
               '834114172900242835082492500135836054722030080'.
           03                          PIC X(45)   VALUE
               '837155453520293838082492500137839155453520091'.
           03                          PIC X(45)   VALUE
               '840087182080161841080262010107842073052290069'.
           03                          PIC X(45)   VALUE
               '843114172900145844114172900097845114172900068'.
           03                          PIC X(45)   VALUE
               '846167883740138847143502760050848073052290046'.
           03                          PIC X(45)   VALUE
               '849089942350095853176873810276854143813080174'.
           03                          PIC X(45)   VALUE
               '855073052290122856144703610265857118863150141'.
           03                          PIC X(45)   VALUE
               '858111092840095862086702520134863074782340082'.
           03                          PIC X(45)   VALUE
               '864073052290064865078232180110866064312120054'.
           03                          PIC X(45)   VALUE
               '867109542360162868088692200093869054722030068'.
           03                          PIC X(45)   VALUE
               '870195053050236871082992350130872073402190091'.
           03                          PIC X(45)   VALUE
               '876073052290191880054722030050881054722030066'.
           03                          PIC X(45)   VALUE
               '882054722030069883054722030118884048832330083'.
           03                          PIC X(45)   VALUE
               '885041402380123886054722030094887054722030071'.
           03                          PIC X(45)   VALUE
               '894054722030045895054722030168896082492500106'.
           03                          PIC X(45)   VALUE
               '897054722030064901133953520237902116053350129'.
           03                          PIC X(45)   VALUE
               '903073052290079904133514080188905073052290077'.
           03                          PIC X(45)   VALUE
               '906054722030049907166223680194908139663410113'.
           03                          PIC X(45)   VALUE
               '909082492500057913084622690100914064482190053'.
           03                          PIC X(45)   VALUE
               '915054722030075916054722030032917073052290083'.
           03                          PIC X(45)   VALUE
               '918073052290042919098582630101920085182460068'.
           03                          PIC X(45)   VALUE
               '921075112300045922054722030100923054722030050'.
           03                          PIC X(45)   VALUE
               '927155453520293928114172900242929073052290131'.
           03                          PIC X(45)   VALUE
               '933155453520085934069982420111935075252490088'.
           03                          PIC X(45)   VALUE
               '939125003380189940110663380105941097192880048'.
           03                          PIC X(45)   VALUE
               '945058672220163946049351890117947063402270079'.
           03                          PIC X(45)   VALUE
               '948056422340053949066932210061950057351850051'.
           03                          PIC X(45)   VALUE
               '951158372620050955155453520219956073052290144'.
           03                          PIC X(45)   VALUE
               '957155453520291958114172900179959114172900099'.
           03                          PIC X(45)   VALUE
               '963155453520165964073052290102965054722030065'.
           03                          PIC X(45)   VALUE
               '969155453520293970155453520158974089082190175'.
           03                          PIC X(45)   VALUE
               '975074922130115976073821800077977073052290083'.
           03                          PIC X(45)   VALUE
               '981223394200246982182773760163983114172900090'.
           03                          PIC X(45)   VALUE
               '984155453520237985114172900166986114172900085'.
           03                          PIC X(45)   VALUE
               '987169723790219988133863320132989082492500067'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 735 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
               05  WWM-IPTHRESH        PIC 9(3)V9(1).
