       01  W-DRG-FILLS.
           03                          PIC X(45)   VALUE
               '003419036270507004288754310359011163653450216'.
           03                          PIC X(45)   VALUE
               '012163653450153013053731640100014061452020168'.
           03                          PIC X(45)   VALUE
               '016115402710226017061452020168020085662380198'.
           03                          PIC X(45)   VALUE
               '021073372420202022073372420133023078812290191'.
           03                          PIC X(45)   VALUE
               '024078812290107025115402710156026115402710100'.
           03                          PIC X(45)   VALUE
               '027115402710052028163653450200029115402710106'.
           03                          PIC X(45)   VALUE
               '030064172240053031163653450183032064172240076'.
           03                          PIC X(45)   VALUE
               '033064172240038034078812290113035078812290045'.
           03                          PIC X(45)   VALUE
               '036078812290021037163653450136038078812290053'.
           03                          PIC X(45)   VALUE
               '039049591770022040130123320181041108773090098'.
           03                          PIC X(45)   VALUE
               '042078812290056052129013760090053129013760054'.
           03                          PIC X(45)   VALUE
               '054078812290086055062142030065056083002550112'.
           03                          PIC X(45)   VALUE
               '057061922380073058078812290113059062142030071'.
           03                          PIC X(45)   VALUE
               '060049591770054061086322220120062070112350071'.
           03                          PIC X(45)   VALUE
               '063049591770049064085662380103065073372420065'.
           03                          PIC X(45)   VALUE
               '066073372420043067049591770086068049591770046'.
           03                          PIC X(45)   VALUE
               '069049591770038070086322220104071070112350070'.
           03                          PIC X(45)   VALUE
               '072049591770044073100302510084074064172240060'.
           03                          PIC X(45)   VALUE
               '075078812290104076049591770058077115402710094'.
           03                          PIC X(45)   VALUE
               '078049591770062079049591770041080049591770083'.
           03                          PIC X(45)   VALUE
               '081049591770055082115402710089083078812290068'.
           03                          PIC X(45)   VALUE
               '084062142030040085104092850107086059242160064'.
           03                          PIC X(45)   VALUE
               '087049591770040088049591770083089049591770051'.
           03                          PIC X(45)   VALUE
               '090049591770033091090252400094092070172300061'.
           03                          PIC X(45)   VALUE
               '093062142030041094103142740179095086342620122'.
           03                          PIC X(45)   VALUE
               '096062142030084097085102370179098058931880111'.
           03                          PIC X(45)   VALUE
               '099058931880076100080302370089101062142030050'.
           03                          PIC X(45)   VALUE
               '102078812290063103062142030044113163653450085'.
           03                          PIC X(45)   VALUE
               '114049591770049115049591770073116078812290074'.
           03                          PIC X(45)   VALUE
               '117049591770034121062142030079122049591770059'.
           03                          PIC X(45)   VALUE
               '123049591770037124078812290073125049591770048'.
           03                          PIC X(45)   VALUE
               '129078812290087130078812290043131078812290093'.
           03                          PIC X(45)   VALUE
               '132053731640042133115402710088134053731640036'.
           03                          PIC X(45)   VALUE
               '135053731640097136053731640036137163653450078'.
           03                          PIC X(45)   VALUE
               '138053731640036139078812290031146159993210134'.
           03                          PIC X(45)   VALUE
               '147078812290087148078812290049149078812290037'.
           03                          PIC X(45)   VALUE
               '150075842140079151062142030042152075842140070'.
           03                          PIC X(45)   VALUE
               '153062142030050154088102100088155053731640061'.
           03                          PIC X(45)   VALUE
               '156053731640044157091852700103158078812290060'.
           03                          PIC X(45)   VALUE
               '159078812290038163222573730208164163653450102'.
           03                          PIC X(45)   VALUE
               '165163653450060166244424060176167135912860106'.
           03                          PIC X(45)   VALUE
               '168078812290063175077962080099176051281750066'.
           03                          PIC X(45)   VALUE
               '177087032240122178067991910094179051421670069'.
           03                          PIC X(45)   VALUE
               '180062991650112181062142030078182049591770051'.
           03                          PIC X(45)   VALUE
               '183049591770096184049591770062185049591770043'.
           03                          PIC X(45)   VALUE
               '186084292100099187062142030072188049591770050'.
           03                          PIC X(45)   VALUE
               '189090982160079190074931980079191059671720065'.
           03                          PIC X(45)   VALUE
               '192049581460051193075402000094194059591790069'.
           03                          PIC X(45)   VALUE
               '195049651480052196074281960109197069731930072'.
           03                          PIC X(45)   VALUE
               '198049591770052199078182080120200062142030070'.
           03                          PIC X(45)   VALUE
               '201049591770050202060571780061203049591770046'.
           03                          PIC X(45)   VALUE
               '204084752260042205090992150085206069921880049'.
           03                          PIC X(45)   VALUE
               '207192793180210208107282120117215115402710226'.
           03                          PIC X(45)   VALUE
               '216115402710226217115402710150218115402710113'.
           03                          PIC X(45)   VALUE
               '219163653450183220163653450103221078812290079'.
           03                          PIC X(45)   VALUE
               '222163653450185223078812290102224163653450155'.
           03                          PIC X(45)   VALUE
               '225078812290078226163653450148227163653450056'.
           03                          PIC X(45)   VALUE
               '228145453230209229122583030112230078812290074'.
           03                          PIC X(45)   VALUE
               '231163653450191232078812290123233163653450192'.
           03                          PIC X(45)   VALUE
               '234078812290117235163653450150236078812290088'.
           03                          PIC X(45)   VALUE
               '237163653450169238078812290060239160573670212'.
           03                          PIC X(45)   VALUE
               '240112123310136241062142030080242163653450119'.
           03                          PIC X(45)   VALUE
               '243078812290071244078812290045245078812290079'.
           03                          PIC X(45)   VALUE
               '246115402710087247078812290038248115402710105'.
           03                          PIC X(45)   VALUE
               '249078812290046250163653450114251078812290047'.
           03                          PIC X(45)   VALUE
               '252145453230133253122583030090254078812290044'.
           03                          PIC X(45)   VALUE
               '255146373530137256115402710103257078812290064'.
           03                          PIC X(45)   VALUE
               '258049591770101259049591770055260163653450174'.
           03                          PIC X(45)   VALUE
               '261049591770075263078812290093264111362980140'.
           03                          PIC X(45)   VALUE
               '265163653450068266115402710167267115402710086'.
           03                          PIC X(45)   VALUE
               '280078792160096281055991820058282049591770037'.
           03                          PIC X(45)   VALUE
               '283100062050077284049591770037285049591770022'.
           03                          PIC X(45)   VALUE
               '286115402710110287115402710050288109772680152'.
           03                          PIC X(45)   VALUE
               '289078802410110290062142030080291082252140094'.
           03                          PIC X(45)   VALUE
               '292058181890069293050901700047294078812290080'.
           03                          PIC X(45)   VALUE
               '295057872050057296082252140041297058181890022'.
           03                          PIC X(45)   VALUE
               '298050901700015299079602290091300057872050070'.
           03                          PIC X(45)   VALUE
               '301057872050051302089042330061303058411810035'.
           03                          PIC X(45)   VALUE
               '304062142030066305062142030039306097712380083'.
           03                          PIC X(45)   VALUE
               '307078812290049308073492040078309050011790051'.
           03                          PIC X(45)   VALUE
               '310049591770034311049591770033312062142030046'.
           03                          PIC X(45)   VALUE
               '313078812290032314096232360110315068402150062'.
           03                          PIC X(45)   VALUE
               '316062142030037326167733540235327078812290129'.
           03                          PIC X(45)   VALUE
               '328078812290054329168423990226330115402710125'.
           03                          PIC X(45)   VALUE
               '331092002470069332115402710200333115402710111'.
           03                          PIC X(45)   VALUE
               '334092002470065335163653450207336163653450131'.
           03                          PIC X(45)   VALUE
               '337092002470079338091402330146339071872120092'.
           03                          PIC X(45)   VALUE
               '340062142030053341091402330104342071872120055'.
           03                          PIC X(45)   VALUE
               '343062142030027344163653450179345071872120096'.
           03                          PIC X(45)   VALUE
               '346062142030062347115402710143348115402710081'.
           03                          PIC X(45)   VALUE
               '349115402710047350091402330126351071872120070'.
           03                          PIC X(45)   VALUE
               '352062142030038353091402330137354071872120080'.
           03                          PIC X(45)   VALUE
               '355062142030049356155563540185357092002470107'.
           03                          PIC X(45)   VALUE
               '358092002470063368115402710102369078812290063'.
           03                          PIC X(45)   VALUE
               '370062142030044371091402330125372071872120086'.
           03                          PIC X(45)   VALUE
               '373062142030062374107842540129375062142030084'.
           03                          PIC X(45)   VALUE
               '376049591770056377085342290096378051781740059'.
           03                          PIC X(45)   VALUE
               '379049591770041380091862370110381078812290067'.
           03                          PIC X(45)   VALUE
               '382049591770048383115402710082384062142030052'.
           03                          PIC X(45)   VALUE
               '385101942370125386062142030076387049591770056'.
           03                          PIC X(45)   VALUE
               '388092832320112389074582150068390049591770048'.
           03                          PIC X(45)   VALUE
               '391082522200080392059641900053393102172570106'.
           03                          PIC X(45)   VALUE
               '394072032130067395049591770045405163653450236'.
           03                          PIC X(45)   VALUE
               '406078812290122407078812290077408163653450189'.
           03                          PIC X(45)   VALUE
               '409078812290117410078812290079411163653450180'.
           03                          PIC X(45)   VALUE
               '412163653450113413163653450079414163653450164'.
           03                          PIC X(45)   VALUE
               '415163653450098416078812290063417163653450115'.
           03                          PIC X(45)   VALUE
               '418078812290075419078812290046420163653450191'.
           03                          PIC X(45)   VALUE
               '421163653450091422163653450051423163653450215'.
           03                          PIC X(45)   VALUE
               '424078812290127425078812290068432072442000098'.
           03                          PIC X(45)   VALUE
               '433049591770064434049591770045435078812290109'.
           03                          PIC X(45)   VALUE
               '436078812290079437078812290056438100782400111'.
           03                          PIC X(45)   VALUE
               '439069352050069440062142030049441083052210110'.
           03                          PIC X(45)   VALUE
               '442061481950066443061481950047444082002170097'.
           03                          PIC X(45)   VALUE
               '445060381970066446049591770044453163653450181'.
           03                          PIC X(45)   VALUE
               '454163653450088455163653450053456115402710182'.
           03                          PIC X(45)   VALUE
               '457115402710096458115402710056459163653450130'.
           03                          PIC X(45)   VALUE
               '460163653450052461163653450113462163653450050'.
           03                          PIC X(45)   VALUE
               '463142553860225464112973310120465078812290075'.
           03                          PIC X(45)   VALUE
               '466163653450123467163653450061468049591770042'.
           03                          PIC X(45)   VALUE
               '469163653450107470049591770044471163653450147'.
           03                          PIC X(45)   VALUE
               '472163653450054473115402710025474146693620174'.
           03                          PIC X(45)   VALUE
               '475112172920115476062142030062477143303550161'.
           03                          PIC X(45)   VALUE
               '478143303550105479143303550067480163653450119'.
           03                          PIC X(45)   VALUE
               '481163653450069482049591770057483115402710036'.
           03                          PIC X(45)   VALUE
               '485163653450144486163653450092487115402710069'.
           03                          PIC X(45)   VALUE
               '488078812290062489078812290039492163653450123'.
           03                          PIC X(45)   VALUE
               '493078812290070494049591770048495149153940155'.
           03                          PIC X(45)   VALUE
               '496105193070081497105193070042498163653450115'.
           03                          PIC X(45)   VALUE
               '499105193070044500132213460166501109303220088'.
           03                          PIC X(45)   VALUE
               '502078812290047503137022850134504112892970091'.
           03                          PIC X(45)   VALUE
               '505078812290054506062142030069507163653450082'.
           03                          PIC X(45)   VALUE
               '508078812290040509115402710073510163653450090'.
           03                          PIC X(45)   VALUE
               '511109303220059512078812290036513078812290077'.
           03                          PIC X(45)   VALUE
               '514062142030042515161973560147516115402710084'.
           03                          PIC X(45)   VALUE
               '517115402710052518163653450111519078812290064'.
           03                          PIC X(45)   VALUE
               '520078812290033533163653450093534049591770055'.
           03                          PIC X(45)   VALUE
               '535062142030081536049591770052537049591770063'.
           03                          PIC X(45)   VALUE
               '538049591770047539104033020127540082462710092'.
           03                          PIC X(45)   VALUE
               '541070862410070542093502500126543062142030080'.
           03                          PIC X(45)   VALUE
               '544049591770056545085322400139546078812290078'.
           03                          PIC X(45)   VALUE
               '547049591770053548095142750126549072392540086'.
           03                          PIC X(45)   VALUE
               '550048632150061551106952880098552064302220060'.
           03                          PIC X(45)   VALUE
               '553115402710084554062142030055555078812290082'.
           03                          PIC X(45)   VALUE
               '556049591770050557091372470095558068062280061'.
           03                          PIC X(45)   VALUE
               '559092002640111560078892530069561058972160039'.
           03                          PIC X(45)   VALUE
               '562062142030086563062142030053564082962260099'.
           03                          PIC X(45)   VALUE
               '565065882210068566062142030048570117413400145'.
           03                          PIC X(45)   VALUE
               '571082052620096572049591770067573157024280207'.
           03                          PIC X(45)   VALUE
               '574103163100149575103163100090576163653450195'.
           03                          PIC X(45)   VALUE
               '577078812290091578049591770055579115553270147'.
           03                          PIC X(45)   VALUE
               '580087002680088581078812290044582087002680044'.
           03                          PIC X(45)   VALUE
               '583078812290028584115402710083585062142030039'.
           03                          PIC X(45)   VALUE
               '592081982520104593065192270079594062142030061'.
           03                          PIC X(45)   VALUE
               '595082082290123596051832010072597062142030116'.
           03                          PIC X(45)   VALUE
               '598049591770081599049591770048600079022260074'.
           03                          PIC X(45)   VALUE
               '601049591770051602074912170098603054031840064'.
           03                          PIC X(45)   VALUE
               '604086642320081605067202210049606084182330095'.
           03                          PIC X(45)   VALUE
               '607058991990055614106603010088615106603010038'.
           03                          PIC X(45)   VALUE
               '616147963730198617116393140110618049591770077'.
           03                          PIC X(45)   VALUE
               '619163653450099620092002470046621092002470028'.
           03                          PIC X(45)   VALUE
               '622122503410198623101013000106624062142030068'.
           03                          PIC X(45)   VALUE
               '625135133470117626106603010047627106603010020'.
           03                          PIC X(45)   VALUE
               '628135133470157629106603010114630078812290066'.
           03                          PIC X(45)   VALUE
               '637096762640086638076962420057639049591770040'.
           03                          PIC X(45)   VALUE
               '640086702280071641063581990052642062142030072'.
           03                          PIC X(45)   VALUE
               '643089872330107644062142030072645049591770052'.
           03                          PIC X(45)   VALUE
               '653115402710226654062142030127655062142030085'.
           03                          PIC X(45)   VALUE
               '656062142030143657062142030079658062142030044'.
           03                          PIC X(45)   VALUE
               '659163653450162660062142030089661062142030041'.
           03                          PIC X(45)   VALUE
               '662115402710169663049591770084664049591770037'.
           03                          PIC X(45)   VALUE
               '665163653450191666115402710105667049591770043'.
           03                          PIC X(45)   VALUE
               '668115402710141669062142030064670062142030039'.
           03                          PIC X(45)   VALUE
               '671115402710091672115402710034673132502990176'.
           03                          PIC X(45)   VALUE
               '674102682680116675049591770046682092042340099'.
           03                          PIC X(45)   VALUE
               '683071842060068684049591770044685095142500057'.
           03                          PIC X(45)   VALUE
               '686062142030115687062142030073688062142030041'.
           03                          PIC X(45)   VALUE
               '689068502140079690049641830058691078812290061'.
           03                          PIC X(45)   VALUE
               '692049591770033693062142030082694049591770036'.
           03                          PIC X(45)   VALUE
               '695062142030085696049591770047697049591770054'.
           03                          PIC X(45)   VALUE
               '698085122280100699059371840069700049591770050'.
           03                          PIC X(45)   VALUE
               '707102682680061708049591770023709115402710110'.
           03                          PIC X(45)   VALUE
               '710115402710031711115402710136712115402710057'.
           03                          PIC X(45)   VALUE
               '713115402710078714049591770031715062142030113'.
           03                          PIC X(45)   VALUE
               '716062142030025717115402710105718049591770046'.
           03                          PIC X(45)   VALUE
               '722115402710119723115402710077724115402710048'.
           03                          PIC X(45)   VALUE
               '725078812290088726062142030051727071412080098'.
           03                          PIC X(45)   VALUE
               '728054241860060729079852450074730049591770046'.
           03                          PIC X(45)   VALUE
               '734115402710108735115402710035736115402710197'.
           03                          PIC X(45)   VALUE
               '737078812290092738078812290050739135133470150'.
           03                          PIC X(45)   VALUE
               '740106603010064741078812290032742115402710063'.
           03                          PIC X(45)   VALUE
               '743115402710029744163653450095745115402710036'.
           03                          PIC X(45)   VALUE
               '746163653450074747115402710028748115402710029'.
           03                          PIC X(45)   VALUE
               '749115402710137750115402710044754078812290137'.
           03                          PIC X(45)   VALUE
               '755078812290079756062142030047757090782440113'.
           03                          PIC X(45)   VALUE
               '758063682050083759062142030059760115402710056'.
           03                          PIC X(45)   VALUE
               '761115402710032765115402710065766115402710040'.
           03                          PIC X(45)   VALUE
               '767115402710042768115402710047769115402710088'.
           03                          PIC X(45)   VALUE
               '770115402710032774115402710043775115402710031'.
           03                          PIC X(45)   VALUE
               '776115402710055777115402710033778115402710047'.
           03                          PIC X(45)   VALUE
               '779115402710028780115402710019781115402710060'.
           03                          PIC X(45)   VALUE
               '782115402710034789115402710018790115402710179'.
           03                          PIC X(45)   VALUE
               '791115402710133792115402710086793115402710226'.
           03                          PIC X(45)   VALUE
               '794115402710034795115402710031799155563540195'.
           03                          PIC X(45)   VALUE
               '800092002470111801092002470055802115402710172'.
           03                          PIC X(45)   VALUE
               '803078812290095804078812290049808089872090130'.
           03                          PIC X(45)   VALUE
               '809078812290074810061452020051811080622120078'.
           03                          PIC X(45)   VALUE
               '812061452020053813097132300079814115402710111'.
           03                          PIC X(45)   VALUE
               '815078812290067816049591770045820078812290191'.
           03                          PIC X(45)   VALUE
               '821078812290106822078812290043823163653450239'.
           03                          PIC X(45)   VALUE
               '824078812290127825078812290064826115402710226'.
           03                          PIC X(45)   VALUE
               '827078812290108828078812290055829115402710174'.
           03                          PIC X(45)   VALUE
               '830078812290048834115402710226835062142030123'.
           03                          PIC X(45)   VALUE
               '836049591770063837115402710226838115402710152'.
           03                          PIC X(45)   VALUE
               '839078812290080840096802260177841078812290100'.
           03                          PIC X(45)   VALUE
               '842049591770062843115402710121844078812290087'.
           03                          PIC X(45)   VALUE
               '845049591770061846148373210126847118852690057'.
           03                          PIC X(45)   VALUE
               '848118852690047849090902440093853169393660227'.
           03                          PIC X(45)   VALUE
               '854103082850125855103082850076856147793430214'.
           03                          PIC X(45)   VALUE
               '857098472890109858078812290072862097572470114'.
           03                          PIC X(45)   VALUE
               '863071232250070864115402710055865087162200092'.
           03                          PIC X(45)   VALUE
               '866062142030053867106162290155868085502140077'.
           03                          PIC X(45)   VALUE
               '869049591770050870206642970216871088952290109'.
           03                          PIC X(45)   VALUE
               '872059661950073876078812290191880049591770047'.
           03                          PIC X(45)   VALUE
               '881062142030070882062142030071883062142030119'.
           03                          PIC X(45)   VALUE
               '884051522450090885049012310118886049591770092'.
           03                          PIC X(45)   VALUE
               '887049591770068894049591770045895046702540200'.
           03                          PIC X(45)   VALUE
               '896078812290105897062142030062901140123350213'.
           03                          PIC X(45)   VALUE
               '902086592760110903049591770069904145723710174'.
           03                          PIC X(45)   VALUE
               '905049591770075906115402710051907162153570168'.
           03                          PIC X(45)   VALUE
               '908096882910092909049591770052913082332440076'.
           03                          PIC X(45)   VALUE
               '914057642080046915062142030081916049591770030'.
           03                          PIC X(45)   VALUE
               '917078812290076918049591770042919116142770096'.
           03                          PIC X(45)   VALUE
               '920077582400062921062142030042922115402710090'.
           03                          PIC X(45)   VALUE
               '923062142030047927078812290191928078812290191'.
           03                          PIC X(45)   VALUE
               '929078812290124933115402710073934065412140094'.
           03                          PIC X(45)   VALUE
               '935071752270079939131863320153940095533010086'.
           03                          PIC X(45)   VALUE
               '941078812290045945066212050164946040631630115'.
           03                          PIC X(45)   VALUE
               '947071282140076948052661890051949073112220072'.
           03                          PIC X(45)   VALUE
               '950043361630051951122192540065955115402710202'.
           03                          PIC X(45)   VALUE
               '957115402710226958115402710140959115402710090'.
           03                          PIC X(45)   VALUE
               '963163653450142964115402710082965078812290055'.
           03                          PIC X(45)   VALUE
               '969163653450280970078812290117974104302290153'.
           03                          PIC X(45)   VALUE
               '975054941620092976054941620062977065921920074'.
           03                          PIC X(45)   VALUE
               '981218503930213982105092850122983049591770059'.
           03                          PIC X(45)   VALUE
               '984163653450216985163653450115986062142030053'.
           03                          PIC X(45)   VALUE
               '987162363570183988100902860106989100902860049'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 741 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
               05  WWM-IPTHRESH        PIC 9(3)V9(1).
