       01  W-DRG-FILLS.
           03                          PIC X(44)   VALUE
               '00347718669004308604450091292131401117960382'.
           03                          PIC X(44)   VALUE
               '01217960382013179603820201796038202117960382'.
           03                          PIC X(44)   VALUE
               '02217960382023129213140241292131402517960382'.
           03                          PIC X(44)   VALUE
               '02617960382027088192520281292131402912921314'.
           03                          PIC X(44)   VALUE
               '03012921314031179603820321796038203317960382'.
           03                          PIC X(44)   VALUE
               '03412921314035129213140361292131403712921314'.
           03                          PIC X(44)   VALUE
               '03812921314039129213140401279634804111156342'.
           03                          PIC X(44)   VALUE
               '04211156342052105153160530881925205410351267'.
           03                          PIC X(44)   VALUE
               '05506753216056082322530570620424005808819252'.
           03                          PIC X(44)   VALUE
               '05906524217060065242170610904323606206189236'.
           03                          PIC X(44)   VALUE
               '06304997195064079982450650635724006604997195'.
           03                          PIC X(44)   VALUE
               '06704997195068049971950690499719507009043236'.
           03                          PIC X(44)   VALUE
               '07106189236072049971950730914724607406277233'.
           03                          PIC X(44)   VALUE
               '07506524217076065242170771292131407806524217'.
           03                          PIC X(44)   VALUE
               '07904997195080081572920810729628208208819252'.
           03                          PIC X(44)   VALUE
               '08306524217084065242170850898726608606795241'.
           03                          PIC X(44)   VALUE
               '08704997195088049971950890499719509004997195'.
           03                          PIC X(44)   VALUE
               '09109504259092071582530930622422009410731292'.
           03                          PIC X(44)   VALUE
               '09509737285096077642760971088726309808819252'.
           03                          PIC X(44)   VALUE
               '09906524217100065432181010629425410206524217'.
           03                          PIC X(44)   VALUE
               '10306524217113088192521140881925211504997195'.
           03                          PIC X(44)   VALUE
               '11608819252117049971951210652421712206524217'.
           03                          PIC X(44)   VALUE
               '12304997195124065242171250499719512913404295'.
           03                          PIC X(44)   VALUE
               '13004997195131179603821321796038213312921314'.
           03                          PIC X(44)   VALUE
               '13412921314135049971951360499719513717960382'.
           03                          PIC X(44)   VALUE
               '13817960382139179603821461340429514710458230'.
           03                          PIC X(44)   VALUE
               '14804997195149049971951500881925215106524217'.
           03                          PIC X(44)   VALUE
               '15208819252153065242171540792222015507206211'.
           03                          PIC X(44)   VALUE
               '15606524217157065242171580652421715904997195'.
           03                          PIC X(44)   VALUE
               '16325722335164129213141650881925216625733419'.
           03                          PIC X(44)   VALUE
               '16719643366168088192521750682321917605620200'.
           03                          PIC X(44)   VALUE
               '17709087229178076092211790640119418008188209'.
           03                          PIC X(44)   VALUE
               '18106468188182064681881830499719518404997195'.
           03                          PIC X(44)   VALUE
               '18504997195186077822051870639020518806390205'.
           03                          PIC X(44)   VALUE
               '18909896240190076742051910638319419205486173'.
           03                          PIC X(44)   VALUE
               '19307908216194065452011950552417419607329201'.
           03                          PIC X(44)   VALUE
               '19705866176198051621591990803722220006066178'.
           03                          PIC X(44)   VALUE
               '20104997195202066901962030499719520408567228'.
           03                          PIC X(44)   VALUE
               '20508494224206073732152072138134620812016235'.
           03                          PIC X(44)   VALUE
               '21508819252216129213142170881925221808819252'.
           03                          PIC X(44)   VALUE
               '21912921314220088192522210881925222217960382'.
           03                          PIC X(44)   VALUE
               '22317960382224179603822251796038222617960382'.
           03                          PIC X(44)   VALUE
               '22717960382228157883422291232928823006524217'.
           03                          PIC X(44)   VALUE
               '23112921314232088192522331292131423408819252'.
           03                          PIC X(44)   VALUE
               '23512921314236088192522371292131423808819252'.
           03                          PIC X(44)   VALUE
               '23915628368240118683412410881925224217960382'.
           03                          PIC X(44)   VALUE
               '24317960382244179603822451796038224612921314'.
           03                          PIC X(44)   VALUE
               '24712921314248129213142491292131425017960382'.
           03                          PIC X(44)   VALUE
               '25117960382252157883422531232928825406524217'.
           03                          PIC X(44)   VALUE
               '25512930338256096853002570499719525812921314'.
           03                          PIC X(44)   VALUE
               '25912921314260129213142610881925226208819252'.
           03                          PIC X(44)   VALUE
               '26304997195264112063102651292131428008051230'.
           03                          PIC X(44)   VALUE
               '28105945208282052011992830832815928408328159'.
           03                          PIC X(44)   VALUE
               '28508328159286129213142870881925228810327261'.
           03                          PIC X(44)   VALUE
               '28908089261290070642432910794922029206470212'.
           03                          PIC X(44)   VALUE
               '29305312188294065242172950652421729608328159'.
           03                          PIC X(44)   VALUE
               '29708328159298083281592990801923430005982220'.
           03                          PIC X(44)   VALUE
               '30105532203302078102183030585020130404997195'.
           03                          PIC X(44)   VALUE
               '30504997195306084592273070758122930808695251'.
           03                          PIC X(44)   VALUE
               '30905891211310047161943110499719531205244197'.
           03                          PIC X(44)   VALUE
               '31304997195314090262303150673421031606194210'.
           03                          PIC X(44)   VALUE
               '32617960382327179603823281796038232923238418'.
           03                          PIC X(44)   VALUE
               '33017960382331179603823321720534333312024300'.
           03                          PIC X(44)   VALUE
               '33412024300335179603823361796038233717960382'.
           03                          PIC X(44)   VALUE
               '33809929251339079642323400611319634109929251'.
           03                          PIC X(44)   VALUE
               '34207964232343061131963441796038234517960382'.
           03                          PIC X(44)   VALUE
               '34617960382347179603823481292131434912921314'.
           03                          PIC X(44)   VALUE
               '35012921314351129213143521292131435317960382'.
           03                          PIC X(44)   VALUE
               '35406524217355065242173561720534335712024300'.
           03                          PIC X(44)   VALUE
               '35812024300368094192113690881925237008819252'.
           03                          PIC X(44)   VALUE
               '37109929251372079642323730611319637409306217'.
           03                          PIC X(44)   VALUE
               '37508038234376065242173770842423837807098238'.
           03                          PIC X(44)   VALUE
               '37906524217380088192523810652421738204997195'.
           03                          PIC X(44)   VALUE
               '38308819252384088192523850828823338607337231'.
           03                          PIC X(44)   VALUE
               '38704997195388098182253890751020939006524217'.
           03                          PIC X(44)   VALUE
               '39108157220392067412093931097725739408117227'.
           03                          PIC X(44)   VALUE
               '39505940221405129213144061292131440712921314'.
           03                          PIC X(44)   VALUE
               '40806524217409065242174100652421741117960382'.
           03                          PIC X(44)   VALUE
               '41217960382413179603824141796038241517960382'.
           03                          PIC X(44)   VALUE
               '41617960382417179603824181796038241917960382'.
           03                          PIC X(44)   VALUE
               '42008819252421088192524220881925242317960382'.
           03                          PIC X(44)   VALUE
               '42408819252425088192524320717520943306524217'.
           03                          PIC X(44)   VALUE
               '43406524217435084482174360505717243704997195'.
           03                          PIC X(44)   VALUE
               '43811099234439077902214400652421744108417231'.
           03                          PIC X(44)   VALUE
               '44207326217443049971954440856222744506258213'.
           03                          PIC X(44)   VALUE
               '44606258213453179603824541796038245517960382'.
           03                          PIC X(44)   VALUE
               '45617960382457179603824581796038245917960382'.
           03                          PIC X(44)   VALUE
               '46017960382461179603824620881925246314570388'.
           03                          PIC X(44)   VALUE
               '46410927340465101133394661292131446712921314'.
           03                          PIC X(44)   VALUE
               '46804997195469179603824701796038247108819252'.
           03                          PIC X(44)   VALUE
               '47208819252473088192524741610338447511441339'.
           03                          PIC X(44)   VALUE
               '47608819252477179603824781292131447912921314'.
           03                          PIC X(44)   VALUE
               '48017960382481129213144820881925248317960382'.
           03                          PIC X(44)   VALUE
               '48408819252485129213144861292131448712921314'.
           03                          PIC X(44)   VALUE
               '48817960382489065242174901292131449112921314'.
           03                          PIC X(44)   VALUE
               '49212921314493129213144940881925249512376350'.
           03                          PIC X(44)   VALUE
               '49612376350497123763504981796038249917960382'.
           03                          PIC X(44)   VALUE
               '50013816367501113633355020881925250312921314'.
           03                          PIC X(44)   VALUE
               '50408819252505088192525061292131450717960382'.
           03                          PIC X(44)   VALUE
               '50817960382509088192525100881925251108819252'.
           03                          PIC X(44)   VALUE
               '51208819252513129213145141292131451514072316'.
           03                          PIC X(44)   VALUE
               '51609400280517094002805330652421753406524217'.
           03                          PIC X(44)   VALUE
               '53508819252536062932695370499719553804997195'.
           03                          PIC X(44)   VALUE
               '53910226303540078812775410710827254208819252'.
           03                          PIC X(44)   VALUE
               '54305832205544049971955450933823554608719255'.
           03                          PIC X(44)   VALUE
               '54704997195548092892635490725726755006244242'.
           03                          PIC X(44)   VALUE
               '55109209266552062272415530652421755405154213'.
           03                          PIC X(44)   VALUE
               '55508819252556049971955570908225455806692230'.
           03                          PIC X(44)   VALUE
               '55908360261560066492475610572522856208819252'.
           03                          PIC X(44)   VALUE
               '56304997195564090712435650666122756606391225'.
           03                          PIC X(44)   VALUE
               '57314392383574111403615750927930157618399376'.
           03                          PIC X(44)   VALUE
               '57708318273578065242175791420536758010807335'.
           03                          PIC X(44)   VALUE
               '58108276301582179603825831796038258406524217'.
           03                          PIC X(44)   VALUE
               '58506524217592097412705930737126259406264247'.
           03                          PIC X(44)   VALUE
               '59508349253596067102245971292131459808819252'.
           03                          PIC X(44)   VALUE
               '59908819252600088192526010499719560207149217'.
           03                          PIC X(44)   VALUE
               '60305472199604084672446050622123860608515245'.
           03                          PIC X(44)   VALUE
               '60705751207614107803266150881925261615181384'.
           03                          PIC X(44)   VALUE
               '61711771331618049971956191796038262017960382'.
           03                          PIC X(44)   VALUE
               '62117960382622136283626231043731162406524217'.
           03                          PIC X(44)   VALUE
               '62512921314626088192526270881925262814146323'.
           03                          PIC X(44)   VALUE
               '62910780326630088192526370952526663807158245'.
           03                          PIC X(44)   VALUE
               '63905965208640086562326410640021564204997195'.
           03                          PIC X(44)   VALUE
               '64307032240644055442116450499719565317960382'.
           03                          PIC X(44)   VALUE
               '65417960382655179603826561796038265717960382'.
           03                          PIC X(44)   VALUE
               '65817960382659129213146601292131466106524217'.
           03                          PIC X(44)   VALUE
               '66217960382663065242176640652421766508819252'.
           03                          PIC X(44)   VALUE
               '66608819252667088192526680881925266906524217'.
           03                          PIC X(44)   VALUE
               '67006524217671065242176720652421767314875340'.
           03                          PIC X(44)   VALUE
               '67411752291675117522916820922423868307723229'.
           03                          PIC X(44)   VALUE
               '68406826206685085772516860881925268708819252'.
           03                          PIC X(44)   VALUE
               '68806524217689069222266900541520569104997195'.
           03                          PIC X(44)   VALUE
               '69204997195693088192526940499719569512921314'.
           03                          PIC X(44)   VALUE
               '69606524217697065242176980986223669906770219'.
           03                          PIC X(44)   VALUE
               '70005830210707129213147080652421770917960382'.
           03                          PIC X(44)   VALUE
               '71017960382711129213147121292131471317960382'.
           03                          PIC X(44)   VALUE
               '71417960382715129213147161292131471712921314'.
           03                          PIC X(44)   VALUE
               '71812921314722065242177230652421772406524217'.
           03                          PIC X(44)   VALUE
               '72508819252726049971957270816223172805417202'.
           03                          PIC X(44)   VALUE
               '72909208259730049971957341292131473512921314'.
           03                          PIC X(44)   VALUE
               '73612921314737088192527380499719573912921314'.
           03                          PIC X(44)   VALUE
               '74012921314741129213147420881925274304997195'.
           03                          PIC X(44)   VALUE
               '74408819252745088192527461796038274717960382'.
           03                          PIC X(44)   VALUE
               '74812921314749129213147501292131475412921314'.
           03                          PIC X(44)   VALUE
               '75508819252756049971957570803324075808033240'.
           03                          PIC X(44)   VALUE
               '75908033240760088192527610881925276508819252'.
           03                          PIC X(44)   VALUE
               '76608819252767088192527680881925276908819252'.
           03                          PIC X(44)   VALUE
               '77008819252774088192527750881925277608819252'.
           03                          PIC X(44)   VALUE
               '77708819252778080332407790803324078008033240'.
           03                          PIC X(44)   VALUE
               '78104997195782049971957890499719579004997195'.
           03                          PIC X(44)   VALUE
               '79104997195792049971957930499719579404997195'.
           03                          PIC X(44)   VALUE
               '79504997195799088192528000881925280108819252'.
           03                          PIC X(44)   VALUE
               '80212921314803129213148041292131480812921314'.
           03                          PIC X(44)   VALUE
               '80908819252810049971958110823123181205476204'.
           03                          PIC X(44)   VALUE
               '81308633232814088192528150652421781604997195'.
           03                          PIC X(44)   VALUE
               '82012921314821088192528220881925282312921314'.
           03                          PIC X(44)   VALUE
               '82408819252825088192528261796038282717960382'.
           03                          PIC X(44)   VALUE
               '82817960382829179603828301796038283408819252'.
           03                          PIC X(44)   VALUE
               '83508819252836088192528371796038283817960382'.
           03                          PIC X(44)   VALUE
               '83917960382840094882318410743619784206524217'.
           03                          PIC X(44)   VALUE
               '84308819252844065242178450652421784615176300'.
           03                          PIC X(44)   VALUE
               '84711159238848111592388490818321685318376373'.
           03                          PIC X(44)   VALUE
               '85411843330855118433308561605236885711001327'.
           03                          PIC X(44)   VALUE
               '85809174268862099012538630724124086404997195'.
           03                          PIC X(44)   VALUE
               '86508235222866065242178671161423386807627226'.
           03                          PIC X(44)   VALUE
               '86904997195870229383318710895923487206766218'.
           03                          PIC X(44)   VALUE
               '87606524217880049971958810652421788204997195'.
           03                          PIC X(44)   VALUE
               '88308819252884053172558850431423888604997195'.
           03                          PIC X(44)   VALUE
               '88706524217894065242178950499719589612921314'.
           03                          PIC X(44)   VALUE
               '89704997195901155513599021084930190308819252'.
           03                          PIC X(44)   VALUE
               '90413752356905088192529061796038290716745375'.
           03                          PIC X(44)   VALUE
               '90811596341909115963419130789725191406339222'.
           03                          PIC X(44)   VALUE
               '91504997195916049971959170499719591804997195'.
           03                          PIC X(44)   VALUE
               '91911250269920088232609210634420292208819252'.
           03                          PIC X(44)   VALUE
               '92306524217927179603829281292131492906524217'.
           03                          PIC X(44)   VALUE
               '93312921314934079372429350804624593913772337'.
           03                          PIC X(44)   VALUE
               '94010277306941088192529450630722194604426189'.
           03                          PIC X(44)   VALUE
               '94706660221948059052219490723222595005143192'.
           03                          PIC X(44)   VALUE
               '95113716279955179603829560881925295712921314'.
           03                          PIC X(44)   VALUE
               '95804997195959049971959630881925296406524217'.
           03                          PIC X(44)   VALUE
               '96504997195969129213149701292131497410333219'.
           03                          PIC X(44)   VALUE
               '97506617183976065242179770708619098124167431'.
           03                          PIC X(44)   VALUE
               '98215163355983119423199841292131498512921314'.
           03                          PIC X(44)   VALUE
               '98612921314987183073679881191833998908819252'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 736 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
