       01  W-DRG-FILLS.
           03                          PIC X(44)   VALUE
               '00118783463002187834630031878346300412493313'.
           03                          PIC X(44)   VALUE
               '00512493313006040551680071782943800812493313'.
           03                          PIC X(44)   VALUE
               '00914118346010085372450110853724501207773271'.
           03                          PIC X(44)   VALUE
               '01307207256014088162660150905329401608864270'.
           03                          PIC X(44)   VALUE
               '01706655219018077702490190548622002012331293'.
           03                          PIC X(44)   VALUE
               '02104055168022066552190230962327202408831248'.
           03                          PIC X(44)   VALUE
               '02504830204026040551680271112631602811507290'.
           03                          PIC X(44)   VALUE
               '02909268272030082842330310665521903204055168'.
           03                          PIC X(44)   VALUE
               '03304055168034083852510350656125303604055168'.
           03                          PIC X(44)   VALUE
               '03704055168038040551680390405516804004055168'.
           03                          PIC X(44)   VALUE
               '04104055168042040551680430828423304406655219'.
           03                          PIC X(44)   VALUE
               '04504055168046066552190470405516804804055168'.
           03                          PIC X(44)   VALUE
               '04918783463050066552190510665521905206655219'.
           03                          PIC X(44)   VALUE
               '05306655219054066552190550665521905606655219'.
           03                          PIC X(44)   VALUE
               '05706655219058066552190590665521906006655219'.
           03                          PIC X(44)   VALUE
               '06118783463062066552190631878346306410447255'.
           03                          PIC X(44)   VALUE
               '06505056198066040551680670405516806808284233'.
           03                          PIC X(44)   VALUE
               '06908284233070040551680710405516807204055168'.
           03                          PIC X(44)   VALUE
               '07308097237074040551680751878346307627674506'.
           03                          PIC X(44)   VALUE
               '07718783463078063482050790891622208007947228'.
           03                          PIC X(44)   VALUE
               '08104055168082079762090830738424808404055168'.
           03                          PIC X(44)   VALUE
               '08508207236086061942110871659732308807532209'.
           03                          PIC X(44)   VALUE
               '08908533236090079212300910828423309207251191'.
           03                          PIC X(44)   VALUE
               '09305573185094078852270950405516809608173242'.
           03                          PIC X(44)   VALUE
               '09705940179098040551680991116427310010015254'.
           03                          PIC X(44)   VALUE
               '10109763234102093132451041878346310518783463'.
           03                          PIC X(44)   VALUE
               '10618783463107187834631080665521910918783463'.
           03                          PIC X(44)   VALUE
               '11018783463111187834631131410336911413377402'.
           03                          PIC X(44)   VALUE
               '11518783463116082842331170405516811804055168'.
           03                          PIC X(44)   VALUE
               '11906655219120140913641210716721612205144190'.
           03                          PIC X(44)   VALUE
               '12309412209124082842331251878346312607689248'.
           03                          PIC X(44)   VALUE
               '12707616224128060422081291053420913007914248'.
           03                          PIC X(44)   VALUE
               '13107081237132081832181330548418513406985240'.
           03                          PIC X(44)   VALUE
               '13507331203136070752101370665521913807187234'.
           03                          PIC X(44)   VALUE
               '13906482204140076902011410625223214205452215'.
           03                          PIC X(44)   VALUE
               '14307316227144078702191450763725014612493313'.
           03                          PIC X(44)   VALUE
               '14712493313148284884761490665521915004055168'.
           03                          PIC X(44)   VALUE
               '15104055168152124933131530828423315412493313'.
           03                          PIC X(44)   VALUE
               '15508284233156082842331570405516815804055168'.
           03                          PIC X(44)   VALUE
               '15912493313160066552191610665521916206655219'.
           03                          PIC X(44)   VALUE
               '16306655219164082842331650828423316606655219'.
           03                          PIC X(44)   VALUE
               '16706655219168082842331690665521917015543350'.
           03                          PIC X(44)   VALUE
               '17108284233172085532421730551318917408741236'.
           03                          PIC X(44)   VALUE
               '17508359256176076612441770828423317806655219'.
           03                          PIC X(44)   VALUE
               '17910975234180084572281810563819518208829259'.
           03                          PIC X(44)   VALUE
               '18306913215184066552191850828423318608284233'.
           03                          PIC X(44)   VALUE
               '18708284233188104902421890585217419006655219'.
           03                          PIC X(44)   VALUE
               '19118783463192124933131931249331319408284233'.
           03                          PIC X(44)   VALUE
               '19508284233196082842331971878346319818783463'.
           03                          PIC X(44)   VALUE
               '19908284233200124933132011878346320205736184'.
           03                          PIC X(44)   VALUE
               '20305897182204094442212050682521520606655219'.
           03                          PIC X(44)   VALUE
               '20706979215208040551682091878346321012493313'.
           03                          PIC X(44)   VALUE
               '21108284233212082842332131259133021612493313'.
           03                          PIC X(44)   VALUE
               '21713602388218082842332190828423322008284233'.
           03                          PIC X(44)   VALUE
               '22312493313224040551682251249331322612493313'.
           03                          PIC X(44)   VALUE
               '22708284233228066552192290665521923004055168'.
           03                          PIC X(44)   VALUE
               '23118783463232040551682331249331323404055168'.
           03                          PIC X(44)   VALUE
               '23507540285236073812722370665521923808275275'.
           03                          PIC X(44)   VALUE
               '23906689219240092602602410580522724207725263'.
           03                          PIC X(44)   VALUE
               '24306596234244057562062450442617524606053214'.
           03                          PIC X(44)   VALUE
               '24705590204248072882392490800527125008373318'.
           03                          PIC X(44)   VALUE
               '25106904260252040551682530805428025406999264'.
           03                          PIC X(44)   VALUE
               '25504055168256080022512570665521925806655219'.
           03                          PIC X(44)   VALUE
               '25906655219260066552192610405516826204055168'.
           03                          PIC X(44)   VALUE
               '26315388450264116453882651656945626608284233'.
           03                          PIC X(44)   VALUE
               '26704055168268124933132691391541727013879416'.
           03                          PIC X(44)   VALUE
               '27109714311272068462102730665521927407872220'.
           03                          PIC X(44)   VALUE
               '27507872220276066552192770770424427806353224'.
           03                          PIC X(44)   VALUE
               '27906655219280100973092810736327428206655219'.
           03                          PIC X(44)   VALUE
               '28308574248284040551682851369231728612493313'.
           03                          PIC X(44)   VALUE
               '28713195396288187834632890405516829004055168'.
           03                          PIC X(44)   VALUE
               '29104055168292124933132930665521929407678251'.
           03                          PIC X(44)   VALUE
               '29508284233296077102432970632121129806655219'.
           03                          PIC X(44)   VALUE
               '29908284233300086702333010405516830318783463'.
           03                          PIC X(44)   VALUE
               '30412493313305066552193060828423330704055168'.
           03                          PIC X(44)   VALUE
               '30808284233309040551683101249331331104055168'.
           03                          PIC X(44)   VALUE
               '31218783463313040551683140405516831515800395'.
           03                          PIC X(44)   VALUE
               '31609308241317124933133180807521531906655219'.
           03                          PIC X(44)   VALUE
               '32007424239321061232043220665521932306655219'.
           03                          PIC X(44)   VALUE
               '32406655219325081232673260665521932704055168'.
           03                          PIC X(44)   VALUE
               '32806655219329040551683300405516833109267246'.
           03                          PIC X(44)   VALUE
               '33206393209333040551683341249331333508284233'.
           03                          PIC X(44)   VALUE
               '33608284233337066552193380665521933904055168'.
           03                          PIC X(44)   VALUE
               '34004055168341066552193421249331334304055168'.
           03                          PIC X(44)   VALUE
               '34412493313345082842333460707021634706655219'.
           03                          PIC X(44)   VALUE
               '34804055168349040551683500605819935104055168'.
           03                          PIC X(44)   VALUE
               '35208284233353187834633541249331335512493313'.
           03                          PIC X(44)   VALUE
               '35612493313357124933133581878346335904055168'.
           03                          PIC X(44)   VALUE
               '36004055168361066552193620665521936308284233'.
           03                          PIC X(44)   VALUE
               '36406655219365187834633660965423936708284233'.
           03                          PIC X(44)   VALUE
               '36812493313369066552193700828423337106655219'.
           03                          PIC X(44)   VALUE
               '37206655219373040551683740405516837504055168'.
           03                          PIC X(44)   VALUE
               '37604055168377040551683780665521937904055168'.
           03                          PIC X(44)   VALUE
               '38004055168381040551683820405516838304055168'.
           03                          PIC X(44)   VALUE
               '38404055168385040551683860665521938706655219'.
           03                          PIC X(44)   VALUE
               '38804055168389124933133900665521939104055168'.
           03                          PIC X(44)   VALUE
               '39208284233393066552193941878346339508584251'.
           03                          PIC X(44)   VALUE
               '39604055168397075671943980900823439904055168'.
           03                          PIC X(44)   VALUE
               '40008284233401124933134020828423340309651239'.
           03                          PIC X(44)   VALUE
               '40408980191405066552194061878346340708284233'.
           03                          PIC X(44)   VALUE
               '40812493313409052201954100405516841104055168'.
           03                          PIC X(44)   VALUE
               '41204055168413090612374140906123741514933387'.
           03                          PIC X(44)   VALUE
               '41609612259417082842334180877125841905948205'.
           03                          PIC X(44)   VALUE
               '42004055168421124933134220405516842308701247'.
           03                          PIC X(44)   VALUE
               '42418783463425061772604260573926942706655219'.
           03                          PIC X(44)   VALUE
               '42812493313429054662504300447922943104345227'.
           03                          PIC X(44)   VALUE
               '43206655219433024891314391320042544013567401'.
           03                          PIC X(44)   VALUE
               '44106655219442164423974430665521944409614307'.
           03                          PIC X(44)   VALUE
               '44508448273446082842334470665521944804055168'.
           03                          PIC X(44)   VALUE
               '44908284233450066552194510405516845209596255'.
           03                          PIC X(44)   VALUE
               '45306666231454082842334550405516846113383380'.
           03                          PIC X(44)   VALUE
               '46206469235463076182684640623424346508284233'.
           03                          PIC X(44)   VALUE
               '46608119239467066552194682217745547118783463'.
           03                          PIC X(44)   VALUE
               '47308047171475209063554761878346347716791397'.
           03                          PIC X(44)   VALUE
               '47816244378479066552194811878346348206655219'.
           03                          PIC X(44)   VALUE
               '48332319546484187834634851878346348608284233'.
           03                          PIC X(44)   VALUE
               '48710885295488187834634890884622949006952204'.
           03                          PIC X(44)   VALUE
               '49118783463492082842334930828423349404055168'.
           03                          PIC X(44)   VALUE
               '49612493313497187834634980828423349918783463'.
           03                          PIC X(44)   VALUE
               '50008284233501187834635020828423350318783463'.
           03                          PIC X(44)   VALUE
               '50418783463505124933135061878346350708284233'.
           03                          PIC X(44)   VALUE
               '50808284233509082842335101073432251108284233'.
           03                          PIC X(44)   VALUE
               '51408284233515124933135160828423351718783463'.
           03                          PIC X(44)   VALUE
               '51812493313519082842335200665521952103755186'.
           03                          PIC X(44)   VALUE
               '52204055168523038602125240625023152518783463'.
           03                          PIC X(22)   VALUE
               '5260828423352708284233'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 502 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
