       01  W-DRG-FILLS.
           03                          PIC X(44)   VALUE
               '00346614661004293274370111092829101208691233'.
           03                          PIC X(44)   VALUE
               '01304984181014055181940150551819402016523365'.
           03                          PIC X(44)   VALUE
               '02106024221022049841810231092829102404984181'.
           03                          PIC X(44)   VALUE
               '02510928291026049841810270498418102810928291'.
           03                          PIC X(44)   VALUE
               '02908659245030086592450311092829103210928291'.
           03                          PIC X(44)   VALUE
               '03310928291034165233650351652336503616523365'.
           03                          PIC X(44)   VALUE
               '03716523365038165233650391652336504012780344'.
           03                          PIC X(44)   VALUE
               '04108894290042049841810521125041605311250416'.
           03                          PIC X(44)   VALUE
               '05407917264055058221920560807325705705719237'.
           03                          PIC X(44)   VALUE
               '05816523365059062572120600498418106109165233'.
           03                          PIC X(44)   VALUE
               '06206128221063061282210640834524006506024221'.
           03                          PIC X(44)   VALUE
               '06604984181067049841810680498418106910928291'.
           03                          PIC X(44)   VALUE
               '07009165233071061282210720612822107308656249'.
           03                          PIC X(44)   VALUE
               '07406356219075086592450760865924507708659245'.
           03                          PIC X(44)   VALUE
               '07808659245079062572120801092829108104984181'.
           03                          PIC X(44)   VALUE
               '08208659245083062572120840498418108509264249'.
           03                          PIC X(44)   VALUE
               '08606841239087049841810881092829108910928291'.
           03                          PIC X(44)   VALUE
               '09008659245091087782430920745324209304984181'.
           03                          PIC X(44)   VALUE
               '09411095294095081742530960817425309709173246'.
           03                          PIC X(44)   VALUE
               '09806257212099049841811000723121510106145218'.
           03                          PIC X(44)   VALUE
               '10208659245103049841811131092829111410928291'.
           03                          PIC X(44)   VALUE
               '11510928291116109282911171092829112106257212'.
           03                          PIC X(44)   VALUE
               '12204984181123109282911241092829112510928291'.
           03                          PIC X(44)   VALUE
               '12912604271130049841811311652336513206014196'.
           03                          PIC X(44)   VALUE
               '13316523365134049841811351652336513604984181'.
           03                          PIC X(44)   VALUE
               '13706257212138062572121390625721214612604271'.
           03                          PIC X(44)   VALUE
               '14708691233148049841811490498418115008541254'.
           03                          PIC X(44)   VALUE
               '15104984181152085412541530595919915410563262'.
           03                          PIC X(44)   VALUE
               '15506014196156060141961571092829115806257212'.
           03                          PIC X(44)   VALUE
               '15906257212163242584201641652336516515261313'.
           03                          PIC X(44)   VALUE
               '16626005422167152613131681526131317507484227'.
           03                          PIC X(44)   VALUE
               '17605472188177088862291780717620817905980171'.
           03                          PIC X(44)   VALUE
               '18007504199181065941991820625721218324258420'.
           03                          PIC X(44)   VALUE
               '18416523365185152613131860740020818705680188'.
           03                          PIC X(44)   VALUE
               '18804984181189097362361900739820219106312185'.
           03                          PIC X(44)   VALUE
               '19205082165193076202091940613818919504864167'.
           03                          PIC X(44)   VALUE
               '19607018204197060311861980498418119907732215'.
           03                          PIC X(44)   VALUE
               '20006257212201049841812020719520920306257212'.
           03                          PIC X(44)   VALUE
               '20407747211205082692212060700620720720259334'.
           03                          PIC X(44)   VALUE
               '20810942223215062572122161652336521712453304'.
           03                          PIC X(44)   VALUE
               '21806257212219165233652201652336522106257212'.
           03                          PIC X(44)   VALUE
               '22216523365223086592452241652336522506257212'.
           03                          PIC X(44)   VALUE
               '22616523365227165233652281376830122912453304'.
           03                          PIC X(44)   VALUE
               '23006257212231165233652320625721223316523365'.
           03                          PIC X(44)   VALUE
               '23406257212235165233652360625721223716523365'.
           03                          PIC X(44)   VALUE
               '23806257212239154733702401338935024106257212'.
           03                          PIC X(44)   VALUE
               '24216523365243086592452440498418124504984181'.
           03                          PIC X(44)   VALUE
               '24613768301247086592452481652336524906257212'.
           03                          PIC X(44)   VALUE
               '25010928291251109282912521376830125312453304'.
           03                          PIC X(44)   VALUE
               '25406257212255121723392561092829125706257212'.
           03                          PIC X(44)   VALUE
               '25808659245259062572122601652336526110928291'.
           03                          PIC X(44)   VALUE
               '26206257212263165233652641042530626510425306'.
           03                          PIC X(44)   VALUE
               '28007702223281066452092820498418128309061172'.
           03                          PIC X(44)   VALUE
               '28406257212285062572122861652336528708659245'.
           03                          PIC X(44)   VALUE
               '28810246263289084222622900759027829107751214'.
           03                          PIC X(44)   VALUE
               '29206119196293043691682941652336529505138200'.
           03                          PIC X(44)   VALUE
               '29607751214297061191962980436916829907957237'.
           03                          PIC X(44)   VALUE
               '30005828216301051382003020877722630305638215'.
           03                          PIC X(44)   VALUE
               '30416523365305062572123060858524330708106244'.
           03                          PIC X(44)   VALUE
               '30807110207309052851933100498418131108659245'.
           03                          PIC X(44)   VALUE
               '31204979173313086592453140904023131506805215'.
           03                          PIC X(44)   VALUE
               '31605373192326165233653270865924532808659245'.
           03                          PIC X(44)   VALUE
               '32917735412330165233653311092829133210928291'.
           03                          PIC X(44)   VALUE
               '33308659245334086592453351652336533610928291'.
           03                          PIC X(44)   VALUE
               '33710928291338072322203390723222034005057171'.
           03                          PIC X(44)   VALUE
               '34109532243342072322203430505717134410928291'.
           03                          PIC X(44)   VALUE
               '34510928291346109282913471092829134808659245'.
           03                          PIC X(44)   VALUE
               '34908659245350165233653510498418135204984181'.
           03                          PIC X(44)   VALUE
               '35310928291354049841813550498418135617067356'.
           03                          PIC X(44)   VALUE
               '35711269290358109282913681039622436906257212'.
           03                          PIC X(44)   VALUE
               '37006257212371095322433720723222037305057171'.
           03                          PIC X(44)   VALUE
               '37408196209375067532133760498418137707954225'.
           03                          PIC X(44)   VALUE
               '37806146213379049841813801092829138108659245'.
           03                          PIC X(44)   VALUE
               '38208659245383049841813840498418138509116233'.
           03                          PIC X(44)   VALUE
               '38607326254387049841813880942123438906300198'.
           03                          PIC X(44)   VALUE
               '39004984181391093442333920633920039310713258'.
           03                          PIC X(44)   VALUE
               '39407529218395062572124051652336540610928291'.
           03                          PIC X(44)   VALUE
               '40706257212408165233654090865924541006257212'.
           03                          PIC X(44)   VALUE
               '41116523365412165233654130625721241416523365'.
           03                          PIC X(44)   VALUE
               '41516523365416165233654171652336541816523365'.
           03                          PIC X(44)   VALUE
               '41906257212420165233654211652336542216523365'.
           03                          PIC X(44)   VALUE
               '42316523365424165233654251652336543206649203'.
           03                          PIC X(44)   VALUE
               '43306257212434062572124350882420143604984181'.
           03                          PIC X(44)   VALUE
               '43704984181438104722374390752621144004984181'.
           03                          PIC X(44)   VALUE
               '44108014222442070632304430706323044407774218'.
           03                          PIC X(44)   VALUE
               '44505869206446058692064531652336545416523365'.
           03                          PIC X(44)   VALUE
               '45510928291456165233654571652336545810928291'.
           03                          PIC X(44)   VALUE
               '45916523365460109282914611652336546216523365'.
           03                          PIC X(44)   VALUE
               '46314169391464109213434650865924546616523365'.
           03                          PIC X(44)   VALUE
               '46708659245468086592454691652336547016523365'.
           03                          PIC X(44)   VALUE
               '47110928291472109282914731092829147413818369'.
           03                          PIC X(44)   VALUE
               '47510985341476062572124771389538247810928291'.
           03                          PIC X(44)   VALUE
               '47910928291480165233654811652336548216523365'.
           03                          PIC X(44)   VALUE
               '48316523365484165233654851092829148610928291'.
           03                          PIC X(44)   VALUE
               '48706257212488109282914890625721249010928291'.
           03                          PIC X(44)   VALUE
               '49104984181492165233654931652336549408659245'.
           03                          PIC X(44)   VALUE
               '49514575376496109282914971092829149816523365'.
           03                          PIC X(44)   VALUE
               '49908659245500137393685010964030750206257212'.
           03                          PIC X(44)   VALUE
               '50310057315504100573155051005731550608659245'.
           03                          PIC X(44)   VALUE
               '50716523365508086592455091652336551013877320'.
           03                          PIC X(44)   VALUE
               '51108659245512086592455131092829151408659245'.
           03                          PIC X(44)   VALUE
               '51513877320516086592455170865924553310928291'.
           03                          PIC X(44)   VALUE
               '53410928291535074052545360625721253704984181'.
           03                          PIC X(44)   VALUE
               '53804984181539101193085400793427554106794244'.
           03                          PIC X(44)   VALUE
               '54209220219543069162215440625721254508780218'.
           03                          PIC X(44)   VALUE
               '54607139241547049841815480917427254907449266'.
           03                          PIC X(44)   VALUE
               '55005723251551090452635520591721755304984181'.
           03                          PIC X(44)   VALUE
               '55404984181555062572125560625721255708843262'.
           03                          PIC X(44)   VALUE
               '55806310219559084572565600695125056105767229'.
           03                          PIC X(44)   VALUE
               '56208659245563086592455640868523656506709227'.
           03                          PIC X(44)   VALUE
               '56605443192573136823835741028234557507597280'.
           03                          PIC X(44)   VALUE
               '57614427384577097413095780498418157913110354'.
           03                          PIC X(44)   VALUE
               '58009362317581086592455821652336558305982201'.
           03                          PIC X(44)   VALUE
               '58406257212585060132245920917926559306848251'.
           03                          PIC X(44)   VALUE
               '59405626231595090652475960598220159716523365'.
           03                          PIC X(44)   VALUE
               '59804984181599049841816000661624060104984181'.
           03                          PIC X(44)   VALUE
               '60207278221603052741916040646423460506013224'.
           03                          PIC X(44)   VALUE
               '60608336228607057262036140976828861508659245'.
           03                          PIC X(44)   VALUE
               '61615743397617101303116181013031161910928291'.
           03                          PIC X(44)   VALUE
               '62010928291621109282916221249835962309964308'.
           03                          PIC X(44)   VALUE
               '62406257212625062572126260625721262706257212'.
           03                          PIC X(44)   VALUE
               '62812290329629097682886300865924563708950262'.
           03                          PIC X(44)   VALUE
               '63807068234639047182016400873023164106214206'.
           03                          PIC X(44)   VALUE
               '64210928291643062572126440625721264504984181'.
           03                          PIC X(44)   VALUE
               '65316523365654109282916551092829165604984181'.
           03                          PIC X(44)   VALUE
               '65704984181658049841816591092829166010928291'.
           03                          PIC X(44)   VALUE
               '66110928291662109282916631092829166410928291'.
           03                          PIC X(44)   VALUE
               '66510928291666109282916671092829166810928291'.
           03                          PIC X(44)   VALUE
               '66906257212670062572126710865924567208659245'.
           03                          PIC X(44)   VALUE
               '67313761328674097442796750865924568209092231'.
           03                          PIC X(44)   VALUE
               '68306866210684061841716851092829168608659245'.
           03                          PIC X(44)   VALUE
               '68706257212688062572126890670221769005183193'.
           03                          PIC X(44)   VALUE
               '69108659245692049841816930865924569404984181'.
           03                          PIC X(44)   VALUE
               '69508659245696049841816970865924569808848230'.
           03                          PIC X(44)   VALUE
               '69906293202700062572127071092829170810928291'.
           03                          PIC X(44)   VALUE
               '70910928291710062572127111092829171210928291'.
           03                          PIC X(44)   VALUE
               '71308659245714062572127151652336571610928291'.
           03                          PIC X(44)   VALUE
               '71716523365718109282917221092829172306257212'.
           03                          PIC X(44)   VALUE
               '72406257212725165233657260865924572708108227'.
           03                          PIC X(44)   VALUE
               '72805010173729088292647300498418173410928291'.
           03                          PIC X(44)   VALUE
               '73510928291736109282917370625721273806257212'.
           03                          PIC X(44)   VALUE
               '73912290329740097682887410865924574209768288'.
           03                          PIC X(44)   VALUE
               '74308659245744109282917451092829174610928291'.
           03                          PIC X(44)   VALUE
               '74710928291748109282917491092829175010928291'.
           03                          PIC X(44)   VALUE
               '75410928291755062572127560625721275707734246'.
           03                          PIC X(44)   VALUE
               '75806833239759049841817600865924576108659245'.
           03                          PIC X(44)   VALUE
               '76510928291766109282917671092829176810928291'.
           03                          PIC X(44)   VALUE
               '76916523365770109282917741092829177510928291'.
           03                          PIC X(44)   VALUE
               '77606257212777062572127780625721277906257212'.
           03                          PIC X(44)   VALUE
               '78006257212781049841817820498418178904984181'.
           03                          PIC X(44)   VALUE
               '79004984181791049841817920498418179304984181'.
           03                          PIC X(44)   VALUE
               '79404984181795049841817991092829180010928291'.
           03                          PIC X(44)   VALUE
               '80110928291802109282918031092829180410928291'.
           03                          PIC X(44)   VALUE
               '80808659245809062572128100551819481108420211'.
           03                          PIC X(44)   VALUE
               '81205518194813073712128140885525081506257212'.
           03                          PIC X(44)   VALUE
               '81606257212820049841818210498418182204984181'.
           03                          PIC X(44)   VALUE
               '82316523365824049841818250498418182608659245'.
           03                          PIC X(44)   VALUE
               '82708659245828086592458291652336583016523365'.
           03                          PIC X(44)   VALUE
               '83408659245835086592458360625721283714182291'.
           03                          PIC X(44)   VALUE
               '83812988286839129882868400887622184106709188'.
           03                          PIC X(44)   VALUE
               '84204984181843086592458440865924584504984181'.
           03                          PIC X(44)   VALUE
               '84614182291847129882868481298828684907715227'.
           03                          PIC X(44)   VALUE
               '85317465377854110703028550865924585614573342'.
           03                          PIC X(44)   VALUE
               '85710392304858086592458620963825386306957230'.
           03                          PIC X(44)   VALUE
               '86404984181865079952138660799521386710462239'.
           03                          PIC X(44)   VALUE
               '86806851196869049841818702138431787108713231'.
           03                          PIC X(44)   VALUE
               '87206232203876165233658800625721288103897219'.
           03                          PIC X(44)   VALUE
               '88206257212883062572128840522226188503974241'.
           03                          PIC X(44)   VALUE
               '88604203247887049841818940498418189504984181'.
           03                          PIC X(44)   VALUE
               '89608659245897049841819011396334590210375299'.
           03                          PIC X(44)   VALUE
               '90306257212904137123839050625721290606257212'.
           03                          PIC X(44)   VALUE
               '90714541343908094942889090625721291307638243'.
           03                          PIC X(44)   VALUE
               '91405669201915049841819160498418191710928291'.
           03                          PIC X(44)   VALUE
               '91804984181919109862689200818525092105129184'.
           03                          PIC X(44)   VALUE
               '92208659245923049841819270865924592808659245'.
           03                          PIC X(44)   VALUE
               '92908659245933062572129340644323993506788222'.
           03                          PIC X(44)   VALUE
               '93913992336940100553119410625721294506478212'.
           03                          PIC X(44)   VALUE
               '94604103173947081952359480481819994907119220'.
           03                          PIC X(44)   VALUE
               '95004441170951151622729551092829195616523365'.
           03                          PIC X(44)   VALUE
               '95706257212958062572129590625721296310928291'.
           03                          PIC X(44)   VALUE
               '96410928291965049841819691652336597008659245'.
           03                          PIC X(44)   VALUE
               '97410484232975067351939760498418197706830203'.
           03                          PIC X(44)   VALUE
               '98122095418982112523079830625721298416523365'.
           03                          PIC X(44)   VALUE
               '98510928291986109282919871836538598810367303'.
           03                          PIC X(11)   VALUE
               '98906257212'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 737 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
