       01  W-DRG-FILLS.
           03                          PIC X(44)   VALUE
               '00111899285002118992850031189928500606064211'.
           03                          PIC X(44)   VALUE
               '00714458367008060642110091095031301009022250'.
           03                          PIC X(44)   VALUE
               '01104586169012074162560130782024601408189259'.
           03                          PIC X(44)   VALUE
               '01507868272016083582470170606421101807755248'.
           03                          PIC X(44)   VALUE
               '01906583211020105582700211189928502206064211'.
           03                          PIC X(44)   VALUE
               '02311225266024067402240250606421102606064211'.
           03                          PIC X(44)   VALUE
               '02711418283028092502980290850824303008508243'.
           03                          PIC X(44)   VALUE
               '03106064211032060642110330606421103408418242'.
           03                          PIC X(44)   VALUE
               '03506976226036045861690370458616903804586169'.
           03                          PIC X(44)   VALUE
               '03904586169040045861690410458616904204586169'.
           03                          PIC X(44)   VALUE
               '04304586169044085082430450458616904606064211'.
           03                          PIC X(44)   VALUE
               '04704586169048045861690491189928505011899285'.
           03                          PIC X(44)   VALUE
               '05111899285052118992850531189928505411899285'.
           03                          PIC X(44)   VALUE
               '05518658386056118992850570606421105806064211'.
           03                          PIC X(44)   VALUE
               '05906064211060060642110610606421106206064211'.
           03                          PIC X(44)   VALUE
               '06311899285064125882740650385816206606064211'.
           03                          PIC X(44)   VALUE
               '06711899285068061152130690606421107006064211'.
           03                          PIC X(44)   VALUE
               '07104586169072085082430730934123507406064211'.
           03                          PIC X(44)   VALUE
               '07520661319076238234160771865838607807424220'.
           03                          PIC X(44)   VALUE
               '07909350237080092152670810606421108207591199'.
           03                          PIC X(44)   VALUE
               '08306064211084045861690850785222008607852220'.
           03                          PIC X(44)   VALUE
               '08716797304088073342010890776221209007494219'.
           03                          PIC X(44)   VALUE
               '09108508243092073182040930458616909408348213'.
           03                          PIC X(44)   VALUE
               '09504586169096075752020970530516609804586169'.
           03                          PIC X(44)   VALUE
               '09910648258100090482291010873721910208737219'.
           03                          PIC X(44)   VALUE
               '10404586169105045861691060458616910704586169'.
           03                          PIC X(44)   VALUE
               '10811899285109060642111100458616911104586169'.
           03                          PIC X(44)   VALUE
               '11313298362114117803331151189928511618658386'.
           03                          PIC X(44)   VALUE
               '11706064211118186583861190458616912012014326'.
           03                          PIC X(44)   VALUE
               '12108293218122085082431230989018612408508243'.
           03                          PIC X(44)   VALUE
               '12518658386126084392461270759721612808508243'.
           03                          PIC X(44)   VALUE
               '12906064211130070722271310571820613207086226'.
           03                          PIC X(44)   VALUE
               '13305629194134066742151350890824613608508243'.
           03                          PIC X(44)   VALUE
               '13708508243138074512201390548819314006064211'.
           03                          PIC X(44)   VALUE
               '14105304225142053042251430458616914407913218'.
           03                          PIC X(44)   VALUE
               '14507913218146186583861471865838614820460351'.
           03                          PIC X(44)   VALUE
               '14904586169150186583861511865838615218658386'.
           03                          PIC X(44)   VALUE
               '15318658386154186583861551865838615618658386'.
           03                          PIC X(44)   VALUE
               '15711899285158118992851590850824316008508243'.
           03                          PIC X(44)   VALUE
               '16118658386162045861691630458616916418658386'.
           03                          PIC X(44)   VALUE
               '16518658386166186583861671865838616811899285'.
           03                          PIC X(44)   VALUE
               '16908508243170174483331711744833317208822228'.
           03                          PIC X(44)   VALUE
               '17308822228174070672191750706721917610124233'.
           03                          PIC X(44)   VALUE
               '17708508243178045861691790872823418009438222'.
           03                          PIC X(44)   VALUE
               '18106064211182083732311830699220718406064211'.
           03                          PIC X(44)   VALUE
               '18508447242186085082431870850824318809751240'.
           03                          PIC X(44)   VALUE
               '18908839229190085082431911865838619218658386'.
           03                          PIC X(44)   VALUE
               '19304586169194045861691951865838619618658386'.
           03                          PIC X(44)   VALUE
               '19718658386198186583861990850824320008508243'.
           03                          PIC X(44)   VALUE
               '20111899285202072172332030786720920408626215'.
           03                          PIC X(44)   VALUE
               '20507596230206060642112070649219320804586169'.
           03                          PIC X(44)   VALUE
               '20918658386210186583862111865838621218658386'.
           03                          PIC X(44)   VALUE
               '21311696339216186583862171312337221811899285'.
           03                          PIC X(44)   VALUE
               '21911899285220118992852231189928522406064211'.
           03                          PIC X(44)   VALUE
               '22510601304226186583862270606421122808508243'.
           03                          PIC X(44)   VALUE
               '22904586169230186583862320850824323315135345'.
           03                          PIC X(44)   VALUE
               '23408508243235079203032360734826923704586169'.
           03                          PIC X(44)   VALUE
               '23809329289239066192142400716023124104586169'.
           03                          PIC X(44)   VALUE
               '24207943262243060722232440570522324505109193'.
           03                          PIC X(44)   VALUE
               '24605884214247054452142480783024324906907239'.
           03                          PIC X(44)   VALUE
               '25006064211251060642112520850824325308368285'.
           03                          PIC X(44)   VALUE
               '25406956271255085082432560749123325704586169'.
           03                          PIC X(44)   VALUE
               '25804586169259045861692600458616926118658386'.
           03                          PIC X(44)   VALUE
               '26208508243263135683912641062233026514363357'.
           03                          PIC X(44)   VALUE
               '26608508243267186583862681865838626913904384'.
           03                          PIC X(44)   VALUE
               '27008508243271095722842720795625027304586169'.
           03                          PIC X(44)   VALUE
               '27409535277275045861692760606421127706711216'.
           03                          PIC X(44)   VALUE
               '27805277190279045861692800884027128108190283'.
           03                          PIC X(44)   VALUE
               '28208508243283077122292840458616928512799359'.
           03                          PIC X(44)   VALUE
               '28611899285287110903242880850824328911899285'.
           03                          PIC X(44)   VALUE
               '29011899285291118992852921189928529311899285'.
           03                          PIC X(44)   VALUE
               '29407472238295060642112960797323729706225216'.
           03                          PIC X(44)   VALUE
               '29806064211299118992853000794824630107948246'.
           03                          PIC X(44)   VALUE
               '30311899285304118992853050606421130611899285'.
           03                          PIC X(44)   VALUE
               '30708508243308118992853091189928531008508243'.
           03                          PIC X(44)   VALUE
               '31108508243312118992853131189928531406064211'.
           03                          PIC X(44)   VALUE
               '31514618342316091752363170923822131807798225'.
           03                          PIC X(44)   VALUE
               '31907798225320077982253210572121932204586169'.
           03                          PIC X(44)   VALUE
               '32306064211324045861693250850824332604586169'.
           03                          PIC X(44)   VALUE
               '32704586169328060642113290606421133006064211'.
           03                          PIC X(44)   VALUE
               '33108240229332062632233330606421133418658386'.
           03                          PIC X(44)   VALUE
               '33518658386336118992853371189928533818658386'.
           03                          PIC X(44)   VALUE
               '33904586169340045861693411865838634204586169'.
           03                          PIC X(44)   VALUE
               '34304586169344186583863451865838634606556208'.
           03                          PIC X(44)   VALUE
               '34704586169348060642113490606421135007789226'.
           03                          PIC X(44)   VALUE
               '35104586169352118992853531865838635418658386'.
           03                          PIC X(44)   VALUE
               '35518658386356118992853571189928535811899285'.
           03                          PIC X(44)   VALUE
               '35911899285360118992853610458616936204586169'.
           03                          PIC X(44)   VALUE
               '36304586169364045861693651865838636610345239'.
           03                          PIC X(44)   VALUE
               '36704586169368071682253690850824337008508243'.
           03                          PIC X(44)   VALUE
               '37104586169372045861693730458616937404586169'.
           03                          PIC X(44)   VALUE
               '37504586169376045861693770458616937808508243'.
           03                          PIC X(44)   VALUE
               '37904586169380045861693810458616938204586169'.
           03                          PIC X(44)   VALUE
               '38304586169384045861693850458616938604586169'.
           03                          PIC X(44)   VALUE
               '38704586169388045861693890458616939004586169'.
           03                          PIC X(44)   VALUE
               '39104586169392186583863931865838639411899285'.
           03                          PIC X(44)   VALUE
               '39507516237396060642113970782719239807520214'.
           03                          PIC X(44)   VALUE
               '39906064211401118992854020850824340308996220'.
           03                          PIC X(44)   VALUE
               '40404586169405045861694061865838640711899285'.
           03                          PIC X(44)   VALUE
               '40811899285409091042264101189928541104586169'.
           03                          PIC X(44)   VALUE
               '41204586169413088072074140606421141515485365'.
           03                          PIC X(44)   VALUE
               '41608961239417085082434180869724741911899285'.
           03                          PIC X(44)   VALUE
               '42011899285421101252514220606421142309425228'.
           03                          PIC X(44)   VALUE
               '42418658386425056492124260577726642704586169'.
           03                          PIC X(44)   VALUE
               '42806617291429057672444300474622743104875220'.
           03                          PIC X(44)   VALUE
               '43204586169433045861694391080835044012254322'.
           03                          PIC X(44)   VALUE
               '44106064211442147723734431477237344408051244'.
           03                          PIC X(44)   VALUE
               '44508051244446085082434470850824344808508243'.
           03                          PIC X(44)   VALUE
               '44906064211450045861694510606421145209938254'.
           03                          PIC X(44)   VALUE
               '45307085220454085082434550606421146112824352'.
           03                          PIC X(44)   VALUE
               '46206569232463066312344640556122746506885205'.
           03                          PIC X(44)   VALUE
               '46607286222467060642114682128641747108508243'.
           03                          PIC X(44)   VALUE
               '47308622207475210153424760850824347715653352'.
           03                          PIC X(44)   VALUE
               '47814010333479060642114811189928548211899285'.
           03                          PIC X(44)   VALUE
               '48411899285485118992854861865838648711431247'.
           03                          PIC X(44)   VALUE
               '48818658386489098542374901049523349118658386'.
           03                          PIC X(44)   VALUE
               '49211899285493118992854941189928549608508243'.
           03                          PIC X(44)   VALUE
               '49708508243498085082434991189928550004586169'.
           03                          PIC X(44)   VALUE
               '50111899285502118992855031189928550418658386'.
           03                          PIC X(44)   VALUE
               '50508508243506118992855070850824350808303260'.
           03                          PIC X(44)   VALUE
               '50904586169510093012685110606421151518658386'.
           03                          PIC X(44)   VALUE
               '51606064211517085082435180606421151908508243'.
           03                          PIC X(44)   VALUE
               '52008508243521060112225220601122252306011222'.
           03                          PIC X(44)   VALUE
               '52406247220525186583865260850824352708508243'.
           03                          PIC X(44)   VALUE
               '52811899285529118992855301189928553111899285'.
           03                          PIC X(44)   VALUE
               '53204586169533186583865340458616953508508243'.
           03                          PIC X(44)   VALUE
               '53618658386537126863525380850824353908508243'.
           03                          PIC X(44)   VALUE
               '54006064211541351845625422933745954318658386'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 512 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
