       01  W-DRG-FILLS.
           03                          PIC X(44)   VALUE
               '00338813605004275984330110516516901205165169'.
           03                          PIC X(44)   VALUE
               '01305165169014060191870160601918701706019187'.
           03                          PIC X(44)   VALUE
               '02008405222021044401640220444016402317130343'.
           03                          PIC X(44)   VALUE
               '02417130343025171303430261713034302717130343'.
           03                          PIC X(44)   VALUE
               '02817130343029081942270300819422703117130343'.
           03                          PIC X(44)   VALUE
               '03208194227033081942270341645540603516455406'.
           03                          PIC X(44)   VALUE
               '03616455406037171303430381713034303905165169'.
           03                          PIC X(44)   VALUE
               '04015368362041081942270420819422705210728388'.
           03                          PIC X(44)   VALUE
               '05310728388054081942270550516516905608682250'.
           03                          PIC X(44)   VALUE
               '05706903228058171303430590601918706006019187'.
           03                          PIC X(44)   VALUE
               '06108833232062065052010630516516906408405222'.
           03                          PIC X(44)   VALUE
               '06504440164066044401640670516516906805165169'.
           03                          PIC X(44)   VALUE
               '06911531277070088332320710650520107205165169'.
           03                          PIC X(44)   VALUE
               '07317130343074081942270750819422707606019187'.
           03                          PIC X(44)   VALUE
               '07706019187078060191870790601918708017130343'.
           03                          PIC X(44)   VALUE
               '08117130343082088462400830516516908405165169'.
           03                          PIC X(44)   VALUE
               '08510729270086068952160870516516908810729270'.
           03                          PIC X(44)   VALUE
               '08906895216090051651690911066826709206380224'.
           03                          PIC X(44)   VALUE
               '09305165169094121602810950740322609606019187'.
           03                          PIC X(44)   VALUE
               '09709488223098060191870990601918710008262236'.
           03                          PIC X(44)   VALUE
               '10106019187102081942271030516516911305165169'.
           03                          PIC X(44)   VALUE
               '11405165169115051651691160516516911705165169'.
           03                          PIC X(44)   VALUE
               '12105165169122051651691230516516912405165169'.
           03                          PIC X(44)   VALUE
               '12505165169129115312771300819422713105165169'.
           03                          PIC X(44)   VALUE
               '13205165169133171303431340516516913505165169'.
           03                          PIC X(44)   VALUE
               '13605165169137051651691380516516913908194227'.
           03                          PIC X(44)   VALUE
               '14610523285147081942271480516516914905165169'.
           03                          PIC X(44)   VALUE
               '15011531277151051651691521153127715305165169'.
           03                          PIC X(44)   VALUE
               '15408194227155051651691560516516915711531277'.
           03                          PIC X(44)   VALUE
               '15808194227159051651691632593937216417130343'.
           03                          PIC X(44)   VALUE
               '16517130343166237024061671438028616814380286'.
           03                          PIC X(44)   VALUE
               '17506978188176060191871770868421917806266183'.
           03                          PIC X(44)   VALUE
               '17904879165180065441811810601918718204879165'.
           03                          PIC X(44)   VALUE
               '18308194227184081942271850819422718607478203'.
           03                          PIC X(44)   VALUE
               '18706019187188052871631890965521719007197189'.
           03                          PIC X(44)   VALUE
               '19105673159192056731591930740819419405287163'.
           03                          PIC X(44)   VALUE
               '19505287163196092522231970601918719805165169'.
           03                          PIC X(44)   VALUE
               '19908073201200060191872010601918720207005185'.
           03                          PIC X(44)   VALUE
               '20305165169204060191872050925522820605165169'.
           03                          PIC X(44)   VALUE
               '20718298318208107062162151535933421615359334'.
           03                          PIC X(44)   VALUE
               '21715359334218115312772191535933422015359334'.
           03                          PIC X(44)   VALUE
               '22115359334222115312772231153127722411531277'.
           03                          PIC X(44)   VALUE
               '22511531277226171303432271153127722815359334'.
           03                          PIC X(44)   VALUE
               '22911531277231153593342321355431623315359334'.
           03                          PIC X(44)   VALUE
               '23413554316235153593342361355431623916455406'.
           03                          PIC X(44)   VALUE
               '24011531277241115312772421153127724311531277'.
           03                          PIC X(44)   VALUE
               '24406019187245171303432461153127724711531277'.
           03                          PIC X(44)   VALUE
               '24817130343249060191872501713034325106019187'.
           03                          PIC X(44)   VALUE
               '25215359334253115312772541153127725511531277'.
           03                          PIC X(44)   VALUE
               '25611531277257051651692580819422725906019187'.
           03                          PIC X(44)   VALUE
               '26011531277261081942272620819422726311531277'.
           03                          PIC X(44)   VALUE
               '26413554316265051651692661535933426711531277'.
           03                          PIC X(44)   VALUE
               '26815359334269135543162701713034327111531277'.
           03                          PIC X(44)   VALUE
               '27206019187273115312772740819422728008034215'.
           03                          PIC X(44)   VALUE
               '28105580178282051651692830853117228406019187'.
           03                          PIC X(44)   VALUE
               '28506019187286115312772870601918728811039267'.
           03                          PIC X(44)   VALUE
               '28908331253290060191872910802120929206238180'.
           03                          PIC X(44)   VALUE
               '29305165169294051651692950516516929617130343'.
           03                          PIC X(44)   VALUE
               '29706238180298051651692990849022230005329189'.
           03                          PIC X(44)   VALUE
               '30105165169302087322143030516516930417130343'.
           03                          PIC X(44)   VALUE
               '30506019187306095052323070819422730806965211'.
           03                          PIC X(44)   VALUE
               '30906019187310051651693111153127731211531277'.
           03                          PIC X(44)   VALUE
               '31305165169314101282413150642820731606428207'.
           03                          PIC X(44)   VALUE
               '32617130343327115312773280601918732917130343'.
           03                          PIC X(44)   VALUE
               '33011531277331060191873321713034333307032196'.
           03                          PIC X(44)   VALUE
               '33406019187335171303433360601918733706019187'.
           03                          PIC X(44)   VALUE
               '33809451235339070321963400601918734117130343'.
           03                          PIC X(44)   VALUE
               '34207032196343060191873441713034334507032196'.
           03                          PIC X(44)   VALUE
               '34606019187347171303433480703219634906019187'.
           03                          PIC X(44)   VALUE
               '35009451235351070321963520601918735317130343'.
           03                          PIC X(44)   VALUE
               '35417130343355171303433561739635235711531277'.
           03                          PIC X(44)   VALUE
               '35806019187368115312773691153127737011531277'.
           03                          PIC X(44)   VALUE
               '37109451235372070321963730601918737408595211'.
           03                          PIC X(44)   VALUE
               '37508194227376066691923770957421337808194227'.
           03                          PIC X(44)   VALUE
               '37905165169380103742703810516516938205165169'.
           03                          PIC X(44)   VALUE
               '38306019187384060191873851153127738611531277'.
           03                          PIC X(44)   VALUE
               '38711531277388093672333890819422739008194227'.
           03                          PIC X(44)   VALUE
               '39109831243392066691923931203126239407362206'.
           03                          PIC X(44)   VALUE
               '39507362206405081942274060601918740706019187'.
           03                          PIC X(44)   VALUE
               '40806019187409060191874100601918741109574213'.
           03                          PIC X(44)   VALUE
               '41208194227413051651694141713034341508194227'.
           03                          PIC X(44)   VALUE
               '41605165169417081942274180819422741908194227'.
           03                          PIC X(44)   VALUE
               '42010411238421078982094220601918742317130343'.
           03                          PIC X(44)   VALUE
               '42406019187425060191874320791520743307915207'.
           03                          PIC X(44)   VALUE
               '43407915207435171303434361713034343706669192'.
           03                          PIC X(44)   VALUE
               '43810411238439078982094400601918744108183206'.
           03                          PIC X(44)   VALUE
               '44206308168443060191874440869622744508194227'.
           03                          PIC X(44)   VALUE
               '44605165169453083832524540838325245506392187'.
           03                          PIC X(44)   VALUE
               '45610670278457072562284580725622845917130343'.
           03                          PIC X(44)   VALUE
               '46008194227461115312774620620419746315400380'.
           03                          PIC X(44)   VALUE
               '46411737338465051651694660620419746706204197'.
           03                          PIC X(44)   VALUE
               '46806204197469093432344700620419747111531277'.
           03                          PIC X(44)   VALUE
               '47207256228473072562284741614437447511531277'.
           03                          PIC X(44)   VALUE
               '47611531277477115312774781153127747911531277'.
           03                          PIC X(44)   VALUE
               '48011531277481115312774821153127748309343234'.
           03                          PIC X(44)   VALUE
               '48517130343486171303434871713034348805165169'.
           03                          PIC X(44)   VALUE
               '48905165169492115312774931153127749408194227'.
           03                          PIC X(44)   VALUE
               '49511531277496115312774971153127749808194227'.
           03                          PIC X(44)   VALUE
               '49908194227500135733405010819422750208194227'.
           03                          PIC X(44)   VALUE
               '50311531277504081942275050819422750611531277'.
           03                          PIC X(44)   VALUE
               '50711531277508115312775090516516951011531277'.
           03                          PIC X(44)   VALUE
               '51108194227512081942275131153127751411531277'.
           03                          PIC X(44)   VALUE
               '51516419379516081942275170819422751817130343'.
           03                          PIC X(44)   VALUE
               '51907256228520072562285330601918753406019187'.
           03                          PIC X(44)   VALUE
               '53505165169536051651695370819422753805165169'.
           03                          PIC X(44)   VALUE
               '53910634287540080952555410809525554217130343'.
           03                          PIC X(44)   VALUE
               '54306019187544060191875451153127754605165169'.
           03                          PIC X(44)   VALUE
               '54705165169548106702785490725622855007256228'.
           03                          PIC X(44)   VALUE
               '55109613255552081942275530601918755406019187'.
           03                          PIC X(44)   VALUE
               '55508194227556051651695571015225955807197230'.
           03                          PIC X(44)   VALUE
               '55909624256560083832525610639218756205165169'.
           03                          PIC X(44)   VALUE
               '56305165169564093432345650620419756606204197'.
           03                          PIC X(44)   VALUE
               '57012342324571081942275720819422757317283446'.
           03                          PIC X(44)   VALUE
               '57411531277575060191875761153127757711531277'.
           03                          PIC X(44)   VALUE
               '57808194227579151433435800819422758105165169'.
           03                          PIC X(44)   VALUE
               '58208194227583081942275840601918758506019187'.
           03                          PIC X(44)   VALUE
               '59209011251593058501975940585019759508194227'.
           03                          PIC X(44)   VALUE
               '59606019187597060191875980516516959905165169'.
           03                          PIC X(44)   VALUE
               '60005165169601051651696020853221560305616180'.
           03                          PIC X(44)   VALUE
               '60408540263605060191876060936922160706019187'.
           03                          PIC X(44)   VALUE
               '61411531277615115312776161713034361717130343'.
           03                          PIC X(44)   VALUE
               '61811531277619173963526201153127762106019187'.
           03                          PIC X(44)   VALUE
               '62214604349623108032836240601918762516297340'.
           03                          PIC X(44)   VALUE
               '62611531277627115312776281629734062911531277'.
           03                          PIC X(44)   VALUE
               '63006019187637094182396380719422063906105186'.
           03                          PIC X(44)   VALUE
               '64009133227641061051866420601918764308194227'.
           03                          PIC X(44)   VALUE
               '64406019187645060191876531713034365417130343'.
           03                          PIC X(44)   VALUE
               '65508194227656171303436571713034365817130343'.
           03                          PIC X(44)   VALUE
               '65917130343660171303436611713034366205165169'.
           03                          PIC X(44)   VALUE
               '66305165169664051651696651713034366617130343'.
           03                          PIC X(44)   VALUE
               '66717130343668171303436691713034367017130343'.
           03                          PIC X(44)   VALUE
               '67113704318672051651696731370431867411531277'.
           03                          PIC X(44)   VALUE
               '67505165169682095442346830715220668405165169'.
           03                          PIC X(44)   VALUE
               '68508194227686081942276870819422768806159177'.
           03                          PIC X(44)   VALUE
               '68907110211690050741686911370431869206019187'.
           03                          PIC X(44)   VALUE
               '69311531277694060191876951713034369605165169'.
           03                          PIC X(44)   VALUE
               '69705165169698086362246990615917770006159177'.
           03                          PIC X(44)   VALUE
               '70711531277708115312777091713034371011531277'.
           03                          PIC X(44)   VALUE
               '71111531277712115312777131713034371417130343'.
           03                          PIC X(44)   VALUE
               '71511531277716051651697171153127771805165169'.
           03                          PIC X(44)   VALUE
               '72211531277723060191877240516516972505165169'.
           03                          PIC X(44)   VALUE
               '72605165169727085392527280655721572911531277'.
           03                          PIC X(44)   VALUE
               '73005165169734115312777351153127773611531277'.
           03                          PIC X(44)   VALUE
               '73711531277738051651697391629734074011531277'.
           03                          PIC X(44)   VALUE
               '74106019187742115312777431153127774417130343'.
           03                          PIC X(44)   VALUE
               '74517130343746081942277470516516974811531277'.
           03                          PIC X(44)   VALUE
               '74911531277750051651697541713034375505165169'.
           03                          PIC X(44)   VALUE
               '75605165169757072662157580726621575905165169'.
           03                          PIC X(44)   VALUE
               '76005165169761051651697650516516976605165169'.
           03                          PIC X(44)   VALUE
               '76705165169768051651697690516516977005165169'.
           03                          PIC X(44)   VALUE
               '77405165169775051651697760601918777705165169'.
           03                          PIC X(44)   VALUE
               '77805165169779051651697800516516978105165169'.
           03                          PIC X(44)   VALUE
               '78205165169789051651697901713034379117130343'.
           03                          PIC X(44)   VALUE
               '79205165169793051651697940516516979505165169'.
           03                          PIC X(44)   VALUE
               '79917396352800115312778011153127780208194227'.
           03                          PIC X(44)   VALUE
               '80308194227804081942278081153127780911531277'.
           03                          PIC X(44)   VALUE
               '81011531277811071862138120601918781311531277'.
           03                          PIC X(44)   VALUE
               '81408194227815081942278160819422782008194227'.
           03                          PIC X(44)   VALUE
               '82108194227822081942278230819422782408194227'.
           03                          PIC X(44)   VALUE
               '82508194227826081942278270819422782808194227'.
           03                          PIC X(44)   VALUE
               '82908194227830081942278340601918783506019187'.
           03                          PIC X(44)   VALUE
               '83606019187837060191878380601918783906019187'.
           03                          PIC X(44)   VALUE
               '84009184227841051651698420516516984308194227'.
           03                          PIC X(44)   VALUE
               '84406019187845060191878461713034384717130343'.
           03                          PIC X(44)   VALUE
               '84811531277849115312778531894237385408194227'.
           03                          PIC X(44)   VALUE
               '85508194227856142573188570962427085809624270'.
           03                          PIC X(44)   VALUE
               '86210736256863070012158640601918786510947260'.
           03                          PIC X(44)   VALUE
               '86606019187867102952428680819422786906019187'.
           03                          PIC X(44)   VALUE
               '87019038299871094232298720612119687607881229'.
           03                          PIC X(44)   VALUE
               '88004959177881062142038820621420388306214203'.
           03                          PIC X(44)   VALUE
               '88405152245885049012318860495917788704959177'.
           03                          PIC X(44)   VALUE
               '89404959177895046702548960788122989706214203'.
           03                          PIC X(44)   VALUE
               '90115099344902107032809030819422790417130343'.
           03                          PIC X(44)   VALUE
               '90508194227906081942279071445132990811531277'.
           03                          PIC X(44)   VALUE
               '90905165169913081942279140516516991511531277'.
           03                          PIC X(44)   VALUE
               '91605165169917134822359180516516991911476274'.
           03                          PIC X(44)   VALUE
               '92008001234921060191879220819422792308194227'.
           03                          PIC X(44)   VALUE
               '92705165169928051651699290516516993308194227'.
           03                          PIC X(44)   VALUE
               '93406019187935060191879391314331794008184241'.
           03                          PIC X(44)   VALUE
               '94106019187945066212059460406316394708194227'.
           03                          PIC X(44)   VALUE
               '94805165169949074312149500432016095108194227'.
           03                          PIC X(44)   VALUE
               '95511531277956093432349571713034395806019187'.
           03                          PIC X(44)   VALUE
               '95906019187963171303439641153127796511531277'.
           03                          PIC X(44)   VALUE
               '96917130343970081942279741176424297508194227'.
           03                          PIC X(44)   VALUE
               '97605165169977081942279812213640198211418278'.
           03                          PIC X(44)   VALUE
               '98308194227987196093919881713034398905165169'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 744 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
