       01  W-DRG-FILLS.
           03                          PIC X(44)   VALUE
               '00338102559004281504440110480815801204808158'.
           03                          PIC X(44)   VALUE
               '01304808158014060641860160606418601706064186'.
           03                          PIC X(44)   VALUE
               '02008779224021060641860220480815802315478336'.
           03                          PIC X(44)   VALUE
               '02404808158025105542620260480815802704808158'.
           03                          PIC X(44)   VALUE
               '02810554262029060641860300606418603115478336'.
           03                          PIC X(44)   VALUE
               '03206064186033060641860341760839503517608395'.
           03                          PIC X(44)   VALUE
               '03617608395037154783360381547833603915478336'.
           03                          PIC X(44)   VALUE
               '04016303357041060641860420606418605211249379'.
           03                          PIC X(44)   VALUE
               '05311249379054154783360551547833605608732250'.
           03                          PIC X(44)   VALUE
               '05706673224058079222180590606418606006064186'.
           03                          PIC X(44)   VALUE
               '06108629230062059811940630480815806408779224'.
           03                          PIC X(44)   VALUE
               '06506064186066048081580670598119406804808158'.
           03                          PIC X(44)   VALUE
               '06904808158070086292300710598119407204808158'.
           03                          PIC X(44)   VALUE
               '07309848237074060641860750606418607606064186'.
           03                          PIC X(44)   VALUE
               '07706064186078060641860790606418608010554262'.
           03                          PIC X(44)   VALUE
               '08107922218082087912450830480815808404808158'.
           03                          PIC X(44)   VALUE
               '08507922218086079222180870480815808807922218'.
           03                          PIC X(44)   VALUE
               '08907922218090048081580910984625509205851201'.
           03                          PIC X(44)   VALUE
               '09304808158094118902750950801623509604808158'.
           03                          PIC X(44)   VALUE
               '09710536233098060641860990606418610008822215'.
           03                          PIC X(44)   VALUE
               '10107922218102048081581030480815811304808158'.
           03                          PIC X(44)   VALUE
               '11404808158115154783361161547833611704808158'.
           03                          PIC X(44)   VALUE
               '12107922218122048081581230792221812406064186'.
           03                          PIC X(44)   VALUE
               '12504808158129154783361300480815813104808158'.
           03                          PIC X(44)   VALUE
               '13204808158133154783361340480815813504808158'.
           03                          PIC X(44)   VALUE
               '13604808158137105542621380480815813915478336'.
           03                          PIC X(44)   VALUE
               '14607922218147079222181480792221814904808158'.
           03                          PIC X(44)   VALUE
               '15006064186151060641861521055426215310554262'.
           03                          PIC X(44)   VALUE
               '15406064186155048081581560480815815710554262'.
           03                          PIC X(44)   VALUE
               '15806064186159048081581632492440716410554262'.
           03                          PIC X(44)   VALUE
               '16510554262166233924051671642731816816427318'.
           03                          PIC X(44)   VALUE
               '17506442179176060641861770803521517806729194'.
           03                          PIC X(44)   VALUE
               '17906729194180105542621810792221818207922218'.
           03                          PIC X(44)   VALUE
               '18304808158184048081581850480815818607382205'.
           03                          PIC X(44)   VALUE
               '18706064186188060641861890961621519007572191'.
           03                          PIC X(44)   VALUE
               '19105484161192054841611930752019319405562163'.
           03                          PIC X(44)   VALUE
               '19504808158196080122011970792221819807922218'.
           03                          PIC X(44)   VALUE
               '19907100202200048081582010480815820206232175'.
           03                          PIC X(44)   VALUE
               '20306232175204060641862050969223820606064186'.
           03                          PIC X(44)   VALUE
               '20718628321208111002162151351128621613511286'.
           03                          PIC X(44)   VALUE
               '21713511286218135112862191351128622013511286'.
           03                          PIC X(44)   VALUE
               '22113511286222154783362231547833622415478336'.
           03                          PIC X(44)   VALUE
               '22515478336226154783362271547833622807922218'.
           03                          PIC X(44)   VALUE
               '22907922218231135112862321351128623313511286'.
           03                          PIC X(44)   VALUE
               '23413511286235135112862361351128623917608395'.
           03                          PIC X(44)   VALUE
               '24015478336241154783362421547833624307922218'.
           03                          PIC X(44)   VALUE
               '24404808158245154783362461547833624707922218'.
           03                          PIC X(44)   VALUE
               '24804808158249048081582501547833625104808158'.
           03                          PIC X(44)   VALUE
               '25213511286253079222182540792221825515478336'.
           03                          PIC X(44)   VALUE
               '25607922218257079222182581547833625915478336'.
           03                          PIC X(44)   VALUE
               '26015478336261079222182620792221826306064186'.
           03                          PIC X(44)   VALUE
               '26413001322265079222182660792221826707922218'.
           03                          PIC X(44)   VALUE
               '26813511286269135112862701547833627107922218'.
           03                          PIC X(44)   VALUE
               '27207922218273154783362741547833628007842218'.
           03                          PIC X(44)   VALUE
               '28106149188282048081582830792221828407922218'.
           03                          PIC X(44)   VALUE
               '28507922218286154783362871547833628810843260'.
           03                          PIC X(44)   VALUE
               '28908629270290086292702910796420029206008188'.
           03                          PIC X(44)   VALUE
               '29304808158294062522002950606418629604808158'.
           03                          PIC X(44)   VALUE
               '29704808158298048081582990823922130006252200'.
           03                          PIC X(44)   VALUE
               '30106064186302075601973030606418630407922218'.
           03                          PIC X(44)   VALUE
               '30506064186306074441983070744419830807783207'.
           03                          PIC X(44)   VALUE
               '30906064186310048081583110480815831207922218'.
           03                          PIC X(44)   VALUE
               '31304808158314103632423150757721331606064186'.
           03                          PIC X(44)   VALUE
               '31907922218320079222183261547833632704808158'.
           03                          PIC X(44)   VALUE
               '32804808158329154783363301547833633104808158'.
           03                          PIC X(44)   VALUE
               '33215478336333062911873340480815833509331231'.
           03                          PIC X(44)   VALUE
               '33606291187337048081583380933123133906291187'.
           03                          PIC X(44)   VALUE
               '34004808158341060641863420606418634306064186'.
           03                          PIC X(44)   VALUE
               '34410554262345062911873460480815834715478336'.
           03                          PIC X(44)   VALUE
               '34806291187349048081583500933123135106291187'.
           03                          PIC X(44)   VALUE
               '35204808158353154783363540629118735504808158'.
           03                          PIC X(44)   VALUE
               '35614825340357105542623581055426236810554262'.
           03                          PIC X(44)   VALUE
               '36910554262370105542623710933123137206291187'.
           03                          PIC X(44)   VALUE
               '37304808158374082912383750829123837608291238'.
           03                          PIC X(44)   VALUE
               '37708018209378079222183790480815838010265264'.
           03                          PIC X(44)   VALUE
               '38107922218382079222183831055426238404808158'.
           03                          PIC X(44)   VALUE
               '38515478336386060641863870606418638809392234'.
           03                          PIC X(44)   VALUE
               '38906453187390064531873910999124639206165176'.
           03                          PIC X(44)   VALUE
               '39310913262394079202263950792022640510554262'.
           03                          PIC X(44)   VALUE
               '40607922218407048081584080801820940907922218'.
           03                          PIC X(44)   VALUE
               '41004808158411080182094120792221841304808158'.
           03                          PIC X(44)   VALUE
               '41415478336415060641864160606418641710554262'.
           03                          PIC X(44)   VALUE
               '41806064186419060641864200606418642106064186'.
           03                          PIC X(44)   VALUE
               '42206064186423105542624241055426242506064186'.
           03                          PIC X(44)   VALUE
               '43208497216433060641864340606418643510554262'.
           03                          PIC X(44)   VALUE
               '43604808158437048081584380925120943908336220'.
           03                          PIC X(44)   VALUE
               '44004808158441084002064420606418644306064186'.
           03                          PIC X(44)   VALUE
               '44408779230445079222184460792221845309364238'.
           03                          PIC X(44)   VALUE
               '45407210226455048081584560936423845707210226'.
           03                          PIC X(44)   VALUE
               '45804808158459093642384600721022646109364238'.
           03                          PIC X(44)   VALUE
               '46207210226463147803674641107432546507922218'.
           03                          PIC X(44)   VALUE
               '46617458404467079222184680792221846917458404'.
           03                          PIC X(44)   VALUE
               '47007922218471154783364720721022647304808158'.
           03                          PIC X(44)   VALUE
               '47417458404475079222184760792221847715478336'.
           03                          PIC X(44)   VALUE
               '47815478336479154783364801055426248110554262'.
           03                          PIC X(44)   VALUE
               '48210554262483048081584851547833648615478336'.
           03                          PIC X(44)   VALUE
               '48715478336488060641864890606418649206064186'.
           03                          PIC X(44)   VALUE
               '49306064186494060641864951055426249607922218'.
           03                          PIC X(44)   VALUE
               '49707922218498105542624991055426250013572327'.
           03                          PIC X(44)   VALUE
               '50110554262502105542625031547833650407922218'.
           03                          PIC X(44)   VALUE
               '50507922218506048081585070792221850804808158'.
           03                          PIC X(44)   VALUE
               '50904808158510105542625110792221851204808158'.
           03                          PIC X(44)   VALUE
               '51310554262514105542625151584235651615842356'.
           03                          PIC X(44)   VALUE
               '51715842356518154783365190721022652004808158'.
           03                          PIC X(44)   VALUE
               '53310554262534105542625350606418653604808158'.
           03                          PIC X(44)   VALUE
               '53706064186538048081585391062728554008771264'.
           03                          PIC X(44)   VALUE
               '54108771264542079222185430792221854407922218'.
           03                          PIC X(44)   VALUE
               '54514055280546105542625471055426254811103288'.
           03                          PIC X(44)   VALUE
               '54906247216550048081585511096828755207922218'.
           03                          PIC X(44)   VALUE
               '55307922218554079222185550792221855606064186'.
           03                          PIC X(44)   VALUE
               '55710665268558071622235590931325256008125244'.
           03                          PIC X(44)   VALUE
               '56104808158562079222185630792221856409364238'.
           03                          PIC X(44)   VALUE
               '56507210226566048081585701291632657110104287'.
           03                          PIC X(44)   VALUE
               '57210104287573163464255741547833657510554262'.
           03                          PIC X(44)   VALUE
               '57615478336577060641865780606418657915422351'.
           03                          PIC X(44)   VALUE
               '58011137326581111373265821010428758310104287'.
           03                          PIC X(44)   VALUE
               '58410104287585101042875920962925359307183234'.
           03                          PIC X(44)   VALUE
               '59407183234595079222185960480815859707922218'.
           03                          PIC X(44)   VALUE
               '59804808158599048081586000792221860104808158'.
           03                          PIC X(44)   VALUE
               '60208238227603056781806040901925660506064186'.
           03                          PIC X(44)   VALUE
               '60609652234607060641866140606418661504808158'.
           03                          PIC X(44)   VALUE
               '61613567347617129983066180792221861915478336'.
           03                          PIC X(44)   VALUE
               '62010554262621105542626221311234262311241298'.
           03                          PIC X(44)   VALUE
               '62406064186625146403356261055426262707920226'.
           03                          PIC X(44)   VALUE
               '62814640335629105542626300792022663710019245'.
           03                          PIC X(44)   VALUE
               '63808028233639048081586400906922964106217186'.
           03                          PIC X(44)   VALUE
               '64215478336643060641866440606418664504808158'.
           03                          PIC X(44)   VALUE
               '65307922218654079222186550792221865610554262'.
           03                          PIC X(44)   VALUE
               '65710554262658105542626591055426266007922218'.
           03                          PIC X(44)   VALUE
               '66107922218662105542626630606418666404808158'.
           03                          PIC X(44)   VALUE
               '66506064186666060641866670606418666807922218'.
           03                          PIC X(44)   VALUE
               '66907922218670079222186710732720967207327209'.
           03                          PIC X(44)   VALUE
               '67314304311674105542626750732720968209511229'.
           03                          PIC X(44)   VALUE
               '68307327209684073272096861055426268710554262'.
           03                          PIC X(44)   VALUE
               '68806045184689072172086900525916669307922218'.
           03                          PIC X(44)   VALUE
               '69404808158695105542626961055426269709618230'.
           03                          PIC X(44)   VALUE
               '69809618230699060451847000480815870710554262'.
           03                          PIC X(44)   VALUE
               '70810554262709154783367100604518471115478336'.
           03                          PIC X(44)   VALUE
               '71207327209713154783367141547833671507327209'.
           03                          PIC X(44)   VALUE
               '71607327209717105542627180732720972204808158'.
           03                          PIC X(44)   VALUE
               '72304808158724048081587250480815872604808158'.
           03                          PIC X(44)   VALUE
               '72708670239728064012037290792221873007922218'.
           03                          PIC X(44)   VALUE
               '73407922218735079222187360792221873707922218'.
           03                          PIC X(44)   VALUE
               '73807922218739146403357401055426274104808158'.
           03                          PIC X(44)   VALUE
               '74207922218743079222187440792221874507922218'.
           03                          PIC X(44)   VALUE
               '74607922218747079222187480792221874907922218'.
           03                          PIC X(44)   VALUE
               '75007922218754079222187550792221875607922218'.
           03                          PIC X(44)   VALUE
               '75708908247758060641867590606418676015478336'.
           03                          PIC X(44)   VALUE
               '76107327209768060641867690606418677006064186'.
           03                          PIC X(44)   VALUE
               '77615478336779060641867831055426278410554262'.
           03                          PIC X(44)   VALUE
               '78510554262786105542627871055426278810554262'.
           03                          PIC X(44)   VALUE
               '78906064186790060641867910606418679206064186'.
           03                          PIC X(44)   VALUE
               '79306064186794060641867950606418679606064186'.
           03                          PIC X(44)   VALUE
               '79706064186798060641867991482534080010554262'.
           03                          PIC X(44)   VALUE
               '80110554262802060641868030606418680406064186'.
           03                          PIC X(44)   VALUE
               '80507922218806079222188070792221880807922218'.
           03                          PIC X(44)   VALUE
               '80907922218810079222188111547833681206064186'.
           03                          PIC X(44)   VALUE
               '81310554262814079222188150606418681606064186'.
           03                          PIC X(44)   VALUE
               '81706064186818060641868190606418682006064186'.
           03                          PIC X(44)   VALUE
               '82106064186822060641868230792221882407922218'.
           03                          PIC X(44)   VALUE
               '82507922218826060641868270606418682806064186'.
           03                          PIC X(44)   VALUE
               '82906064186830060641868310606418683206064186'.
           03                          PIC X(44)   VALUE
               '83306064186834060641868350606418683606064186'.
           03                          PIC X(44)   VALUE
               '83704808158838048081588390480815884008798214'.
           03                          PIC X(44)   VALUE
               '84104808158842048081588431055426284404808158'.
           03                          PIC X(44)   VALUE
               '84504808158846105542628470480815884804808158'.
           03                          PIC X(44)   VALUE
               '84915478336853185413778540889724485508897244'.
           03                          PIC X(44)   VALUE
               '85616181351857109153148581091531486210778257'.
           03                          PIC X(44)   VALUE
               '86307705222864154783368650792221886607922218'.
           03                          PIC X(44)   VALUE
               '86709878227868098782278690987822787019648299'.
           03                          PIC X(44)   VALUE
               '87109217227872061441908760788122988004959177'.
           03                          PIC X(44)   VALUE
               '88106214203882062142038830621420388405152245'.
           03                          PIC X(44)   VALUE
               '88504901231886049591778870495917789404959177'.
           03                          PIC X(44)   VALUE
               '89504670254896078812298970621420390114295340'.
           03                          PIC X(44)   VALUE
               '90211393313903113933139041055426290510554262'.
           03                          PIC X(44)   VALUE
               '90617350384907173503849080792221890907922218'.
           03                          PIC X(44)   VALUE
               '91304808158914048081589150480815891604808158'.
           03                          PIC X(44)   VALUE
               '91710554262918048081589191158427592008294227'.
           03                          PIC X(44)   VALUE
               '92107922218922105542629230606418692707922218'.
           03                          PIC X(44)   VALUE
               '92807922218929079222189331055426293406064186'.
           03                          PIC X(44)   VALUE
               '93507922218939123753059401160530094106064186'.
           03                          PIC X(44)   VALUE
               '94506621205946040631639470771420594806064186'.
           03                          PIC X(44)   VALUE
               '94907192210950037501429511547833695507922218'.
           03                          PIC X(44)   VALUE
               '95604808158957154783369581055426295907922218'.
           03                          PIC X(44)   VALUE
               '96310554262964079222189650606418696915478336'.
           03                          PIC X(44)   VALUE
               '97015478336974099292259750992922597606064186'.
           03                          PIC X(44)   VALUE
               '97715478336981223244049821350030198307900218'.
           03                          PIC X(33)   VALUE
               '987212003699881480027798904800158'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 751 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
