       01  W-DRG-FILLS.
           03                          PIC X(45)   VALUE
               '003400885950496004290634430369011189644000221'.
           03                          PIC X(45)   VALUE
               '012067982050148013050081620102014086132310193'.
           03                          PIC X(45)   VALUE
               '016086132310193017086132310193020074162230186'.
           03                          PIC X(45)   VALUE
               '021046351920160022046351920130023189644000182'.
           03                          PIC X(45)   VALUE
               '024189644000091025189644000148026189644000095'.
           03                          PIC X(45)   VALUE
               '027189644000046028112872850191029112872850106'.
           03                          PIC X(45)   VALUE
               '030086132310053031189644000175032086132310075'.
           03                          PIC X(45)   VALUE
               '033086132310036034207073840125035207073840052'.
           03                          PIC X(45)   VALUE
               '036207073840021037189644000130038189644000050'.
           03                          PIC X(45)   VALUE
               '039067982050021040140983420169041112872850092'.
           03                          PIC X(45)   VALUE
               '042112872850051052099534050094053050081620054'.
           03                          PIC X(45)   VALUE
               '054067982050084055050081620064056085142530114'.
           03                          PIC X(45)   VALUE
               '057065532260078058112872850104059085142530070'.
           03                          PIC X(45)   VALUE
               '060065532260055061091042350112062070522130066'.
           03                          PIC X(45)   VALUE
               '063067982050045064074162230100065046351920061'.
           03                          PIC X(45)   VALUE
               '066046351920041067112872850074068067982050044'.
           03                          PIC X(45)   VALUE
               '069050081620038070091042350101071070522130070'.
           03                          PIC X(45)   VALUE
               '072067982050046073109522610079074086132310058'.
           03                          PIC X(45)   VALUE
               '075050081620104076050081620057077112872850091'.
           03                          PIC X(45)   VALUE
               '078050081620057079050081620040080067982050086'.
           03                          PIC X(45)   VALUE
               '081050081620054082112872850094083086132310067'.
           03                          PIC X(45)   VALUE
               '084067982050042085097022880107086068992040063'.
           03                          PIC X(45)   VALUE
               '087050081620041088097022880083089068992040052'.
           03                          PIC X(45)   VALUE
               '090050081620035091089402330091092075572380060'.
           03                          PIC X(45)   VALUE
               '093050081620042094104632750178095085052610115'.
           03                          PIC X(45)   VALUE
               '096050081620085097095462090170098067982050115'.
           03                          PIC X(45)   VALUE
               '099067982050077100086182510090101050081620050'.
           03                          PIC X(45)   VALUE
               '102189644000064103050081620045113067982050096'.
           03                          PIC X(45)   VALUE
               '114050081620048115050081620077116067982050083'.
           03                          PIC X(45)   VALUE
               '117050081620040121189644000082122050081620053'.
           03                          PIC X(45)   VALUE
               '123050081620039124050081620081125050081620051'.
           03                          PIC X(45)   VALUE
               '129112872850086130050081620043131067982050099'.
           03                          PIC X(45)   VALUE
               '132050081620039133112872850092134050081620037'.
           03                          PIC X(45)   VALUE
               '135067982050101136050081620039137067982050078'.
           03                          PIC X(45)   VALUE
               '138050081620041139067982050034146112872850138'.
           03                          PIC X(45)   VALUE
               '147050081620089148050081620054149050081620038'.
           03                          PIC X(45)   VALUE
               '150086132310079151067982050044152086132310069'.
           03                          PIC X(45)   VALUE
               '153067982050049154112872850085155067982050059'.
           03                          PIC X(45)   VALUE
               '156050081620043157086132310097158067982050057'.
           03                          PIC X(45)   VALUE
               '159050081620037163255834250204164112872850098'.
           03                          PIC X(45)   VALUE
               '165112872850055166246284160169167160613300099'.
           03                          PIC X(45)   VALUE
               '168112872850060175072852100090176067982050059'.
           03                          PIC X(45)   VALUE
               '177083592200116178065871900088179050081620065'.
           03                          PIC X(45)   VALUE
               '180086132310109181067982050076182050081620048'.
           03                          PIC X(45)   VALUE
               '183112872850091184112872850060185112872850043'.
           03                          PIC X(45)   VALUE
               '186093452160096187093452160069188050081620048'.
           03                          PIC X(45)   VALUE
               '189090122140077190076531940074191058951660061'.
           03                          PIC X(45)   VALUE
               '192051951470048193074501970088194055981660065'.
           03                          PIC X(45)   VALUE
               '195050081620050196076861860102197076861860068'.
           03                          PIC X(45)   VALUE
               '198050081620052199087432260117200067982050068'.
           03                          PIC X(45)   VALUE
               '201050081620050202065051690059203050081620045'.
           03                          PIC X(45)   VALUE
               '204077712170043205081982070085206067982050050'.
           03                          PIC X(45)   VALUE
               '207185423190206208110332180115215152593050254'.
           03                          PIC X(45)   VALUE
               '216152593050254217152593050148218086132310108'.
           03                          PIC X(45)   VALUE
               '219152593050178220152593050098221152593050077'.
           03                          PIC X(45)   VALUE
               '222112872850189223112872850114224112872850154'.
           03                          PIC X(45)   VALUE
               '225112872850074226189644000147227189644000074'.
           03                          PIC X(45)   VALUE
               '228152593050193229086132310091231152593050188'.
           03                          PIC X(45)   VALUE
               '232127523200125233152593050189234127523200116'.
           03                          PIC X(45)   VALUE
               '235152593050149236127523200088239207073840210'.
           03                          PIC X(45)   VALUE
               '240112872850132241112872850078242112872850116'.
           03                          PIC X(45)   VALUE
               '243112872850068244112872850043245189644000090'.
           03                          PIC X(45)   VALUE
               '246189644000088247127523200040248189644000102'.
           03                          PIC X(45)   VALUE
               '249112872850047250189644000088251112872850044'.
           03                          PIC X(45)   VALUE
               '252152593050132253086132310092254086132310046'.
           03                          PIC X(45)   VALUE
               '255189644000141256086132310098257086132310064'.
           03                          PIC X(45)   VALUE
               '258112872850111259112872850055260112872850168'.
           03                          PIC X(45)   VALUE
               '261086132310071262086132310044263112872850102'.
           03                          PIC X(45)   VALUE
               '264127523200140265112872850071266152593050138'.
           03                          PIC X(45)   VALUE
               '267086132310066268152593050166269127523200039'.
           03                          PIC X(45)   VALUE
               '270189644000162271112872850096272112872850047'.
           03                          PIC X(45)   VALUE
               '273112872850132274067982050055280091612450091'.
           03                          PIC X(45)   VALUE
               '281067982050053282067982050035283081031620075'.
           03                          PIC X(45)   VALUE
               '284081031620036285081031620022286189644000113'.
           03                          PIC X(45)   VALUE
               '287112872850052288107322660157289071592330102'.
           03                          PIC X(45)   VALUE
               '290050081620086291081752140091292063451860066'.
           03                          PIC X(45)   VALUE
               '293050081620045294067982050075295067982050056'.
           03                          PIC X(45)   VALUE
               '296081752140044297063451860021298050081620015'.
           03                          PIC X(45)   VALUE
               '299081132180087300061372060068301050081620049'.
           03                          PIC X(45)   VALUE
               '302101092300059303050081620035304067982050064'.
           03                          PIC X(45)   VALUE
               '305067982050040306093992370086307067982050050'.
           03                          PIC X(45)   VALUE
               '308081322180076309050081620049310050081620034'.
           03                          PIC X(45)   VALUE
               '311050081620034312050081620045313086132310032'.
           03                          PIC X(45)   VALUE
               '314100922410110315071822080060316050081620038'.
           03                          PIC X(45)   VALUE
               '326189644000230327067982050119328063141990049'.
           03                          PIC X(45)   VALUE
               '329189644000219330063141990119331063141990065'.
           03                          PIC X(45)   VALUE
               '332189644000196333063141990107334063141990061'.
           03                          PIC X(45)   VALUE
               '335189644000200336112872850127337063141990078'.
           03                          PIC X(45)   VALUE
               '338095422420134339063141990088340063141990051'.
           03                          PIC X(45)   VALUE
               '341095422420100342063141990055343063141990029'.
           03                          PIC X(45)   VALUE
               '344189644000170345063141990092346063141990058'.
           03                          PIC X(45)   VALUE
               '347189644000134348063141990081349063141990044'.
           03                          PIC X(45)   VALUE
               '350095422420125351063141990067352063141990040'.
           03                          PIC X(45)   VALUE
               '353189644000129354067982050076355067982050046'.
           03                          PIC X(45)   VALUE
               '356146643400184357086132310103358063141990063'.
           03                          PIC X(45)   VALUE
               '368103082250101369067982050059370067982050042'.
           03                          PIC X(45)   VALUE
               '371095422420117372063141990080373063141990059'.
           03                          PIC X(45)   VALUE
               '374095542470128375086132310080376060831830051'.
           03                          PIC X(45)   VALUE
               '377087572340094378050081620057379050081620039'.
           03                          PIC X(45)   VALUE
               '380086132310113381086132310065382086132310048'.
           03                          PIC X(45)   VALUE
               '383086132310079384050081620051385112872850111'.
           03                          PIC X(45)   VALUE
               '386050081620071387050081620054388106562340107'.
           03                          PIC X(45)   VALUE
               '389066472020065390050081620047391083112240079'.
           03                          PIC X(45)   VALUE
               '392060831830051393110672630103394075922110064'.
           03                          PIC X(45)   VALUE
               '395067982050044405189644000226406050081620116'.
           03                          PIC X(45)   VALUE
               '407050081620078408112872850184409112872850107'.
           03                          PIC X(45)   VALUE
               '410112872850076411050081620135412050081620110'.
           03                          PIC X(45)   VALUE
               '413050081620076414112872850160415112872850096'.
           03                          PIC X(45)   VALUE
               '416112872850060417112872850108418112872850072'.
           03                          PIC X(45)   VALUE
               '419112872850045420189644000181421067601860089'.
           03                          PIC X(45)   VALUE
               '422050081620055423112872850213424112872850127'.
           03                          PIC X(45)   VALUE
               '425062891750060432062891750099433062891750063'.
           03                          PIC X(45)   VALUE
               '434062891750046435112872850106436112872850077'.
           03                          PIC X(45)   VALUE
               '437060831830054438110832340106439067601860064'.
           03                          PIC X(45)   VALUE
               '440050081620046441096082300110442060821900064'.
           03                          PIC X(45)   VALUE
               '443050081620047444081212170094445081212170061'.
           03                          PIC X(45)   VALUE
               '446081212170043453189644000166454076052490083'.
           03                          PIC X(45)   VALUE
               '455076052490050456096502650180457083042350094'.
           03                          PIC X(45)   VALUE
               '458083042350054459113223030128460067982050051'.
           03                          PIC X(45)   VALUE
               '461112872850127462050081620045463157163870222'.
           03                          PIC X(45)   VALUE
               '464122893420119465112872850070466189644000125'.
           03                          PIC X(45)   VALUE
               '467189644000061468050081620040469091452420104'.
           03                          PIC X(45)   VALUE
               '470050081620041471096502650149472083042350052'.
           03                          PIC X(45)   VALUE
               '473083042350025474189644000180475112872850111'.
           03                          PIC X(45)   VALUE
               '476112872850059477189644000158478086132310103'.
           03                          PIC X(45)   VALUE
               '479086132310068480112872850115481112872850068'.
           03                          PIC X(45)   VALUE
               '482112872850054483091452420032485112872850141'.
           03                          PIC X(45)   VALUE
               '486112872850087487112872850063488084092530061'.
           03                          PIC X(45)   VALUE
               '489067982050036492086132310120493086132310071'.
           03                          PIC X(45)   VALUE
               '494086132310047495133193720155496112872850081'.
           03                          PIC X(45)   VALUE
               '497112872850039498189644000114499112872850043'.
           03                          PIC X(45)   VALUE
               '500130523390160501086132310084502050081620046'.
           03                          PIC X(45)   VALUE
               '503112872850130504112872850091505067982050054'.
           03                          PIC X(45)   VALUE
               '506189644000073507189644000086508189644000042'.
           03                          PIC X(45)   VALUE
               '509050081620076510134753290093511112872850059'.
           03                          PIC X(45)   VALUE
               '512112872850038513189644000081514189644000043'.
           03                          PIC X(45)   VALUE
               '515134753290135516112872850082517112872850050'.
           03                          PIC X(45)   VALUE
               '518189644000092519083042350064520083042350034'.
           03                          PIC X(45)   VALUE
               '533050081620087534050081620054535086132310078'.
           03                          PIC X(45)   VALUE
               '536050081620051537086132310061538050081620043'.
           03                          PIC X(45)   VALUE
               '539113672990130540084092530092541067982050072'.
           03                          PIC X(45)   VALUE
               '542112872850118543050081620076544050081620053'.
           03                          PIC X(45)   VALUE
               '545112872850136546112872850074547050081620049'.
           03                          PIC X(45)   VALUE
               '548096502650117549083042350082550083042350058'.
           03                          PIC X(45)   VALUE
               '551113223030094552067982050057553086132310082'.
           03                          PIC X(45)   VALUE
               '554050081620052555086132310079556050081620050'.
           03                          PIC X(45)   VALUE
               '557099012520090558072052460058559093952620106'.
           03                          PIC X(45)   VALUE
               '560076052490067561076052490042562050081620080'.
           03                          PIC X(45)   VALUE
               '563050081620052564091452420101565071202230067'.
           03                          PIC X(45)   VALUE
               '566050081620050570134773420140571106332700092'.
           03                          PIC X(45)   VALUE
               '572067982050067573180854520197574180854520148'.
           03                          PIC X(45)   VALUE
               '575067982050085576189644000202577086132310103'.
           03                          PIC X(45)   VALUE
               '578067982050055579139123410143580139123410087'.
           03                          PIC X(45)   VALUE
               '581067982050046582139123410046583067982050028'.
           03                          PIC X(45)   VALUE
               '584050081620078585050081620039592093302560100'.
           03                          PIC X(45)   VALUE
               '593065032040075594050081620059595112872850123'.
           03                          PIC X(45)   VALUE
               '596050081620071597086132310115598050081620080'.
           03                          PIC X(45)   VALUE
               '599050081620051600112872850070601050081620049'.
           03                          PIC X(45)   VALUE
               '602080232240094603058141820062604086132310082'.
           03                          PIC X(45)   VALUE
               '605086132310050606113832550094607067982050056'.
           03                          PIC X(45)   VALUE
               '614165113450086615165113450034616132713440193'.
           03                          PIC X(45)   VALUE
               '617112872850109618112872850073619146643400092'.
           03                          PIC X(45)   VALUE
               '620086132310042621063141990026622135943260190'.
           03                          PIC X(45)   VALUE
               '623102162930105624050081620066625165113450124'.
           03                          PIC X(45)   VALUE
               '626165113450054627063141990058628165113450158'.
           03                          PIC X(45)   VALUE
               '629165113450110630063141990058637102942670082'.
           03                          PIC X(45)   VALUE
               '638076892430056639059611960039640084642340071'.
           03                          PIC X(45)   VALUE
               '641059611960051642076892430069643112872850100'.
           03                          PIC X(45)   VALUE
               '644067982050069645067982050051653112872850223'.
           03                          PIC X(45)   VALUE
               '654086132310117655086132310079656086132310137'.
           03                          PIC X(45)   VALUE
               '657086132310075658086132310040659189644000163'.
           03                          PIC X(45)   VALUE
               '660086132310085661086132310040662086132310157'.
           03                          PIC X(45)   VALUE
               '663067462180082664067982050037665112872850168'.
           03                          PIC X(45)   VALUE
               '666112872850102667112872850044668112872850134'.
           03                          PIC X(45)   VALUE
               '669112872850063670112872850041671143373200084'.
           03                          PIC X(45)   VALUE
               '672067982050040673143373200170674086132310111'.
           03                          PIC X(45)   VALUE
               '675067982050051682094542330095683073852140064'.
           03                          PIC X(45)   VALUE
               '684050081620043685112872850058686086132310113'.
           03                          PIC X(45)   VALUE
               '687067462180073688067982050040689070912050075'.
           03                          PIC X(45)   VALUE
               '690048721710056691143373200063692050081620035'.
           03                          PIC X(45)   VALUE
               '693067982050079694050081620037695189644000082'.
           03                          PIC X(45)   VALUE
               '696189644000048697067982050052698094002370098'.
           03                          PIC X(45)   VALUE
               '699067462180068700067982050050707086132310057'.
           03                          PIC X(45)   VALUE
               '708086132310022709112872850112710086132310033'.
           03                          PIC X(45)   VALUE
               '711189644000121712112872850051713112872850080'.
           03                          PIC X(45)   VALUE
               '714112872850029715112872850119716067982050028'.
           03                          PIC X(45)   VALUE
               '717112872850090718067982050048722112872850113'.
           03                          PIC X(45)   VALUE
               '723112872850075724067982050045725067982050090'.
           03                          PIC X(45)   VALUE
               '726067982050051727067982050093728067982050058'.
           03                          PIC X(45)   VALUE
               '729084082430074730067982050044734189644000112'.
           03                          PIC X(45)   VALUE
               '735189644000033736189644000179737112872850086'.
           03                          PIC X(45)   VALUE
               '738067982050050739165113450152740165113450066'.
           03                          PIC X(45)   VALUE
               '741063141990032742189644000063743189644000029'.
           03                          PIC X(45)   VALUE
               '744050081620087745050081620038746189644000077'.
           03                          PIC X(45)   VALUE
               '747067982050029748189644000031749189644000135'.
           03                          PIC X(45)   VALUE
               '750067982050047754050081620126755050081620076'.
           03                          PIC X(45)   VALUE
               '756050081620042757085112410103758067982050078'.
           03                          PIC X(45)   VALUE
               '759050081620053760189644000056761067982050031'.
           03                          PIC X(45)   VALUE
               '765050081620066766050081620040767050081620043'.
           03                          PIC X(45)   VALUE
               '768050081620031769189644000094770085112410040'.
           03                          PIC X(45)   VALUE
               '774050081620044775050081620031776067982050048'.
           03                          PIC X(45)   VALUE
               '777050081620035778050081620046779050081620034'.
           03                          PIC X(45)   VALUE
               '780050081620040781050081620062782050081620037'.
           03                          PIC X(45)   VALUE
               '789050081620018790050081620179791050081620133'.
           03                          PIC X(45)   VALUE
               '792050081620086793050081620047794050081620034'.
           03                          PIC X(45)   VALUE
               '795050081620031799146643400183800086132310110'.
           03                          PIC X(45)   VALUE
               '801086132310051802189644000164803050081620091'.
           03                          PIC X(45)   VALUE
               '804050081620046808086132310124809050081620073'.
           03                          PIC X(45)   VALUE
               '810050081620053811086132310079812086132310055'.
           03                          PIC X(45)   VALUE
               '813112872850081814067982050103815067982050063'.
           03                          PIC X(45)   VALUE
               '816050081620045820112872850238821112872850105'.
           03                          PIC X(45)   VALUE
               '822112872850039823112872850228824112872850125'.
           03                          PIC X(45)   VALUE
               '825112872850062826189644000224827112872850104'.
           03                          PIC X(45)   VALUE
               '828112872850054829112872850174830112872850061'.
           03                          PIC X(45)   VALUE
               '834086132310193835050081620124836050081620067'.
           03                          PIC X(45)   VALUE
               '837050081620135838050081620135839050081620073'.
           03                          PIC X(45)   VALUE
               '840086132310173841067982050099842050081620061'.
           03                          PIC X(45)   VALUE
               '843086132310122844067982050083845050081620059'.
           03                          PIC X(45)   VALUE
               '846189644000125847050081620059848050081620051'.
           03                          PIC X(45)   VALUE
               '849189644000098853184203720220854086132310120'.
           03                          PIC X(45)   VALUE
               '855086132310071856154133380206857107552980108'.
           03                          PIC X(45)   VALUE
               '858107552980075862106772540109863071062200069'.
           03                          PIC X(45)   VALUE
               '864112872850053865080092050082866080092050051'.
           03                          PIC X(45)   VALUE
               '867116502450147868067982050072869067982050047'.
           03                          PIC X(45)   VALUE
               '870202673060216871090092280104872063892010069'.
           03                          PIC X(45)   VALUE
               '876078812290191880049591770047881062142030070'.
           03                          PIC X(45)   VALUE
               '882062142030071883062142030119884051522450090'.
           03                          PIC X(45)   VALUE
               '885049012310118886049591770092887049591770068'.
           03                          PIC X(45)   VALUE
               '894049591770045895046702540200896078812290105'.
           03                          PIC X(45)   VALUE
               '897062142030062901140503420218902112872850113'.
           03                          PIC X(45)   VALUE
               '903067982050063904167673950168905067982050068'.
           03                          PIC X(45)   VALUE
               '906189644000070907163003360167908112872850091'.
           03                          PIC X(45)   VALUE
               '909086132310050913086132310075914086132310048'.
           03                          PIC X(45)   VALUE
               '915067982050081916067982050033917067982050077'.
           03                          PIC X(45)   VALUE
               '918067982050045919119162780098920081442300063'.
           03                          PIC X(45)   VALUE
               '921067982050042922067982050087923067982050053'.
           03                          PIC X(45)   VALUE
               '927189644000333928189644000244929189644000130'.
           03                          PIC X(45)   VALUE
               '933189644000079934067982050101935112872850085'.
           03                          PIC X(45)   VALUE
               '939138593120165940099152790088941086132310044'.
           03                          PIC X(45)   VALUE
               '945084992050160946052151620164947086132310115'.
           03                          PIC X(45)   VALUE
               '948050081620052949073912210065950039801440041'.
           03                          PIC X(45)   VALUE
               '951169682650067955112872850192956091452420117'.
           03                          PIC X(45)   VALUE
               '957189644000241958112872850131959112872850078'.
           03                          PIC X(45)   VALUE
               '963112872850132964112872850080965112872850055'.
           03                          PIC X(45)   VALUE
               '969189644000252970086132310126974103412270151'.
           03                          PIC X(45)   VALUE
               '975086132310090976086132310062977086132310079'.
           03                          PIC X(45)   VALUE
               '981232644090206982131003260114983086132310057'.
           03                          PIC X(45)   VALUE
               '984189644000198985067982050106986067982050047'.
           03                          PIC X(45)   VALUE
               '987186753680181988139313220101989139313220047'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 747 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
               05  WWM-IPTHRESH        PIC 9(3)V9(1).
