       01  W-DRG-FILLS.
           03                          PIC X(44)   VALUE
               '00345834652004310404530091660837701116608377'.
           03                          PIC X(44)   VALUE
               '01211636241013116362410201660837702106392216'.
           03                          PIC X(44)   VALUE
               '02206392216023075522400240755224002516608377'.
           03                          PIC X(44)   VALUE
               '02604766192027047661920281093326602907552240'.
           03                          PIC X(44)   VALUE
               '03007552240031166083770320639221603306392216'.
           03                          PIC X(44)   VALUE
               '03416608377035166083770361660837703716608377'.
           03                          PIC X(44)   VALUE
               '03816608377039166083770401418735404109739304'.
           03                          PIC X(44)   VALUE
               '04206392216052103093390530476619205409120230'.
           03                          PIC X(44)   VALUE
               '05507390230056078712580570584524005807552240'.
           03                          PIC X(44)   VALUE
               '05905813215060047661920610843925406206614241'.
           03                          PIC X(44)   VALUE
               '06304766192064088392460650554923606604766192'.
           03                          PIC X(44)   VALUE
               '06706392216068047661920690476619207008439254'.
           03                          PIC X(44)   VALUE
               '07106614241072047661920730962626807405916238'.
           03                          PIC X(44)   VALUE
               '07507552240076075522400771093326607804766192'.
           03                          PIC X(44)   VALUE
               '07904536189080063922160810476619208210933266'.
           03                          PIC X(44)   VALUE
               '08307552240084075522400850857024608606217238'.
           03                          PIC X(44)   VALUE
               '08706217238088063922160890476619209004766192'.
           03                          PIC X(44)   VALUE
               '09108424238092064002280930476619209410229277'.
           03                          PIC X(44)   VALUE
               '09508058271096063922160970894522109807561216'.
           03                          PIC X(44)   VALUE
               '09907561216100094502591010629723810206392216'.
           03                          PIC X(44)   VALUE
               '10304766192113116362411140975625511504766192'.
           03                          PIC X(44)   VALUE
               '11606392216117063922161210755224012206392216'.
           03                          PIC X(44)   VALUE
               '12306392216124075522401250639221612911636241'.
           03                          PIC X(44)   VALUE
               '13009756255131109332661321093326613310933266'.
           03                          PIC X(44)   VALUE
               '13410933266135166083771361093326613710933266'.
           03                          PIC X(44)   VALUE
               '13810933266139047661921461163624114709756255'.
           03                          PIC X(44)   VALUE
               '14809756255149047661921500729821315106312205'.
           03                          PIC X(44)   VALUE
               '15207298213153063122051540919723915506209206'.
           03                          PIC X(44)   VALUE
               '15606209206157109332661580755224015906392216'.
           03                          PIC X(44)   VALUE
               '16324859407164166083771651075929516624805425'.
           03                          PIC X(44)   VALUE
               '16719175386168109332661750786823517605673204'.
           03                          PIC X(44)   VALUE
               '17708920234178072532171790576618718007830198'.
           03                          PIC X(44)   VALUE
               '18106242190182062421901830639221618404766192'.
           03                          PIC X(44)   VALUE
               '18504766192186079252181870661821618806392240'.
           03                          PIC X(44)   VALUE
               '18909707239190072282041910608618919204782163'.
           03                          PIC X(44)   VALUE
               '19307654212194059771951950503816919607417217'.
           03                          PIC X(44)   VALUE
               '19705648177198047661921990782920720006045185'.
           03                          PIC X(44)   VALUE
               '20104766192202064672062030476619220408262229'.
           03                          PIC X(44)   VALUE
               '20508527225206066272082072028833820811475229'.
           03                          PIC X(44)   VALUE
               '21510759295216109332662171075929521810759295'.
           03                          PIC X(44)   VALUE
               '21910933266220107592952211075929522216608377'.
           03                          PIC X(44)   VALUE
               '22310933266224166083772251093326622616608377'.
           03                          PIC X(44)   VALUE
               '22716608377228146773162291075929523010759295'.
           03                          PIC X(44)   VALUE
               '23110933266232107592952331093326623410759295'.
           03                          PIC X(44)   VALUE
               '23510933266236107592952371093326623810759295'.
           03                          PIC X(44)   VALUE
               '23915489391240110373432410755224024216608377'.
           03                          PIC X(44)   VALUE
               '24310933266244109332662451660837724614677316'.
           03                          PIC X(44)   VALUE
               '24710759295248146773162491075929525016608377'.
           03                          PIC X(44)   VALUE
               '25116608377252146773162531075929525410759295'.
           03                          PIC X(44)   VALUE
               '25512906343256090072812570639221625806392216'.
           03                          PIC X(44)   VALUE
               '25906392216260166083772610639221626206392216'.
           03                          PIC X(44)   VALUE
               '26304497192264104183092650639221628007487223'.
           03                          PIC X(44)   VALUE
               '28105579197282055791972830957519628406392216'.
           03                          PIC X(44)   VALUE
               '28506392216286109332662871093326628809920262'.
           03                          PIC X(44)   VALUE
               '28908048268290075522402910739021529205980201'.
           03                          PIC X(44)   VALUE
               '29305294188294063922162950639221629609575196'.
           03                          PIC X(44)   VALUE
               '29706392216298063922162990787423630005919223'.
           03                          PIC X(44)   VALUE
               '30104497192302071042283030433017330410933266'.
           03                          PIC X(44)   VALUE
               '30504536189306079822173070750025630807349228'.
           03                          PIC X(44)   VALUE
               '30905777206310047661923110639221631204661191'.
           03                          PIC X(44)   VALUE
               '31304766192314089182353150618021331605117185'.
           03                          PIC X(44)   VALUE
               '32616608377327075522403280755224032922203396'.
           03                          PIC X(44)   VALUE
               '33016608377331075522403321699937133312902335'.
           03                          PIC X(44)   VALUE
               '33412902335335166083773361660837733716608377'.
           03                          PIC X(44)   VALUE
               '33810933266339070812253400543419134109458245'.
           03                          PIC X(44)   VALUE
               '34207081225343054341913441093326634510933266'.
           03                          PIC X(44)   VALUE
               '34610933266347109332663480755224034907552240'.
           03                          PIC X(44)   VALUE
               '35004766192351047661923520476619235310933266'.
           03                          PIC X(44)   VALUE
               '35410933266355109332663561699937135712902335'.
           03                          PIC X(44)   VALUE
               '35812902335368098902633690989026337004766192'.
           03                          PIC X(44)   VALUE
               '37109458245372070812253730543419137410220250'.
           03                          PIC X(44)   VALUE
               '37506836219376047661923770971324337805877201'.
           03                          PIC X(44)   VALUE
               '37905877201380109332663810755224038207552240'.
           03                          PIC X(44)   VALUE
               '38307552240384063922163851258326838606392216'.
           03                          PIC X(44)   VALUE
               '38704766192388101072393890720121139006392216'.
           03                          PIC X(44)   VALUE
               '39108782234392062732113931094027139407549230'.
           03                          PIC X(44)   VALUE
               '39506000198405166083774061660837740716608377'.
           03                          PIC X(44)   VALUE
               '40807552240409075522404100755224041106392216'.
           03                          PIC X(44)   VALUE
               '41206392216413063922164141660837741506392216'.
           03                          PIC X(44)   VALUE
               '41606392216417166083774180639221641906392216'.
           03                          PIC X(44)   VALUE
               '42016608377421075522404220755224042310933266'.
           03                          PIC X(44)   VALUE
               '42407552240425075522404320688319943306392216'.
           03                          PIC X(44)   VALUE
               '43406392216435076432124360639221643704766192'.
           03                          PIC X(44)   VALUE
               '43810684245439082372074400476619244108154220'.
           03                          PIC X(44)   VALUE
               '44206446221443047661924440834622644505926210'.
           03                          PIC X(44)   VALUE
               '44604766192453166083774541660837745516608377'.
           03                          PIC X(44)   VALUE
               '45616608377457166083774581660837745916608377'.
           03                          PIC X(44)   VALUE
               '46016608377461166083774621660837746314511387'.
           03                          PIC X(44)   VALUE
               '46411279363465092863274661660837746716608377'.
           03                          PIC X(44)   VALUE
               '46816608377469166083774701660837747110933266'.
           03                          PIC X(44)   VALUE
               '47207552240473075522404741350635847510702324'.
           03                          PIC X(44)   VALUE
               '47607552240477135533544781304039147906392216'.
           03                          PIC X(44)   VALUE
               '48016608377481166083774821660837748316608377'.
           03                          PIC X(44)   VALUE
               '48416608377485166083774861660837748710933266'.
           03                          PIC X(44)   VALUE
               '48810933266489109332664901093326649110933266'.
           03                          PIC X(44)   VALUE
               '49216608377493075522404940755224049512956378'.
           03                          PIC X(44)   VALUE
               '49610692340497063922164981660837749907552240'.
           03                          PIC X(44)   VALUE
               '50013940368501102543285021025432850310933266'.
           03                          PIC X(44)   VALUE
               '50410376312505103763125061093326650716608377'.
           03                          PIC X(44)   VALUE
               '50816608377509103763125101093326651107552240'.
           03                          PIC X(44)   VALUE
               '51207552240513109332665141093326651511914301'.
           03                          PIC X(44)   VALUE
               '51610933266517063922165331660837753404766192'.
           03                          PIC X(44)   VALUE
               '53506392216536047661925371093326653810933266'.
           03                          PIC X(44)   VALUE
               '53910283300540080042875410696226754207953236'.
           03                          PIC X(44)   VALUE
               '54306149216544047661925450805321854605615212'.
           03                          PIC X(44)   VALUE
               '54704766192548085772695490735425655005233235'.
           03                          PIC X(44)   VALUE
               '55108996273552058942305530639221655404674200'.
           03                          PIC X(44)   VALUE
               '55507552240556047661925570876924555807061232'.
           03                          PIC X(44)   VALUE
               '55908153258560067802545610532722156207552240'.
           03                          PIC X(44)   VALUE
               '56307552240564089342465650683924156605185214'.
           03                          PIC X(44)   VALUE
               '57313740379574101333515750802328757612370323'.
           03                          PIC X(44)   VALUE
               '57709539317578047661925791328135958009368320'.
           03                          PIC X(44)   VALUE
               '58107552240582075522405830755224058407552240'.
           03                          PIC X(44)   VALUE
               '58507552240592092912675930687625559405712222'.
           03                          PIC X(44)   VALUE
               '59506821229596049651995970755224059806392216'.
           03                          PIC X(44)   VALUE
               '59906392216600063922166010476619260207077226'.
           03                          PIC X(44)   VALUE
               '60305157193604084352566050579821060611918270'.
           03                          PIC X(44)   VALUE
               '60705715216614104343206151043432061615849384'.
           03                          PIC X(44)   VALUE
               '61711006313618110063136191660837762007552240'.
           03                          PIC X(44)   VALUE
               '62107552240622125753376230996330962409963309'.
           03                          PIC X(44)   VALUE
               '62513071336626104343206271043432062813071336'.
           03                          PIC X(44)   VALUE
               '62910434320630104343206370878625963806952243'.
           03                          PIC X(44)   VALUE
               '63904056180640081532236410644321264210933266'.
           03                          PIC X(44)   VALUE
               '64307552240644063922166450476619265307552240'.
           03                          PIC X(44)   VALUE
               '65407552240655075522406560755224065707552240'.
           03                          PIC X(44)   VALUE
               '65807552240659166083776600755224066107552240'.
           03                          PIC X(44)   VALUE
               '66216608377663063922166640639221666507552240'.
           03                          PIC X(44)   VALUE
               '66607552240667047661926680755224066907552240'.
           03                          PIC X(44)   VALUE
               '67007552240671109332666721093326667313257321'.
           03                          PIC X(44)   VALUE
               '67409676290675063922166820903023468307180221'.
           03                          PIC X(44)   VALUE
               '68405141177685063922166860795323568707552240'.
           03                          PIC X(44)   VALUE
               '68807552240689067332266900529619969110933266'.
           03                          PIC X(44)   VALUE
               '69204766192693075522406940476619269507552240'.
           03                          PIC X(44)   VALUE
               '69604766192697063922166980876023469907211224'.
           03                          PIC X(44)   VALUE
               '70006392216707075522407080755224070916608377'.
           03                          PIC X(44)   VALUE
               '71016608377711109332667121093326671316608377'.
           03                          PIC X(44)   VALUE
               '71407552240715166083777161660837771716608377'.
           03                          PIC X(44)   VALUE
               '71816608377722063922167230639221672406392216'.
           03                          PIC X(44)   VALUE
               '72504766192726047661927270768924072804964209'.
           03                          PIC X(44)   VALUE
               '72908669240730047661927341660837773516608377'.
           03                          PIC X(44)   VALUE
               '73609345223737075522407380755224073913071336'.
           03                          PIC X(44)   VALUE
               '74007552240741075522407420755224074307552240'.
           03                          PIC X(44)   VALUE
               '74407552240745075522407460639221674706392216'.
           03                          PIC X(44)   VALUE
               '74807552240749075522407500755224075409345223'.
           03                          PIC X(44)   VALUE
               '75507552240756075522407570873724275807902213'.
           03                          PIC X(44)   VALUE
               '75906392216760075522407610755224076510434320'.
           03                          PIC X(44)   VALUE
               '76610434320767104343207681043432076910434320'.
           03                          PIC X(44)   VALUE
               '77010434320774104343207751043432077616608377'.
           03                          PIC X(44)   VALUE
               '77710434320778063922167790639221678006392216'.
           03                          PIC X(44)   VALUE
               '78107552240782075522407890755224079007552240'.
           03                          PIC X(44)   VALUE
               '79107552240792075522407930755224079407552240'.
           03                          PIC X(44)   VALUE
               '79507552240799109332668001093326680110933266'.
           03                          PIC X(44)   VALUE
               '80216608377803063922168040639221680806904197'.
           03                          PIC X(44)   VALUE
               '80906904197810055481978110825022181205548197'.
           03                          PIC X(44)   VALUE
               '81308179221814109332668150639221681604766192'.
           03                          PIC X(44)   VALUE
               '82016608377821075522408220755224082316608377'.
           03                          PIC X(44)   VALUE
               '82416608377825166083778261660837782716608377'.
           03                          PIC X(44)   VALUE
               '82816608377829109332668301093326683410933266'.
           03                          PIC X(44)   VALUE
               '83507552240836075522408370639221683806392216'.
           03                          PIC X(44)   VALUE
               '83906392216840097762388410888422184206392216'.
           03                          PIC X(44)   VALUE
               '84308219229844082192298450821922984615248304'.
           03                          PIC X(44)   VALUE
               '84711207251848112072518490800422485317562381'.
           03                          PIC X(44)   VALUE
               '85412120348855109332668561371835085710359310'.
           03                          PIC X(44)   VALUE
               '85807552240862094962538630677823286406392216'.
           03                          PIC X(44)   VALUE
               '86507641235866075522408671132523986806705218'.
           03                          PIC X(44)   VALUE
               '86904766192870213063228710865023587206409217'.
           03                          PIC X(44)   VALUE
               '87616608377880047661928810476619288206392216'.
           03                          PIC X(44)   VALUE
               '88304766192884053822808850404923088603976225'.
           03                          PIC X(44)   VALUE
               '88704766192894063922168950476619289607552240'.
           03                          PIC X(44)   VALUE
               '89704766192901131203419021185333290307552240'.
           03                          PIC X(44)   VALUE
               '90414057392905075522409060755224090716734379'.
           03                          PIC X(44)   VALUE
               '90811627334909109332669130820224391405688216'.
           03                          PIC X(44)   VALUE
               '91504766192916047661929171093326691804766192'.
           03                          PIC X(44)   VALUE
               '91911109268920078892519210606920292216608377'.
           03                          PIC X(44)   VALUE
               '92316608377927109332669281093326692908231266'.
           03                          PIC X(44)   VALUE
               '93307552240934082312669350921425393914017344'.
           03                          PIC X(44)   VALUE
               '94009985321941075522409450643921994604164187'.
           03                          PIC X(44)   VALUE
               '94707667230948049921999490683622295004421171'.
           03                          PIC X(44)   VALUE
               '95115107320955047661929561660837795716608377'.
           03                          PIC X(44)   VALUE
               '95810933266959109332669631093326696404766192'.
           03                          PIC X(44)   VALUE
               '96504766192969166083779701660837797410349226'.
           03                          PIC X(44)   VALUE
               '97507605202976047661929770576818898123236429'.
           03                          PIC X(44)   VALUE
               '98213447348983109332669841660837798516608377'.
           03                          PIC X(44)   VALUE
               '98606392216987173663769881087431798910874317'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 736 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
