       01  W-DRG-FILLS.
           03                          PIC X(44)   VALUE
               '00344724635004304674470111742036001207789234'.
           03                          PIC X(44)   VALUE
               '01304607179014054371970160543719701705437197'.
           03                          PIC X(44)   VALUE
               '02007904228021064222340220621120602307789234'.
           03                          PIC X(44)   VALUE
               '02407789234025122243030260786226402706211206'.
           03                          PIC X(44)   VALUE
               '02817420360029122243030300690420103117420360'.
           03                          PIC X(44)   VALUE
               '03207789234033069042010340778923403507789234'.
           03                          PIC X(44)   VALUE
               '03607789234037174203600381222430303906211206'.
           03                          PIC X(44)   VALUE
               '04014085351041096432980420564023305211657380'.
           03                          PIC X(44)   VALUE
               '05311657380054080972180550621120605607897251'.
           03                          PIC X(44)   VALUE
               '05705640233058077892340590621120606004607179'.
           03                          PIC X(44)   VALUE
               '06108072234062078622640630621120606407904228'.
           03                          PIC X(44)   VALUE
               '06506422234066062112060671222430306804607179'.
           03                          PIC X(44)   VALUE
               '06907789234070080722340710786226407206211206'.
           03                          PIC X(44)   VALUE
               '07308202221074069042010750778923407607789234'.
           03                          PIC X(44)   VALUE
               '07712224303078077892340790460717908012224303'.
           03                          PIC X(44)   VALUE
               '08104607179082122243030831222430308404607179'.
           03                          PIC X(44)   VALUE
               '08508572250086068622400870460717908808572250'.
           03                          PIC X(44)   VALUE
               '08906862240090046071790910917924109206800226'.
           03                          PIC X(44)   VALUE
               '09304607179094112362890950847724509606211206'.
           03                          PIC X(44)   VALUE
               '09707901223098077892340990460717910007891234'.
           03                          PIC X(44)   VALUE
               '10104607179102091792411030460717911307789234'.
           03                          PIC X(44)   VALUE
               '11407789234115077892341160778923411707789234'.
           03                          PIC X(44)   VALUE
               '12107789234122062112061230778923412407789234'.
           03                          PIC X(44)   VALUE
               '12507789234129141682831300460717913106211206'.
           03                          PIC X(44)   VALUE
               '13204607179133064001871340460717913506211206'.
           03                          PIC X(44)   VALUE
               '13604607179137076052461380760524613907605246'.
           03                          PIC X(44)   VALUE
               '14614168283147077892341480460717914904607179'.
           03                          PIC X(44)   VALUE
               '15006931219151069312191520693121915306931219'.
           03                          PIC X(44)   VALUE
               '15407209213155064001871560460717915708745239'.
           03                          PIC X(44)   VALUE
               '15807605246159076052461632211038516422110385'.
           03                          PIC X(44)   VALUE
               '16522110385166241914131671536533316815365333'.
           03                          PIC X(44)   VALUE
               '17507178210176056981841770877422817807173205'.
           03                          PIC X(44)   VALUE
               '17905406179180068391871810581017418204607179'.
           03                          PIC X(44)   VALUE
               '18306211206184062112061850460717918607889213'.
           03                          PIC X(44)   VALUE
               '18706289200188062112061890929522619007417200'.
           03                          PIC X(44)   VALUE
               '19106006180192048361571930763720519406173189'.
           03                          PIC X(44)   VALUE
               '19504965162196074282031970636718719804607179'.
           03                          PIC X(44)   VALUE
               '19907497215200054031712010460717920207032190'.
           03                          PIC X(44)   VALUE
               '20304607179204082432072050865522020606955198'.
           03                          PIC X(44)   VALUE
               '20720242331208109872222151093429421612224303'.
           03                          PIC X(44)   VALUE
               '21710934294218109342942191222430322012224303'.
           03                          PIC X(44)   VALUE
               '22110934294222122243032231222430322412224303'.
           03                          PIC X(44)   VALUE
               '22512224303226174203602271742036022815738339'.
           03                          PIC X(44)   VALUE
               '22910934294230109342942311222430323210934294'.
           03                          PIC X(44)   VALUE
               '23312224303234062112062351222430323612224303'.
           03                          PIC X(44)   VALUE
               '23712224303238122243032391551139424011549365'.
           03                          PIC X(44)   VALUE
               '24106211206242122243032431222430324412224303'.
           03                          PIC X(44)   VALUE
               '24517420360246174203602471093429424804607179'.
           03                          PIC X(44)   VALUE
               '24904607179250122243032511222430325215738339'.
           03                          PIC X(44)   VALUE
               '25310934294254109342942551241634425608920275'.
           03                          PIC X(44)   VALUE
               '25707789234258174203602591742036026012224303'.
           03                          PIC X(44)   VALUE
               '26112224303262122243032630522218326410469301'.
           03                          PIC X(44)   VALUE
               '26512224303280079092232810582620328204607179'.
           03                          PIC X(44)   VALUE
               '28310609193284062112062850621120628617420360'.
           03                          PIC X(44)   VALUE
               '28706211206288101212562890819824929006899212'.
           03                          PIC X(44)   VALUE
               '29107904212292060101972930524018229406211206'.
           03                          PIC X(44)   VALUE
               '29505222183296079042122970601019729805240182'.
           03                          PIC X(44)   VALUE
               '29907889229300061172153010522218330207524192'.
           03                          PIC X(44)   VALUE
               '30306211206304077892343050460717930608330239'.
           03                          PIC X(44)   VALUE
               '30705674185308074432213090553919231005539192'.
           03                          PIC X(44)   VALUE
               '31112224303312077892343130553919231409235235'.
           03                          PIC X(44)   VALUE
               '31506723214316056782003261742036032706211206'.
           03                          PIC X(44)   VALUE
               '32806211206329184433433301222430333107789234'.
           03                          PIC X(44)   VALUE
               '33217420360333077892343340778923433517420360'.
           03                          PIC X(44)   VALUE
               '33617420360337077892343381742036033907243219'.
           03                          PIC X(44)   VALUE
               '34004607179341093892443420724321934304607179'.
           03                          PIC X(44)   VALUE
               '34417420360345072432193460460717934717420360'.
           03                          PIC X(44)   VALUE
               '34807789234349077892343500460717935104607179'.
           03                          PIC X(44)   VALUE
               '35204607179353174203603540724321935504607179'.
           03                          PIC X(44)   VALUE
               '35615541356357116302973580778923436810317239'.
           03                          PIC X(44)   VALUE
               '36906211206370046071793710938924437207243219'.
           03                          PIC X(44)   VALUE
               '37304607179374081442123750706821337604607179'.
           03                          PIC X(44)   VALUE
               '37708825242378051141863790460717938010256250'.
           03                          PIC X(44)   VALUE
               '38106211206382046071793831222430338406211206'.
           03                          PIC X(44)   VALUE
               '38510977243386077892343870460717938809894237'.
           03                          PIC X(44)   VALUE
               '38906335195390046071793910871523439206409204'.
           03                          PIC X(44)   VALUE
               '39311167267394071612243950460717940517420360'.
           03                          PIC X(44)   VALUE
               '40612224303407122243034081742036040912224303'.
           03                          PIC X(44)   VALUE
               '41012224303411122243034121222430341312224303'.
           03                          PIC X(44)   VALUE
               '41417420360415122243034161222430341712224303'.
           03                          PIC X(44)   VALUE
               '41812224303419122243034201222430342112224303'.
           03                          PIC X(44)   VALUE
               '42212224303423122243034241222430342512224303'.
           03                          PIC X(44)   VALUE
               '43206730216433046071794340460717943508144202'.
           03                          PIC X(44)   VALUE
               '43606211206437046071794381117625143906822200'.
           03                          PIC X(44)   VALUE
               '44004607179441079992194420661520844306211206'.
           03                          PIC X(44)   VALUE
               '44409038241445069782004460460717945317420360'.
           03                          PIC X(44)   VALUE
               '45417420360455174203604561742036045717420360'.
           03                          PIC X(44)   VALUE
               '45817420360459174203604601742036046117420360'.
           03                          PIC X(44)   VALUE
               '46217420360463140613944641112633046507789234'.
           03                          PIC X(44)   VALUE
               '46617420360467174203604681742036046917420360'.
           03                          PIC X(44)   VALUE
               '47017420360471122243034720778923447307789234'.
           03                          PIC X(44)   VALUE
               '47413209352475120833484760778923447716272402'.
           03                          PIC X(44)   VALUE
               '47812224303479077892344801742036048117420360'.
           03                          PIC X(44)   VALUE
               '48217420360483122243034841222430348517420360'.
           03                          PIC X(44)   VALUE
               '48612224303487062112064880621120648906211206'.
           03                          PIC X(44)   VALUE
               '49017420360491174203604921742036049312224303'.
           03                          PIC X(44)   VALUE
               '49412224303495130913684961138233849706211206'.
           03                          PIC X(44)   VALUE
               '49812224303499062112065001273235850109510311'.
           03                          PIC X(44)   VALUE
               '50207789234503112303295040778923450506211206'.
           03                          PIC X(44)   VALUE
               '50604607179507122243035080460717950906211206'.
           03                          PIC X(44)   VALUE
               '51012224303511046071795120460717951312224303'.
           03                          PIC X(44)   VALUE
               '51404607179515138523275161222430351704607179'.
           03                          PIC X(44)   VALUE
               '53306211206534046071795350778923453604607179'.
           03                          PIC X(44)   VALUE
               '53712224303538122243035391019629954008208277'.
           03                          PIC X(44)   VALUE
               '54107443263542085882095430572420654405724206'.
           03                          PIC X(44)   VALUE
               '54508023224546080232245470460717954809091273'.
           03                          PIC X(44)   VALUE
               '54907664253550069122525510983526455206654229'.
           03                          PIC X(44)   VALUE
               '55306211206554046071795550778923455604607179'.
           03                          PIC X(44)   VALUE
               '55708413246558063492195590895726656007415254'.
           03                          PIC X(44)   VALUE
               '56105571225562062112065630621120656408819246'.
           03                          PIC X(44)   VALUE
               '56507236240566062112065701216834457109451314'.
           03                          PIC X(44)   VALUE
               '57206730251573151634175741095035057510950350'.
           03                          PIC X(44)   VALUE
               '57617420360577122243035780621120657912437345'.
           03                          PIC X(44)   VALUE
               '58008455289581062112065820778923458307789234'.
           03                          PIC X(44)   VALUE
               '58407789234585059132105920851025959306698234'.
           03                          PIC X(44)   VALUE
               '59404972193595068952295960614323559707789234'.
           03                          PIC X(44)   VALUE
               '59807789234599061432356000778923460105409190'.
           03                          PIC X(44)   VALUE
               '60207474218603054091906040889223760507767237'.
           03                          PIC X(44)   VALUE
               '60609605241607059132106141060929761510609297'.
           03                          PIC X(44)   VALUE
               '61614496384617104263086180778923461917420360'.
           03                          PIC X(44)   VALUE
               '62006211206621062112066221319634762310062304'.
           03                          PIC X(44)   VALUE
               '62406211206625106092976261060929762710609297'.
           03                          PIC X(44)   VALUE
               '62814640342629106092976301060929763708944262'.
           03                          PIC X(44)   VALUE
               '63807283240639046071796400888122864106239204'.
           03                          PIC X(44)   VALUE
               '64204607179643095392376440621120664504607179'.
           03                          PIC X(44)   VALUE
               '65212224303653122243036541222430365512224303'.
           03                          PIC X(44)   VALUE
               '65612224303657122243036581222430365912224303'.
           03                          PIC X(44)   VALUE
               '66012224303661122243036621222430366306211206'.
           03                          PIC X(44)   VALUE
               '66406211206665122243036661222430366712224303'.
           03                          PIC X(44)   VALUE
               '66807789234669077892346700778923467117420360'.
           03                          PIC X(44)   VALUE
               '67207789234673129703166741103327767511033277'.
           03                          PIC X(44)   VALUE
               '68208849229683071042156840509518468507789234'.
           03                          PIC X(44)   VALUE
               '68607789234687077892346880778923468906730216'.
           03                          PIC X(44)   VALUE
               '69005275191691077892346920460717969312224303'.
           03                          PIC X(44)   VALUE
               '69404607179695174203606960460717969704607179'.
           03                          PIC X(44)   VALUE
               '69808586232699065172117000460717970704607179'.
           03                          PIC X(44)   VALUE
               '70804607179709062112067100621120671107789234'.
           03                          PIC X(44)   VALUE
               '71207789234713174203607140778923471507789234'.
           03                          PIC X(44)   VALUE
               '71607789234717174203607180778923472206211206'.
           03                          PIC X(44)   VALUE
               '72306211206724062112067250460717972604607179'.
           03                          PIC X(44)   VALUE
               '72707370213728059122117290821723273004607179'.
           03                          PIC X(44)   VALUE
               '73407789234735077892347360778923473706211206'.
           03                          PIC X(44)   VALUE
               '73806211206739146403427401060929774110609297'.
           03                          PIC X(44)   VALUE
               '74210609297743106092977440778923474507789234'.
           03                          PIC X(44)   VALUE
               '74606211206747062112067480778923474907789234'.
           03                          PIC X(44)   VALUE
               '75007789234754094162497550621120675606211206'.
           03                          PIC X(44)   VALUE
               '75707811227758067912177590460717976004607179'.
           03                          PIC X(44)   VALUE
               '76104607179765077892347660778923476707789234'.
           03                          PIC X(44)   VALUE
               '76807789234769077892347700778923477407789234'.
           03                          PIC X(44)   VALUE
               '77507789234776077892347770778923477807789234'.
           03                          PIC X(44)   VALUE
               '77907789234780077892347810460717978204607179'.
           03                          PIC X(44)   VALUE
               '78904607179790046071797910460717979204607179'.
           03                          PIC X(44)   VALUE
               '79304607179794046071797950460717979917420360'.
           03                          PIC X(44)   VALUE
               '80012224303801122243038021222430380312224303'.
           03                          PIC X(44)   VALUE
               '80412224303808087262188090778923481007789234'.
           03                          PIC X(44)   VALUE
               '81107753208812054371978130728519981408433240'.
           03                          PIC X(44)   VALUE
               '81506211206816062112068201222430382112224303'.
           03                          PIC X(44)   VALUE
               '82212224303823174203608241222430382512224303'.
           03                          PIC X(44)   VALUE
               '82617420360827174203608281742036082917420360'.
           03                          PIC X(44)   VALUE
               '83004607179834103302428350778923483606211206'.
           03                          PIC X(44)   VALUE
               '83714285297838128372968391283729684008705214'.
           03                          PIC X(44)   VALUE
               '84107178216842062112068430778923484406211206'.
           03                          PIC X(44)   VALUE
               '84506211206846142852978471283729684812837296'.
           03                          PIC X(44)   VALUE
               '84907596195853175773818541089128985510891289'.
           03                          PIC X(44)   VALUE
               '85614676354857103233088580778923486209954253'.
           03                          PIC X(44)   VALUE
               '86307062229864062112068650836921186607789234'.
           03                          PIC X(44)   VALUE
               '86710421236868074132148690621120687021706316'.
           03                          PIC X(44)   VALUE
               '87108618230872062042038760460717988004607179'.
           03                          PIC X(44)   VALUE
               '88104607179882077892348830778923488404703232'.
           03                          PIC X(44)   VALUE
               '88504152233886046071798870460717989404607179'.
           03                          PIC X(44)   VALUE
               '89506211206896048562418970461226790114312346'.
           03                          PIC X(44)   VALUE
               '90210739315903077892349041378437790507789234'.
           03                          PIC X(44)   VALUE
               '90617420360907159683769081047729990907789234'.
           03                          PIC X(44)   VALUE
               '91308541247914061412179150522419291605224192'.
           03                          PIC X(44)   VALUE
               '91707789234918062112069191145027292007945236'.
           03                          PIC X(44)   VALUE
               '92105224192922122243039230778923492712224303'.
           03                          PIC X(44)   VALUE
               '92812224303929122243039330778923493407246234'.
           03                          PIC X(44)   VALUE
               '93506498244939136443299400991529594106211206'.
           03                          PIC X(44)   VALUE
               '94506485206946044371889470748220794804607179'.
           03                          PIC X(44)   VALUE
               '94907171217950041361679511473431995512224303'.
           03                          PIC X(44)   VALUE
               '95617420360957174203609581742036095912224303'.
           03                          PIC X(44)   VALUE
               '96312224303964122243039651222430396917420360'.
           03                          PIC X(44)   VALUE
               '97010028218974100282189750649018297604607179'.
           03                          PIC X(44)   VALUE
               '97707368202981213204059821339232698306211206'.
           03                          PIC X(44)   VALUE
               '98417420360985122243039861222430398717474363'.
           03                          PIC X(22)   VALUE
               '9881097531398906211206'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 742 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
