       01  W-DRG-FILLS.
           03                          PIC X(44)   VALUE
               '00117034385002170343850031703438500604499190'.
           03                          PIC X(44)   VALUE
               '00713984377008076372480090972033701007554245'.
           03                          PIC X(44)   VALUE
               '01105837213012068512550130653123101407783260'.
           03                          PIC X(44)   VALUE
               '01507314268016074712350170449919001807197236'.
           03                          PIC X(44)   VALUE
               '01904773212020102772720210763724802211820296'.
           03                          PIC X(44)   VALUE
               '02308054254024062512260250449919002604499190'.
           03                          PIC X(44)   VALUE
               '02709444271028088903020290583721303005837213'.
           03                          PIC X(44)   VALUE
               '03107637248032044991900330449919003408004253'.
           03                          PIC X(44)   VALUE
               '03505698242036118202960371182029603811820296'.
           03                          PIC X(44)   VALUE
               '03911820296040118202960411182029604211820296'.
           03                          PIC X(44)   VALUE
               '04311820296044058372130451182029604605837213'.
           03                          PIC X(44)   VALUE
               '04711820296048118202960491182029605011820296'.
           03                          PIC X(44)   VALUE
               '05111820296052118202960531182029605411820296'.
           03                          PIC X(44)   VALUE
               '05511820296056118202960570449919005804499190'.
           03                          PIC X(44)   VALUE
               '05904499190060044991900610763724806204499190'.
           03                          PIC X(44)   VALUE
               '06311820296064114802620650449919006604499190'.
           03                          PIC X(44)   VALUE
               '06707637248068051111800690449919007004499190'.
           03                          PIC X(44)   VALUE
               '07105837213072076372480730753521907404499190'.
           03                          PIC X(44)   VALUE
               '07517034385076255234390771703438507806900219'.
           03                          PIC X(44)   VALUE
               '07908280229080059862170810449919008207174201'.
           03                          PIC X(44)   VALUE
               '08305837213084058372130850726421208604499190'.
           03                          PIC X(44)   VALUE
               '08710816254088065851960890698720809004970178'.
           03                          PIC X(44)   VALUE
               '09104499190092067042020930583721309405880170'.
           03                          PIC X(44)   VALUE
               '09504499190096064171940970583721309805837213'.
           03                          PIC X(44)   VALUE
               '09909219232100076372481010814721110204499190'.
           03                          PIC X(44)   VALUE
               '10407637248105076372481060763724810807637248'.
           03                          PIC X(44)   VALUE
               '11007637248111076372481131488739311412389332'.
           03                          PIC X(44)   VALUE
               '11711820296118118202961190763724812010979317'.
           03                          PIC X(44)   VALUE
               '12108429232122058372131231181120412411820296'.
           03                          PIC X(44)   VALUE
               '12507637248126083862531270685721212805837213'.
           03                          PIC X(44)   VALUE
               '12907637248130067412321310467520413206565218'.
           03                          PIC X(44)   VALUE
               '13304499190134063542481350721123713605837213'.
           03                          PIC X(44)   VALUE
               '13705837213138062012051390583721314004499190'.
           03                          PIC X(44)   VALUE
               '14104271183142042711831430449919014407413217'.
           03                          PIC X(44)   VALUE
               '14504568182146170343851471703438514818616409'.
           03                          PIC X(44)   VALUE
               '14907637248150118202961510583721315207637248'.
           03                          PIC X(44)   VALUE
               '15307637248154170343851551703438515617034385'.
           03                          PIC X(44)   VALUE
               '15711820296158118202961590763724816007637248'.
           03                          PIC X(44)   VALUE
               '16117034385162076372481630763724816417034385'.
           03                          PIC X(44)   VALUE
               '16517034385166170343851671703438516811820296'.
           03                          PIC X(44)   VALUE
               '16907637248170162713591710449919017208553218'.
           03                          PIC X(44)   VALUE
               '17305837213174071192221750449919017608426215'.
           03                          PIC X(44)   VALUE
               '17707637248178076372481790967524018009375235'.
           03                          PIC X(44)   VALUE
               '18107637248182077452261830387016818404499190'.
           03                          PIC X(44)   VALUE
               '18507637248186076372481870763724818809952240'.
           03                          PIC X(44)   VALUE
               '18904707182190044991901911182029619211820296'.
           03                          PIC X(44)   VALUE
               '19307637248194076372481950763724819607637248'.
           03                          PIC X(44)   VALUE
               '19707637248198076372481991703438520017034385'.
           03                          PIC X(44)   VALUE
               '20120371361202066102062030789619520409441227'.
           03                          PIC X(44)   VALUE
               '20506642205206058372132070757021520805837213'.
           03                          PIC X(44)   VALUE
               '21017034385211118202962121703438521311948340'.
           03                          PIC X(44)   VALUE
               '21611820296217129273802181703438521904499190'.
           03                          PIC X(44)   VALUE
               '22017034385223076372482240763724822509869284'.
           03                          PIC X(44)   VALUE
               '22609443295227076372482281182029622904499190'.
           03                          PIC X(44)   VALUE
               '23017034385232044991902331352234623404499190'.
           03                          PIC X(44)   VALUE
               '23507637248236065312522370449919023808278283'.
           03                          PIC X(44)   VALUE
               '23906935236240073102482410449919024207864265'.
           03                          PIC X(44)   VALUE
               '24306061234244052592222450463520424604499190'.
           03                          PIC X(44)   VALUE
               '24705548219248065742262490657724725005837213'.
           03                          PIC X(44)   VALUE
               '25104499190252076372482530680226325405837213'.
           03                          PIC X(44)   VALUE
               '25507637248256079242532570763724825807637248'.
           03                          PIC X(44)   VALUE
               '25905837213260076372482610763724826204499190'.
           03                          PIC X(44)   VALUE
               '26313222395264095843202651039833126607637248'.
           03                          PIC X(44)   VALUE
               '26707637248268170343852691303736127007637248'.
           03                          PIC X(44)   VALUE
               '27108720277272074202262730449919027407637248'.
           03                          PIC X(44)   VALUE
               '27507637248276058372132770626421027804420178'.
           03                          PIC X(44)   VALUE
               '27904499190280066982432810449919028204499190'.
           03                          PIC X(44)   VALUE
               '28306935239284044991902851350135628617034385'.
           03                          PIC X(44)   VALUE
               '28711387339288118202962891182029629017034385'.
           03                          PIC X(44)   VALUE
               '29111820296292134093172930583721329407293250'.
           03                          PIC X(44)   VALUE
               '29507637248296072122312970522718429805837213'.
           03                          PIC X(44)   VALUE
               '29911820296300063762123010449919030311820296'.
           03                          PIC X(44)   VALUE
               '30417034385305044991903060583721330705837213'.
           03                          PIC X(44)   VALUE
               '30807637248309076372483101182029631111820296'.
           03                          PIC X(44)   VALUE
               '31204499190313044991903140449919031514055316'.
           03                          PIC X(44)   VALUE
               '31608219227317098522523180758620231904499190'.
           03                          PIC X(44)   VALUE
               '32006179222321047921903220449919032311820296'.
           03                          PIC X(44)   VALUE
               '32404499190325058372133260449919032704499190'.
           03                          PIC X(44)   VALUE
               '32804499190329044991903300449919033108010231'.
           03                          PIC X(44)   VALUE
               '33205837213333058372133340583721333517034385'.
           03                          PIC X(44)   VALUE
               '33605837213337058372133380583721333911820296'.
           03                          PIC X(44)   VALUE
               '34011820296341118202963421182029634311820296'.
           03                          PIC X(44)   VALUE
               '34404499190345170343853460606020634705837213'.
           03                          PIC X(44)   VALUE
               '34805837213349118202963500679821935111820296'.
           03                          PIC X(44)   VALUE
               '35206375234353118202963541182029635511820296'.
           03                          PIC X(44)   VALUE
               '35611820296357118202963581182029635911820296'.
           03                          PIC X(44)   VALUE
               '36011820296361076372483620763724836307637248'.
           03                          PIC X(44)   VALUE
               '36417034385365170343853660707220336707637248'.
           03                          PIC X(44)   VALUE
               '36806416207369076372483700763724837105837213'.
           03                          PIC X(44)   VALUE
               '37207637248373076372483740763724837507637248'.
           03                          PIC X(44)   VALUE
               '37607637248377076372483780763724837907637248'.
           03                          PIC X(44)   VALUE
               '38007637248381076372483820763724838307637248'.
           03                          PIC X(44)   VALUE
               '38407637248385076372483861182029638711820296'.
           03                          PIC X(44)   VALUE
               '38807637248389118202963901182029639107637248'.
           03                          PIC X(44)   VALUE
               '39207637248393076372483941703438539506581220'.
           03                          PIC X(44)   VALUE
               '39605837213397086752293980824023739905837213'.
           03                          PIC X(44)   VALUE
               '40117034385402058372134030875721340405837213'.
           03                          PIC X(44)   VALUE
               '40505837213406118202964071182029640811820296'.
           03                          PIC X(44)   VALUE
               '40908642235410116842644110763724841207637248'.
           03                          PIC X(44)   VALUE
               '41308920205414058372134151425135641608241235'.
           03                          PIC X(44)   VALUE
               '41707637248418082522474191182029642011820296'.
           03                          PIC X(44)   VALUE
               '42109441273422118202964230950521842407637248'.
           03                          PIC X(44)   VALUE
               '42505837213426041132074270465323842804499190'.
           03                          PIC X(44)   VALUE
               '42905813268430043302424310449919043205837213'.
           03                          PIC X(44)   VALUE
               '43305837213439136773564401344236144104499190'.
           03                          PIC X(44)   VALUE
               '44213937334443076372484440758426344504499190'.
           03                          PIC X(44)   VALUE
               '44604499190447058372134480583721344907637248'.
           03                          PIC X(44)   VALUE
               '45007637248451076372484520926525345305871238'.
           03                          PIC X(44)   VALUE
               '45407637248455076372484611224534046205787224'.
           03                          PIC X(44)   VALUE
               '46306258238464055542414650695821946606667219'.
           03                          PIC X(44)   VALUE
               '46707637248468214784024711703438547308537200'.
           03                          PIC X(44)   VALUE
               '47520831346476118202964771583635347907637248'.
           03                          PIC X(44)   VALUE
               '48117034385482170343854840583721348511820296'.
           03                          PIC X(44)   VALUE
               '48617034385487089922604881703438548908535214'.
           03                          PIC X(44)   VALUE
               '49004919166491170343854921182029649317034385'.
           03                          PIC X(44)   VALUE
               '49417034385496118202964971182029649811820296'.
           03                          PIC X(44)   VALUE
               '49917034385500118202965011703438550211820296'.
           03                          PIC X(44)   VALUE
               '50305837213504170343855051182029650611820296'.
           03                          PIC X(44)   VALUE
               '50707637248508083672945090449919051007709246'.
           03                          PIC X(44)   VALUE
               '51104499190515170343855180763724851917034385'.
           03                          PIC X(44)   VALUE
               '52011820296521044571945220449919052304499190'.
           03                          PIC X(44)   VALUE
               '52405043211525170343855281703438552917034385'.
           03                          PIC X(44)   VALUE
               '53017034385531076372485320763724853317034385'.
           03                          PIC X(44)   VALUE
               '53411820296535170343855361703438553711615347'.
           03                          PIC X(44)   VALUE
               '53811820296539118202965400583721354142287656'.
           03                          PIC X(44)   VALUE
               '54231869482543170343855441703438554517034385'.
           03                          PIC X(44)   VALUE
               '54617034385547170343855481703438554917034385'.
           03                          PIC X(44)   VALUE
               '55017034385551118202965521182029655313255306'.
           03                          PIC X(44)   VALUE
               '55413255306555118202965561182029655711820296'.
           03                          PIC X(22)   VALUE
               '5581182029655907637248'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 518 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
