       01  W-DRG-FILLS.
           03                          PIC X(45)   VALUE
               '003385205890491004277654240353011102522400200'.
           03                          PIC X(45)   VALUE
               '012067111980145013067111980099014067111980165'.
           03                          PIC X(45)   VALUE
               '016067111980165017067111980165020084292350196'.
           03                          PIC X(45)   VALUE
               '021067111980165022052681750141023112742640189'.
           03                          PIC X(45)   VALUE
               '024112742640099025167693480150026167693480098'.
           03                          PIC X(45)   VALUE
               '027167693480049028167693480189029083932250101'.
           03                          PIC X(45)   VALUE
               '030067111980052031167693480172032067111980075'.
           03                          PIC X(45)   VALUE
               '033067111980037034197074140124035197074140050'.
           03                          PIC X(45)   VALUE
               '036197074140020037112742640130038112742640051'.
           03                          PIC X(45)   VALUE
               '039067111980022040160983390176041083932250096'.
           03                          PIC X(45)   VALUE
               '042067111980055052115784190087053067111980054'.
           03                          PIC X(45)   VALUE
               '054067111980086055067111980064056086882520113'.
           03                          PIC X(45)   VALUE
               '057067842330077058112742640116059086882520069'.
           03                          PIC X(45)   VALUE
               '060067842330055061090702460114062067111980069'.
           03                          PIC X(45)   VALUE
               '063067111980047064084292350100065067111980062'.
           03                          PIC X(45)   VALUE
               '066052681750042067052681750080068052681750045'.
           03                          PIC X(45)   VALUE
               '069052681750038070090702460101071067111980068'.
           03                          PIC X(45)   VALUE
               '072067111980046073094202320082074067111980059'.
           03                          PIC X(45)   VALUE
               '075052681750105076052681750052077112742640088'.
           03                          PIC X(45)   VALUE
               '078079912450060079067111980042080100742550080'.
           03                          PIC X(45)   VALUE
               '081067111980054082083932250094083067111980068'.
           03                          PIC X(45)   VALUE
               '084052681750040085085152470107086052681750064'.
           03                          PIC X(45)   VALUE
               '087052681750041088085152470074089052681750052'.
           03                          PIC X(45)   VALUE
               '090052681750035091100742550092092079912450059'.
           03                          PIC X(45)   VALUE
               '093067111980042094102772840179095097712820117'.
           03                          PIC X(45)   VALUE
               '096052681750089097094792260173098067111980115'.
           03                          PIC X(45)   VALUE
               '099052681750080100067111980089101052681750050'.
           03                          PIC X(45)   VALUE
               '102167693480066103167693480044113067111980091'.
           03                          PIC X(45)   VALUE
               '114067111980045115067111980071116067111980085'.
           03                          PIC X(45)   VALUE
               '117067111980039121067111980074122067111980057'.
           03                          PIC X(45)   VALUE
               '123067111980039124067111980081125067111980050'.
           03                          PIC X(45)   VALUE
               '129112742640084130083932250044131067111980096'.
           03                          PIC X(45)   VALUE
               '132067111980042133167693480089134067111980037'.
           03                          PIC X(45)   VALUE
               '135067111980093136067111980039137112742640080'.
           03                          PIC X(45)   VALUE
               '138067111980038139067111980032146112742640133'.
           03                          PIC X(45)   VALUE
               '147083932250084148067111980044149052681750037'.
           03                          PIC X(45)   VALUE
               '150067111980074151052681750044152067111980068'.
           03                          PIC X(45)   VALUE
               '153052681750046154102522400086155067111980059'.
           03                          PIC X(45)   VALUE
               '156067111980043157167693480099158067111980059'.
           03                          PIC X(45)   VALUE
               '159067111980039163256144190202164112742640100'.
           03                          PIC X(45)   VALUE
               '165083932250058166240154100174167136172770100'.
           03                          PIC X(45)   VALUE
               '168083932250060175068891860093176052681750063'.
           03                          PIC X(45)   VALUE
               '177085172220118178066531940091179052681750067'.
           03                          PIC X(45)   VALUE
               '180076151850109181067111980077182052681750052'.
           03                          PIC X(45)   VALUE
               '183112741750092184112742640062185083932250044'.
           03                          PIC X(45)   VALUE
               '186082552090098187067111980070188067111980051'.
           03                          PIC X(45)   VALUE
               '189091482190079190077301970075191064761710062'.
           03                          PIC X(45)   VALUE
               '192052301390050193076522010090194059241710067'.
           03                          PIC X(45)   VALUE
               '195052681750050196073461830104197073461830068'.
           03                          PIC X(45)   VALUE
               '198052301390052199077981980116200067111980071'.
           03                          PIC X(45)   VALUE
               '201067111980051202083932250060203052301390046'.
           03                          PIC X(45)   VALUE
               '204069331820042205088452210086206065771860049'.
           03                          PIC X(45)   VALUE
               '207185673180207208108042160114215167693480290'.
           03                          PIC X(45)   VALUE
               '216167693480254217167693480145218167693480109'.
           03                          PIC X(45)   VALUE
               '219167693480177220167693480100221167693480079'.
           03                          PIC X(45)   VALUE
               '222112742640184223112742640105224112742640154'.
           03                          PIC X(45)   VALUE
               '225112742640075226167693480145227167693480070'.
           03                          PIC X(45)   VALUE
               '228169023460195229112742640112230112742640072'.
           03                          PIC X(45)   VALUE
               '231167693480181232128543170121233167693480188'.
           03                          PIC X(45)   VALUE
               '234128543170116235167693480150236128543170087'.
           03                          PIC X(45)   VALUE
               '239197074140212240112742640132241083932250080'.
           03                          PIC X(45)   VALUE
               '242112742640117243112742640069244083932250044'.
           03                          PIC X(45)   VALUE
               '245083932250089246167693480087247128543170040'.
           03                          PIC X(45)   VALUE
               '248167693480102249083932250046250112742640091'.
           03                          PIC X(45)   VALUE
               '251083932250044252169023460132253112742640092'.
           03                          PIC X(45)   VALUE
               '254197074140046255167693480138256167693480099'.
           03                          PIC X(45)   VALUE
               '257083932250066258112742640100259083932250056'.
           03                          PIC X(45)   VALUE
               '260112742640170261112742640070262083932250046'.
           03                          PIC X(45)   VALUE
               '263083932250099264128543170138265112742640071'.
           03                          PIC X(45)   VALUE
               '266167693480150267167693480077268167693480173'.
           03                          PIC X(45)   VALUE
               '269128543170040270167693480162271112742640099'.
           03                          PIC X(45)   VALUE
               '272083932250048273112742640131274083932250054'.
           03                          PIC X(45)   VALUE
               '280086562240092281063881740056282063881740036'.
           03                          PIC X(45)   VALUE
               '283111601890074284052681750037285052681750023'.
           03                          PIC X(45)   VALUE
               '286167693480112287083932250051288116302670154'.
           03                          PIC X(45)   VALUE
               '289100912750108290067111980068291084822150092'.
           03                          PIC X(45)   VALUE
               '292061851830067293061851830046294052681750074'.
           03                          PIC X(45)   VALUE
               '295052681750057296084822150043297061851830022'.
           03                          PIC X(45)   VALUE
               '298061851830015299086122180089300056901920069'.
           03                          PIC X(45)   VALUE
               '301056901920050302082442280060303067111980036'.
           03                          PIC X(45)   VALUE
               '304083932250065305052681750040306090422250085'.
           03                          PIC X(45)   VALUE
               '307067111980050308074771930076309067111980050'.
           03                          PIC X(45)   VALUE
               '310067111980034311052681750034312052681750045'.
           03                          PIC X(45)   VALUE
               '313052681750032314102042390109315066132000062'.
           03                          PIC X(45)   VALUE
               '316052681750038326167693480231327167693480124'.
           03                          PIC X(45)   VALUE
               '328070842130052329167693480224330070842130122'.
           03                          PIC X(45)   VALUE
               '331070842130067332112742640197333070842130107'.
           03                          PIC X(45)   VALUE
               '334070842130064335167693480200336167693480129'.
           03                          PIC X(45)   VALUE
               '337070842130078338167693480141339167693480089'.
           03                          PIC X(45)   VALUE
               '340070842130052341095642390102342070842130054'.
           03                          PIC X(45)   VALUE
               '343070842130029344095642390162345070842130092'.
           03                          PIC X(45)   VALUE
               '346070842130060347112742640134348070842130080'.
           03                          PIC X(45)   VALUE
               '349070842130045350095642390124351070842130068'.
           03                          PIC X(45)   VALUE
               '352070842130039353112742640132354112742640077'.
           03                          PIC X(45)   VALUE
               '355112742640047356159953400178357083932250106'.
           03                          PIC X(45)   VALUE
               '358070842130061368112742640097369067111980062'.
           03                          PIC X(45)   VALUE
               '370067111980043371095642390119372070842130083'.
           03                          PIC X(45)   VALUE
               '373070842130060374098262370128375083932250082'.
           03                          PIC X(45)   VALUE
               '376060472020055377078272320094378052681750057'.
           03                          PIC X(45)   VALUE
               '379052681750040380083932250112381083932250065'.
           03                          PIC X(45)   VALUE
               '382060472020050383052681750080384052681750050'.
           03                          PIC X(45)   VALUE
               '385083932250118386067111980074387052681750055'.
           03                          PIC X(45)   VALUE
               '388116812460109389083932250067390060472020047'.
           03                          PIC X(45)   VALUE
               '391091062320079392060472020051393107172500102'.
           03                          PIC X(45)   VALUE
               '394080022180065395052681750045405167693480233'.
           03                          PIC X(45)   VALUE
               '406052681750119407052681750079408052681750146'.
           03                          PIC X(45)   VALUE
               '409052681750120410052681750079411167693480174'.
           03                          PIC X(45)   VALUE
               '412052681750115413052681750078414083932250158'.
           03                          PIC X(45)   VALUE
               '415083932250097416052681750061417167693480114'.
           03                          PIC X(45)   VALUE
               '418052681750073419052681750046420083932250187'.
           03                          PIC X(45)   VALUE
               '421083932250086422052681750054423167693480217'.
           03                          PIC X(45)   VALUE
               '424052681750128425052681750078432072542050098'.
           03                          PIC X(45)   VALUE
               '433052681750062434052681750041435112742640107'.
           03                          PIC X(45)   VALUE
               '436067111980077437060472020053438108712420108'.
           03                          PIC X(45)   VALUE
               '439076162160066440052681750047441081252110109'.
           03                          PIC X(45)   VALUE
               '442067111980066443052681750047444104132440094'.
           03                          PIC X(45)   VALUE
               '445083932250063446052681750043453095332580175'.
           03                          PIC X(45)   VALUE
               '454080642450086455067111980051456095572550182'.
           03                          PIC X(45)   VALUE
               '457082832500096458067111980055459106592430127'.
           03                          PIC X(45)   VALUE
               '460052681750052461167693480123462167693480046'.
           03                          PIC X(45)   VALUE
               '463157153860213464130503510120465067111980072'.
           03                          PIC X(45)   VALUE
               '466167693480122467072642360061468072642360041'.
           03                          PIC X(45)   VALUE
               '469094162430104470072642360043471095572550145'.
           03                          PIC X(45)   VALUE
               '472082832500052473067111980026474164443620176'.
           03                          PIC X(45)   VALUE
               '475083932250115476083932250061477167693480159'.
           03                          PIC X(45)   VALUE
               '478167693480104479083932250069480167693480115'.
           03                          PIC X(45)   VALUE
               '481167693480068482083932250055483094162430034'.
           03                          PIC X(45)   VALUE
               '485112742640148486112742640091487110032900066'.
           03                          PIC X(45)   VALUE
               '488089482810064489083932250037492167693480118'.
           03                          PIC X(45)   VALUE
               '493167693480069494083932250047495159473760149'.
           03                          PIC X(45)   VALUE
               '496159473760080497083932250040498112742640116'.
           03                          PIC X(45)   VALUE
               '499083932250041500133503380161501112742640085'.
           03                          PIC X(45)   VALUE
               '502083932250045503112742640126504083932250091'.
           03                          PIC X(45)   VALUE
               '505083932250053506083932250069507083932250084'.
           03                          PIC X(45)   VALUE
               '508083932250041509052681750078510112742640092'.
           03                          PIC X(45)   VALUE
               '511112742640058512083932250037513083932250078'.
           03                          PIC X(45)   VALUE
               '514083932250043515160233520141516067111980083'.
           03                          PIC X(45)   VALUE
               '517067111980051518167693480097519082832500063'.
           03                          PIC X(45)   VALUE
               '520067111980034533167693480097534052681750053'.
           03                          PIC X(45)   VALUE
               '535167693480080536052681750051537052681750060'.
           03                          PIC X(45)   VALUE
               '538052681750044539110032900124540089482810092'.
           03                          PIC X(45)   VALUE
               '541083932250067542167693480121543052681750077'.
           03                          PIC X(45)   VALUE
               '544052681750053545112742640136546067111980075'.
           03                          PIC X(45)   VALUE
               '547052681750050548095572550120549082832500083'.
           03                          PIC X(45)   VALUE
               '550067111980056551106592430094552052681750057'.
           03                          PIC X(45)   VALUE
               '553112742640083554052681750053555112742640080'.
           03                          PIC X(45)   VALUE
               '556067111980049557087852420092558067932170059'.
           03                          PIC X(45)   VALUE
               '559095332580114560080642450068561067111980040'.
           03                          PIC X(45)   VALUE
               '562052681750082563052681750052564094162430097'.
           03                          PIC X(45)   VALUE
               '565072642360067566072642360047570122063190142'.
           03                          PIC X(45)   VALUE
               '571081442510095572067111980069573221334940208'.
           03                          PIC X(45)   VALUE
               '574112742640151575067111980090576167693480225'.
           03                          PIC X(45)   VALUE
               '577167693480105578067111980057579140183390145'.
           03                          PIC X(45)   VALUE
               '580112742640086581067111980044582112742640044'.
           03                          PIC X(45)   VALUE
               '583067111980027584112742640082585052681750039'.
           03                          PIC X(45)   VALUE
               '592094962550101593070052010078594052681750057'.
           03                          PIC X(45)   VALUE
               '595112742640119596052681750070597083932250115'.
           03                          PIC X(45)   VALUE
               '598052681750076599052681750045600112742640071'.
           03                          PIC X(45)   VALUE
               '601052681750050602080042200095603057801790063'.
           03                          PIC X(45)   VALUE
               '604112742640082605083932250050606124932480094'.
           03                          PIC X(45)   VALUE
               '607083932250055614140723450085615140723450037'.
           03                          PIC X(45)   VALUE
               '616155383830193617112742640109618083932250074'.
           03                          PIC X(45)   VALUE
               '619159953400087620083932250044621070842130027'.
           03                          PIC X(45)   VALUE
               '622139123430183623103293040105624083932250070'.
           03                          PIC X(45)   VALUE
               '625140723450123626083932250049627083932250021'.
           03                          PIC X(45)   VALUE
               '628140723450161629140723450111630070842130062'.
           03                          PIC X(45)   VALUE
               '637099922550084638078952370057639062912070039'.
           03                          PIC X(45)   VALUE
               '640085822200071641062912070051642078952370072'.
           03                          PIC X(45)   VALUE
               '643067111980105644052681750071645052681750051'.
           03                          PIC X(45)   VALUE
               '653112742640220654083932250119655083932250084'.
           03                          PIC X(45)   VALUE
               '656083932250140657067111980076658067111980043'.
           03                          PIC X(45)   VALUE
               '659112742640164660083932250088661083932250041'.
           03                          PIC X(45)   VALUE
               '662092542390163663063281910087664063281910038'.
           03                          PIC X(45)   VALUE
               '665112742640174666112742640106667112742640046'.
           03                          PIC X(45)   VALUE
               '668167693480135669112742640065670112742640040'.
           03                          PIC X(45)   VALUE
               '671146163180088672063281910036673146163180172'.
           03                          PIC X(45)   VALUE
               '674129663020116675063281910052682095382320096'.
           03                          PIC X(45)   VALUE
               '683073782050066684067111980044685167693480059'.
           03                          PIC X(45)   VALUE
               '686083932250113687067111980070688063281910042'.
           03                          PIC X(45)   VALUE
               '689066952080076690051361790056691146163180058'.
           03                          PIC X(45)   VALUE
               '692052681750035693052681750078694052681750037'.
           03                          PIC X(45)   VALUE
               '695067111980083696063281910049697063281910056'.
           03                          PIC X(45)   VALUE
               '698092542390097699063281910068700063281910050'.
           03                          PIC X(45)   VALUE
               '707129663020059708129663020023709083932250097'.
           03                          PIC X(45)   VALUE
               '710083932250035711167693480120712083932250046'.
           03                          PIC X(45)   VALUE
               '713112742640076714112742640029715067111980117'.
           03                          PIC X(45)   VALUE
               '716063281910029717112742640101718063281910038'.
           03                          PIC X(45)   VALUE
               '722052681750119723052681750076724052681750045'.
           03                          PIC X(45)   VALUE
               '725052681750090726052681750051727108412450097'.
           03                          PIC X(45)   VALUE
               '728083932250059729086462530074730052681750044'.
           03                          PIC X(45)   VALUE
               '734167693480105735167693480033736167693480194'.
           03                          PIC X(45)   VALUE
               '737052681750089738052681750050739140723450147'.
           03                          PIC X(45)   VALUE
               '740140723450067741070842130032742167693480062'.
           03                          PIC X(45)   VALUE
               '743167693480029744083932250093745052681750036'.
           03                          PIC X(45)   VALUE
               '746083932250077747052681750028748167693480028'.
           03                          PIC X(45)   VALUE
               '749167693480138750052681750049754083932250130'.
           03                          PIC X(45)   VALUE
               '755052681750078756052681750044757079802170099'.
           03                          PIC X(45)   VALUE
               '758067111980078759067111980058760052681750056'.
           03                          PIC X(45)   VALUE
               '761052681750033765083932250066766052681750040'.
           03                          PIC X(45)   VALUE
               '767083932250051768083932250064769083932250108'.
           03                          PIC X(45)   VALUE
               '770079802170036774083932250043775052681750031'.
           03                          PIC X(45)   VALUE
               '776052681750048777083932250034778052681750044'.
           03                          PIC X(45)   VALUE
               '779052681750033780052681750013781112742640061'.
           03                          PIC X(45)   VALUE
               '782052681750034789052681750020790083932250179'.
           03                          PIC X(45)   VALUE
               '791083932250133792052681750086793052681750120'.
           03                          PIC X(45)   VALUE
               '794052681750020795052681750031799159953400185'.
           03                          PIC X(45)   VALUE
               '800083932250106801083932250055802167693480179'.
           03                          PIC X(45)   VALUE
               '803112742640095804112742640046808112742640128'.
           03                          PIC X(45)   VALUE
               '809083932250074810067111980051811083932250077'.
           03                          PIC X(45)   VALUE
               '812067111980055813083932250081814112742640103'.
           03                          PIC X(45)   VALUE
               '815112742640064816112742640044820112742640220'.
           03                          PIC X(45)   VALUE
               '821112742640107822112742640041823167693480230'.
           03                          PIC X(45)   VALUE
               '824112742640129825112742640062826167693480229'.
           03                          PIC X(45)   VALUE
               '827112742640105828112742640055829083932250168'.
           03                          PIC X(45)   VALUE
               '830083932250055834083932250188835083932250124'.
           03                          PIC X(45)   VALUE
               '836083932250063837112872380198838083932250149'.
           03                          PIC X(45)   VALUE
               '839083932250076840112872380172841083932250099'.
           03                          PIC X(45)   VALUE
               '842083932250064843112742640125844083932250081'.
           03                          PIC X(45)   VALUE
               '845083932250056846167693480124847167693480058'.
           03                          PIC X(45)   VALUE
               '848167693480051849083932250102853188283790223'.
           03                          PIC X(45)   VALUE
               '854087242820123855067111980075856151453320207'.
           03                          PIC X(45)   VALUE
               '857094662770108858067111980070862105802540113'.
           03                          PIC X(45)   VALUE
               '863075022360070864083932250054865112742640093'.
           03                          PIC X(45)   VALUE
               '866052681750052867113222420147868067111980073'.
           03                          PIC X(45)   VALUE
               '869052681750052870198653070215871088272300106'.
           03                          PIC X(45)   VALUE
               '872059241920071876078812290191880049591770050'.
           03                          PIC X(45)   VALUE
               '881062142030072882062142030070883062142030124'.
           03                          PIC X(45)   VALUE
               '884051522450096885049012310123886049591770094'.
           03                          PIC X(45)   VALUE
               '887049591770070894049591770046895046702540194'.
           03                          PIC X(45)   VALUE
               '896078812290106897062142030063901147543410217'.
           03                          PIC X(45)   VALUE
               '902100532970114903067111980068904148043830167'.
           03                          PIC X(45)   VALUE
               '905067111980077906067111980065907165553550169'.
           03                          PIC X(45)   VALUE
               '908112742640091909052681750052913067111980081'.
           03                          PIC X(45)   VALUE
               '914052681750048915052681750081916052681750032'.
           03                          PIC X(45)   VALUE
               '917167693480075918052681750044919117632740099'.
           03                          PIC X(45)   VALUE
               '920076922280061921067111980043922083932250093'.
           03                          PIC X(45)   VALUE
               '923067111980052927083932250188928083932250188'.
           03                          PIC X(45)   VALUE
               '929083932250126933067111980079934067111980101'.
           03                          PIC X(45)   VALUE
               '935067111980080939141473280155940095062780085'.
           03                          PIC X(45)   VALUE
               '941067111980042945084992050171946052151620116'.
           03                          PIC X(45)   VALUE
               '947083932250074948052681750051949073942150077'.
           03                          PIC X(45)   VALUE
               '950042361640045951112742640075955167693480208'.
           03                          PIC X(45)   VALUE
               '956094162430116957167693480239958083932250132'.
           03                          PIC X(45)   VALUE
               '959083932250073963167693480137964083932250078'.
           03                          PIC X(45)   VALUE
               '965083932250053969167693480246970067111980114'.
           03                          PIC X(45)   VALUE
               '974119322340150975083932250094976067111980064'.
           03                          PIC X(45)   VALUE
               '977052681750074981229234020203982129672840116'.
           03                          PIC X(45)   VALUE
               '983067111980057984167693480206985167693480112'.
           03                          PIC X(45)   VALUE
               '986067111980054987190223700173988118943000101'.
           03                          PIC X(15)   VALUE
               '989067111980047'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 748 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
               05  WWM-IPTHRESH        PIC 9(3)V9(1).
