       01  W-DRG-FILLS.
           03                          PIC X(45)   VALUE
               '003415376010534004297934300398011111242840231'.
           03                          PIC X(45)   VALUE
               '012086462400149013045701770100014071272060490'.
           03                          PIC X(45)   VALUE
               '016071272060301017071272060268020083152380290'.
           03                          PIC X(45)   VALUE
               '021056872100212022045701770137023163423350193'.
           03                          PIC X(45)   VALUE
               '024086462400112025163423350171026045701770110'.
           03                          PIC X(45)   VALUE
               '027045701770058028111242840211029111242840108'.
           03                          PIC X(45)   VALUE
               '030062982090051031111242840205032111242840087'.
           03                          PIC X(45)   VALUE
               '033062982090039034064682070121035064682070049'.
           03                          PIC X(45)   VALUE
               '036064682070021037163423350142038111242840055'.
           03                          PIC X(45)   VALUE
               '039064682070023040133763280192041092882800104'.
           03                          PIC X(45)   VALUE
               '042064682070055052122243470092053122243470054'.
           03                          PIC X(45)   VALUE
               '054090782520091055045701770068056083832490113'.
           03                          PIC X(45)   VALUE
               '057057672310073058086462400109059086462400072'.
           03                          PIC X(45)   VALUE
               '060045701770055061082092360129062065392270078'.
           03                          PIC X(45)   VALUE
               '063064682070054064083152380110065056872100069'.
           03                          PIC X(45)   VALUE
               '066045701770046067111242840086068111242840050'.
           03                          PIC X(45)   VALUE
               '069064682070041070082092360109071065392270073'.
           03                          PIC X(45)   VALUE
               '072064682070047073088882470086074062982090062'.
           03                          PIC X(45)   VALUE
               '075086462400110076045701770060077064682070095'.
           03                          PIC X(45)   VALUE
               '078064682070063079064682070044080111242840083'.
           03                          PIC X(45)   VALUE
               '081064682070052082086462400092083086462400071'.
           03                          PIC X(45)   VALUE
               '084045701770042085086202680114086065872220068'.
           03                          PIC X(45)   VALUE
               '087045701770041088086202680085089045701770053'.
           03                          PIC X(45)   VALUE
               '090045701770033091092372430097092070122340062'.
           03                          PIC X(45)   VALUE
               '093064682070042094107432690191095085692720129'.
           03                          PIC X(45)   VALUE
               '096064682070089097095142310188098060821950121'.
           03                          PIC X(45)   VALUE
               '099045701770079100075552260092101064682070051'.
           03                          PIC X(45)   VALUE
               '102086462400064103064682070045113111242840091'.
           03                          PIC X(45)   VALUE
               '114064682070045115163423350073116111242840083'.
           03                          PIC X(45)   VALUE
               '117064682070034121086462400077122064682070058'.
           03                          PIC X(45)   VALUE
               '123111242840041124111242840078125064682070050'.
           03                          PIC X(45)   VALUE
               '129163423350085130045701770044131111242840098'.
           03                          PIC X(45)   VALUE
               '132064682070041133163423350088134086462400034'.
           03                          PIC X(45)   VALUE
               '135111242840098136045701770035137045701770080'.
           03                          PIC X(45)   VALUE
               '138045701770035139064682070025146139192900151'.
           03                          PIC X(45)   VALUE
               '147086462400088148045701770050149045701770038'.
           03                          PIC X(45)   VALUE
               '150086462400084151064682070043152082092070068'.
           03                          PIC X(45)   VALUE
               '153064682070047154082982210092155064682070064'.
           03                          PIC X(45)   VALUE
               '156064682070043157083782440108158064682070064'.
           03                          PIC X(45)   VALUE
               '159064682070040163218203690215164086462400109'.
           03                          PIC X(45)   VALUE
               '165086462400064166241814040182167134922880110'.
           03                          PIC X(45)   VALUE
               '168045701770066175081892140102176051281780071'.
           03                          PIC X(45)   VALUE
               '177088292270130178069071980099179060501810072'.
           03                          PIC X(45)   VALUE
               '180075581870119181059861770083182059861770054'.
           03                          PIC X(45)   VALUE
               '183111242840098184111242840065185086462400045'.
           03                          PIC X(45)   VALUE
               '186080332130104187064682070075188064682070051'.
           03                          PIC X(45)   VALUE
               '189093172200083190074841980081191061321780067'.
           03                          PIC X(45)   VALUE
               '192049821560053193074762010098194061021840072'.
           03                          PIC X(45)   VALUE
               '195048381610053196075292040109197061941890076'.
           03                          PIC X(45)   VALUE
               '198045701770056199074442090128200061592020071'.
           03                          PIC X(45)   VALUE
               '201045701770051202066791900062203064682070047'.
           03                          PIC X(45)   VALUE
               '204078242030041205088242210086206069631910050'.
           03                          PIC X(45)   VALUE
               '207195493200216208108182130119215086462400283'.
           03                          PIC X(45)   VALUE
               '216163423350260217108963120152218064682070113'.
           03                          PIC X(45)   VALUE
               '219111242840193220111242840107221064682070081'.
           03                          PIC X(45)   VALUE
               '222163423350188223111242840101224163423350158'.
           03                          PIC X(45)   VALUE
               '225163423350080226163423350150227163423350049'.
           03                          PIC X(45)   VALUE
               '228146333120208229108963120117230064682070085'.
           03                          PIC X(45)   VALUE
               '231111242840186232064682070133233111242840193'.
           03                          PIC X(45)   VALUE
               '234064682070118235111242840156236064682070088'.
           03                          PIC X(45)   VALUE
               '237111242840175238064682070063239174623970222'.
           03                          PIC X(45)   VALUE
               '240115143180142241064682070087242163423350125'.
           03                          PIC X(45)   VALUE
               '243111242840075244111242840044245086462400069'.
           03                          PIC X(45)   VALUE
               '246163423350085247064682070037248163423350104'.
           03                          PIC X(45)   VALUE
               '249163423350045250163423350117251086462400046'.
           03                          PIC X(45)   VALUE
               '252146333120131253108963120098254064682070042'.
           03                          PIC X(45)   VALUE
               '255138633480143256094822900109257045701770067'.
           03                          PIC X(45)   VALUE
               '258111242840106259045701770052260111242840177'.
           03                          PIC X(45)   VALUE
               '261111242840072262045701770042263163423350097'.
           03                          PIC X(45)   VALUE
               '264113753010140265111242840059280079712150101'.
           03                          PIC X(45)   VALUE
               '281065212010063282045701770039283090791810083'.
           03                          PIC X(45)   VALUE
               '284064682070039285064682070024286163423350107'.
           03                          PIC X(45)   VALUE
               '287111242840048288108502710160289084052530113'.
           03                          PIC X(45)   VALUE
               '290064682070077291079622090096292059761890071'.
           03                          PIC X(45)   VALUE
               '293047451680048294111242840079295045701770062'.
           03                          PIC X(45)   VALUE
               '296079622090042297059761890021298047451680015'.
           03                          PIC X(45)   VALUE
               '299079672280093300059322110073301045701770053'.
           03                          PIC X(45)   VALUE
               '302081942150062303064682070035304111242840069'.
           03                          PIC X(45)   VALUE
               '305064682070040306101972380083307064462090051'.
           03                          PIC X(45)   VALUE
               '308068812060080309053331790054310045701770035'.
           03                          PIC X(45)   VALUE
               '311064682070032312045701770045313086462400030'.
           03                          PIC X(45)   VALUE
               '314096452360111315068372060063316064682070038'.
           03                          PIC X(45)   VALUE
               '326163423350249327163423350136328163423350053'.
           03                          PIC X(45)   VALUE
               '329218894220235330111242840129331045701770073'.
           03                          PIC X(45)   VALUE
               '332163423350207333064682070117334064682070070'.
           03                          PIC X(45)   VALUE
               '335163423350211336111242840133337086462400081'.
           03                          PIC X(45)   VALUE
               '338093602390157339069402120097340045701770055'.
           03                          PIC X(45)   VALUE
               '341093602390108342069402120058343045701770028'.
           03                          PIC X(45)   VALUE
               '344163423350181345086462400099346045701770063'.
           03                          PIC X(45)   VALUE
               '347163423350143348064682070086349064682070044'.
           03                          PIC X(45)   VALUE
               '350111242840129351045701770070352111242840036'.
           03                          PIC X(45)   VALUE
               '353163423350134354069402120078355045701770045'.
           03                          PIC X(45)   VALUE
               '356152533600198357101712820114358086462400064'.
           03                          PIC X(45)   VALUE
               '368080932150104369064682070065370045701770046'.
           03                          PIC X(45)   VALUE
               '371093602390134372069402120092373045701770065'.
           03                          PIC X(45)   VALUE
               '374081042120140375059251900088376059251900055'.
           03                          PIC X(45)   VALUE
               '377073782130100378052351750061379045701770043'.
           03                          PIC X(45)   VALUE
               '380093212450115381064682070070382045701770052'.
           03                          PIC X(45)   VALUE
               '383045701770088384045701770053385082462090133'.
           03                          PIC X(45)   VALUE
               '386082462090079387045701770059388095512290116'.
           03                          PIC X(45)   VALUE
               '389076652090071390045701770049391087872300082'.
           03                          PIC X(45)   VALUE
               '392060111920053393105992600108394071682180070'.
           03                          PIC X(45)   VALUE
               '395045701770046405163423350252406163423350130'.
           03                          PIC X(45)   VALUE
               '407086462400082408086462400203409086462400128'.
           03                          PIC X(45)   VALUE
               '410086462400088411086462400181412086462400125'.
           03                          PIC X(45)   VALUE
               '413086462400082414163423350166415111242840105'.
           03                          PIC X(45)   VALUE
               '416045701770067417163423350122418064682070080'.
           03                          PIC X(45)   VALUE
               '419064682070047420163423350202421086462400103'.
           03                          PIC X(45)   VALUE
               '422086462400065423154803660219424086462400133'.
           03                          PIC X(45)   VALUE
               '425086462400080432071532150101433045701770066'.
           03                          PIC X(45)   VALUE
               '434045701770050435075291910115436045701770084'.
           03                          PIC X(45)   VALUE
               '437045701770057438097242330117439071022010072'.
           03                          PIC X(45)   VALUE
               '440071022010051441080742250113442061042060069'.
           03                          PIC X(45)   VALUE
               '443061042060049444080672110100445057041930068'.
           03                          PIC X(45)   VALUE
               '446045701770046453163423350197454163423350095'.
           03                          PIC X(45)   VALUE
               '455163423350055456163423350198457163423350095'.
           03                          PIC X(45)   VALUE
               '458163423350055459111242840140460163423350055'.
           03                          PIC X(45)   VALUE
               '461163423350114462163423350051463144943900239'.
           03                          PIC X(45)   VALUE
               '464111343330126465085832800077466111242840132'.
           03                          PIC X(45)   VALUE
               '467111242840064468086462400045469111242840113'.
           03                          PIC X(45)   VALUE
               '470111242840047471111242840153472111242840058'.
           03                          PIC X(45)   VALUE
               '473111242840026474139073610188475108383450119'.
           03                          PIC X(45)   VALUE
               '476064682070062477129403510173478129403510109'.
           03                          PIC X(45)   VALUE
               '479086462400067480163423350125481111242840073'.
           03                          PIC X(45)   VALUE
               '482086462400059483163423350052484163423350030'.
           03                          PIC X(45)   VALUE
               '485111242840155486111242840100487086462400072'.
           03                          PIC X(45)   VALUE
               '488086462400065489086462400040490163423350071'.
           03                          PIC X(45)   VALUE
               '491163423350031492111242840129493111242840073'.
           03                          PIC X(45)   VALUE
               '494111242840046495144503890159496105533500083'.
           03                          PIC X(45)   VALUE
               '497086462400038498132443860116499086462400041'.
           03                          PIC X(45)   VALUE
               '500128043480167501100463070090502045701770045'.
           03                          PIC X(45)   VALUE
               '503119733310139504094162960093505094162960050'.
           03                          PIC X(45)   VALUE
               '506045701770065507111242840090508086462400033'.
           03                          PIC X(45)   VALUE
               '509045701770059510064682070100511045701770058'.
           03                          PIC X(45)   VALUE
               '512045701770033513086462400077514086462400040'.
           03                          PIC X(45)   VALUE
               '515138643430155516111242840089517045701770055'.
           03                          PIC X(45)   VALUE
               '533086462400099534086462400057535086462400085'.
           03                          PIC X(45)   VALUE
               '536064682070053537045701770061538045701770043'.
           03                          PIC X(45)   VALUE
               '539104223000137540079502660095541071582490074'.
           03                          PIC X(45)   VALUE
               '542104832330132543060091930084544060091930059'.
           03                          PIC X(45)   VALUE
               '545091342400142546065262410081547045701770054'.
           03                          PIC X(45)   VALUE
               '548091422670123549076732530088550064682070060'.
           03                          PIC X(45)   VALUE
               '551103332790103552068092340060553111242840087'.
           03                          PIC X(45)   VALUE
               '554045701770055555086462400082556064682070050'.
           03                          PIC X(45)   VALUE
               '557093862570102558071192340062559091942650114'.
           03                          PIC X(45)   VALUE
               '560072662510070561059132230038562086462400089'.
           03                          PIC X(45)   VALUE
               '563064682070053564083502360099565064882230071'.
           03                          PIC X(45)   VALUE
               '566045701770050570125943490153571094422980101'.
           03                          PIC X(45)   VALUE
               '572067422470073573143584070212574127343670155'.
           03                          PIC X(45)   VALUE
               '575111242840088576163423350220577111242840094'.
           03                          PIC X(45)   VALUE
               '578064682070050579120543300155580084782820085'.
           03                          PIC X(45)   VALUE
               '581064682070039582084782820040583086462400025'.
           03                          PIC X(45)   VALUE
               '584086462400087585060032100033592087082590109'.
           03                          PIC X(45)   VALUE
               '593065442300082594057152230062595075162240124'.
           03                          PIC X(45)   VALUE
               '596052372080072597086462400120598086462400088'.
           03                          PIC X(45)   VALUE
               '599052372080048600111242840079601045701770056'.
           03                          PIC X(45)   VALUE
               '602076762260101603052611850066604073042310085'.
           03                          PIC X(45)   VALUE
               '605056612070050606082852290095607060032100056'.
           03                          PIC X(45)   VALUE
               '614104843070090615104843070041616145853700217'.
           03                          PIC X(45)   VALUE
               '617105293070117618064682070079619163423350112'.
           03                          PIC X(45)   VALUE
               '620111242840046621111242840027622128843480202'.
           03                          PIC X(45)   VALUE
               '623101753070114624064682070068625163423350111'.
           03                          PIC X(45)   VALUE
               '626104843070044627104843070019628130583340170'.
           03                          PIC X(45)   VALUE
               '629104843070116630086462400066637091272620090'.
           03                          PIC X(45)   VALUE
               '638071992360059639064682070040640088372280075'.
           03                          PIC X(45)   VALUE
               '641062962080053642163423350073643086462400112'.
           03                          PIC X(45)   VALUE
               '644064682070076645045701770053653064682070248'.
           03                          PIC X(45)   VALUE
               '654111242840134655111242840089656086462400152'.
           03                          PIC X(45)   VALUE
               '657045701770082658045701770048659163423350177'.
           03                          PIC X(45)   VALUE
               '660111242840093661111242840043662111242840171'.
           03                          PIC X(45)   VALUE
               '663086462400085664064682070029665111242840193'.
           03                          PIC X(45)   VALUE
               '666111242840104667111242840039668111242840144'.
           03                          PIC X(45)   VALUE
               '669111242840068670111242840037671086462400085'.
           03                          PIC X(45)   VALUE
               '672111242840035673134803130169674109282910117'.
           03                          PIC X(45)   VALUE
               '675086462400038682091722320105683069962040072'.
           03                          PIC X(45)   VALUE
               '684045701770048685163423350055686091332400118'.
           03                          PIC X(45)   VALUE
               '687064682070075688045701770044689070672180084'.
           03                          PIC X(45)   VALUE
               '690053061870059691086462400064692045701770031'.
           03                          PIC X(45)   VALUE
               '693086462400084694045701770037695111242840088'.
           03                          PIC X(45)   VALUE
               '696045701770048697045701770051698090252270104'.
           03                          PIC X(45)   VALUE
               '699068312090071700045701770051707064682070064'.
           03                          PIC X(45)   VALUE
               '708064682070025709163423350103710163423350026'.
           03                          PIC X(45)   VALUE
               '711111242840132712111242840049713064682070070'.
           03                          PIC X(45)   VALUE
               '714064682070026715064682070112716064682070021'.
           03                          PIC X(45)   VALUE
               '717111242840100718045701770046722086462400119'.
           03                          PIC X(45)   VALUE
               '723064682070081724064682070040725111242840093'.
           03                          PIC X(45)   VALUE
               '726064682070052727071682190100728048531780061'.
           03                          PIC X(45)   VALUE
               '729077712500070730064682070038734111242840116'.
           03                          PIC X(45)   VALUE
               '735111242840034736111242840200737045701770096'.
           03                          PIC X(45)   VALUE
               '738045701770050739130583340150740104843070065'.
           03                          PIC X(45)   VALUE
               '741086462400032742111242840059743086462400028'.
           03                          PIC X(45)   VALUE
               '744111242840095745111242840032746163423350069'.
           03                          PIC X(45)   VALUE
               '747086462400025748111242840023749111242840141'.
           03                          PIC X(45)   VALUE
               '750111242840046754086462400135755045701770081'.
           03                          PIC X(45)   VALUE
               '756045701770041757098422560123758061711990085'.
           03                          PIC X(45)   VALUE
               '759061711990057760086462400057761086462400033'.
           03                          PIC X(45)   VALUE
               '765111242840067766111242840041767111242840044'.
           03                          PIC X(45)   VALUE
               '768111242840058769086462400080770111242840029'.
           03                          PIC X(45)   VALUE
               '774111242840046775111242840032776064682070049'.
           03                          PIC X(45)   VALUE
               '777064682070035778064682070046779064682070027'.
           03                          PIC X(45)   VALUE
               '780064682070015781111242840058782064682070037'.
           03                          PIC X(45)   VALUE
               '789064682070018790064682070179791064682070133'.
           03                          PIC X(45)   VALUE
               '792064682070086793064682070047794064682070034'.
           03                          PIC X(45)   VALUE
               '795064682070031799111242840207800064682070114'.
           03                          PIC X(45)   VALUE
               '801064682070058802163423350184803111242840094'.
           03                          PIC X(45)   VALUE
               '804111242840047808108492400123809064682070075'.
           03                          PIC X(45)   VALUE
               '810045701770053811071272060080812071272060053'.
           03                          PIC X(45)   VALUE
               '813081881950079814099832560107815064682070070'.
           03                          PIC X(45)   VALUE
               '816064682070047820111242840282821111242840115'.
           03                          PIC X(45)   VALUE
               '822111242840044823111242840242824064682070134'.
           03                          PIC X(45)   VALUE
               '825111242840060826111242840228827064682070111'.
           03                          PIC X(45)   VALUE
               '828111242840054829163423350161830111242840052'.
           03                          PIC X(45)   VALUE
               '834111242840289835086462400135836045701770063'.
           03                          PIC X(45)   VALUE
               '837086462400393838086462400159839045701770081'.
           03                          PIC X(45)   VALUE
               '840090222130175841065901930104842064682070063'.
           03                          PIC X(45)   VALUE
               '843086462400130844064682070090845064682070059'.
           03                          PIC X(45)   VALUE
               '846142843030132847122792830054848122792830047'.
           03                          PIC X(45)   VALUE
               '849080022200097853175453750239854101862830136'.
           03                          PIC X(45)   VALUE
               '855045701770079856146183400226857097922930116'.
           03                          PIC X(45)   VALUE
               '858086462400074862097602510121863070522260073'.
           03                          PIC X(45)   VALUE
               '864163423350057865086332130100866064682070053'.
           03                          PIC X(45)   VALUE
               '867108002380152868059391920076869059391920053'.
           03                          PIC X(45)   VALUE
               '870207262960221871087812290114872059121970078'.
           03                          PIC X(45)   VALUE
               '876163423350200880045701770045881036102070068'.
           03                          PIC X(45)   VALUE
               '882045701770068883045701770126884054082730082'.
           03                          PIC X(45)   VALUE
               '885048892390118886045701770092887163423350075'.
           03                          PIC X(45)   VALUE
               '894045701770044895045701770189896048862450107'.
           03                          PIC X(45)   VALUE
               '897041392490062901134283320243902097482850110'.
           03                          PIC X(45)   VALUE
               '903064682070064904120543610168905064682070075'.
           03                          PIC X(45)   VALUE
               '906163423350054907165413670181908098482960097'.
           03                          PIC X(45)   VALUE
               '909086462400052913083442360082914054961990048'.
           03                          PIC X(45)   VALUE
               '915163423350083916045701770031917084132600079'.
           03                          PIC X(45)   VALUE
               '918045701770041919112532660097920077512360063'.
           03                          PIC X(45)   VALUE
               '921049281860043922064682070090923064682070044'.
           03                          PIC X(45)   VALUE
               '927086462400525928086462400259929086462400126'.
           03                          PIC X(45)   VALUE
               '933111242840076934068292370093935064872160080'.
           03                          PIC X(45)   VALUE
               '939142723370155940098892820086941045701770041'.
           03                          PIC X(45)   VALUE
               '945064062050156946042801870111947078582120076'.
           03                          PIC X(45)   VALUE
               '948064682070052949070872170065950044911660048'.
           03                          PIC X(45)   VALUE
               '951174213070065955163423350204956111242840125'.
           03                          PIC X(45)   VALUE
               '957163423350255958086462400146959086462400094'.
           03                          PIC X(45)   VALUE
               '963111242840149964064682070087965064682070057'.
           03                          PIC X(45)   VALUE
               '969163423350269970101442270119974101442270158'.
           03                          PIC X(45)   VALUE
               '975062941830098976062941830063977061451850074'.
           03                          PIC X(45)   VALUE
               '981214493970223982111823120129983111242840062'.
           03                          PIC X(45)   VALUE
               '984111242840211985111242840139986064682070056'.
           03                          PIC X(45)   VALUE
               '987176593680188988103892950112989103892950048'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 741 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
               05  WWM-IPTHRESH        PIC 9(3)V9(1).
