       01  W-DRG-FILLS.
           03                          PIC X(45)   VALUE
               '003412776120510004293454350363011091522310193'.
           03                          PIC X(45)   VALUE
               '012076892230148013045721740100014055741970164'.
           03                          PIC X(45)   VALUE
               '016055741970164017055741970164020086222270189'.
           03                          PIC X(45)   VALUE
               '021055401960163022055401960127023162273450195'.
           03                          PIC X(45)   VALUE
               '024076892230112025162273450163026076892230105'.
           03                          PIC X(45)   VALUE
               '027076892230054028162273450202029112592740103'.
           03                          PIC X(45)   VALUE
               '030060372030052031162273450186032060372030079'.
           03                          PIC X(45)   VALUE
               '033060372030038034112592740119035112592740048'.
           03                          PIC X(45)   VALUE
               '036112592740021037162273450134038112592740056'.
           03                          PIC X(45)   VALUE
               '039045721740023040144503590179041092642860103'.
           03                          PIC X(45)   VALUE
               '042060031980054052120353570086053120353570052'.
           03                          PIC X(45)   VALUE
               '054074792110088055045721740066056079142500112'.
           03                          PIC X(45)   VALUE
               '057056552330073058076892230112059060031980074'.
           03                          PIC X(45)   VALUE
               '060045721740056061082122460122062068982550074'.
           03                          PIC X(45)   VALUE
               '063045721740050064086222270104065055401960066'.
           03                          PIC X(45)   VALUE
               '066055401960044067076892230084068045721740047'.
           03                          PIC X(45)   VALUE
               '069076892230039070082122460105071068982550072'.
           03                          PIC X(45)   VALUE
               '072045721740044073085552330084074060372030061'.
           03                          PIC X(45)   VALUE
               '075060031980100076045721740057077112592740094'.
           03                          PIC X(45)   VALUE
               '078045721740061079045721740043080076892230082'.
           03                          PIC X(45)   VALUE
               '081060031980053082112592740094083076892230070'.
           03                          PIC X(45)   VALUE
               '084045721740041085089062490110086063672210065'.
           03                          PIC X(45)   VALUE
               '087045721740041088112592740080089076892230052'.
           03                          PIC X(45)   VALUE
               '090076892230034091100842470095092061572120061'.
           03                          PIC X(45)   VALUE
               '093060031980041094110512810181095081312370125'.
           03                          PIC X(45)   VALUE
               '096081312370087097081472050171098060031980117'.
           03                          PIC X(45)   VALUE
               '099045721740079100068552070090101045721740050'.
           03                          PIC X(45)   VALUE
               '102112592740067103045721740044113162273450090'.
           03                          PIC X(45)   VALUE
               '114060031980046115060031980068116162273450076'.
           03                          PIC X(45)   VALUE
               '117060031980036121076892230075122060031980054'.
           03                          PIC X(45)   VALUE
               '123060031980040124162273450082125060031980049'.
           03                          PIC X(45)   VALUE
               '129125912670082130125912670040131076892230088'.
           03                          PIC X(45)   VALUE
               '132045721740039133076892230086134045721740036'.
           03                          PIC X(45)   VALUE
               '135076892230098136045721740036137076892230081'.
           03                          PIC X(45)   VALUE
               '138045721740038139070372460028146125912670136'.
           03                          PIC X(45)   VALUE
               '147125912670088148070372460047149045721740038'.
           03                          PIC X(45)   VALUE
               '150080622180079151045721740043152080622180066'.
           03                          PIC X(45)   VALUE
               '153045721740045154091522310089155076892230062'.
           03                          PIC X(45)   VALUE
               '156045721740043157119412690100158070372460062'.
           03                          PIC X(45)   VALUE
               '159070372460039163226463850211164162273450104'.
           03                          PIC X(45)   VALUE
               '165162273450061166243084000177167127682980107'.
           03                          PIC X(45)   VALUE
               '168076892230062175070852020099176053241790069'.
           03                          PIC X(45)   VALUE
               '177088032220125178069601970095179055211740070'.
           03                          PIC X(45)   VALUE
               '180070671790115181064571710081182045721740052'.
           03                          PIC X(45)   VALUE
               '183060031980093184060031980064185060031980045'.
           03                          PIC X(45)   VALUE
               '186083462060102187066211770072188045721740051'.
           03                          PIC X(45)   VALUE
               '189091612160080190073771950078191062851820065'.
           03                          PIC X(45)   VALUE
               '192049561560051193076932020095194060011770070'.
           03                          PIC X(45)   VALUE
               '195048291530052196072161850108197063941890073'.
           03                          PIC X(45)   VALUE
               '198060031980056199078662030122200045721740068'.
           03                          PIC X(45)   VALUE
               '201045721740051202065411850060203060031980046'.
           03                          PIC X(45)   VALUE
               '204076642130041205088122160085206063141800050'.
           03                          PIC X(45)   VALUE
               '207197253220208208110662180116215045721740145'.
           03                          PIC X(45)   VALUE
               '216045721740145217045721740145218045721740113'.
           03                          PIC X(45)   VALUE
               '219162273450188220162273450103221112592740080'.
           03                          PIC X(45)   VALUE
               '222162273450187223112592740105224162273450155'.
           03                          PIC X(45)   VALUE
               '225076892230078226162273450144227112592740051'.
           03                          PIC X(45)   VALUE
               '228154343310203229119753090115230112592740078'.
           03                          PIC X(45)   VALUE
               '231162273450189232112592740130233112592740193'.
           03                          PIC X(45)   VALUE
               '234112592740117235162273450155236112592740088'.
           03                          PIC X(45)   VALUE
               '237162273450171238112592740061239150923730221'.
           03                          PIC X(45)   VALUE
               '240111383070137241076892230083242162273450122'.
           03                          PIC X(45)   VALUE
               '243112592740073244112592740045245076892230076'.
           03                          PIC X(45)   VALUE
               '246162273450085247112592740038248112592740101'.
           03                          PIC X(45)   VALUE
               '249112592740045250162273450115251112592740048'.
           03                          PIC X(45)   VALUE
               '252154343310130253119753090092254045721740044'.
           03                          PIC X(45)   VALUE
               '255129723300143256110683080103257060031980060'.
           03                          PIC X(45)   VALUE
               '258112592740099259112592740054260162273450176'.
           03                          PIC X(45)   VALUE
               '261045721740069262045721740045263112592740086'.
           03                          PIC X(45)   VALUE
               '264108572980137265162273450057280080322250097'.
           03                          PIC X(45)   VALUE
               '281063182040059282045721740038283080511650076'.
           03                          PIC X(45)   VALUE
               '284076892230037285076892230024286162273450108'.
           03                          PIC X(45)   VALUE
               '287060031980048288101032570158289082012540111'.
           03                          PIC X(45)   VALUE
               '290076892230077291081582130094292061051920070'.
           03                          PIC X(45)   VALUE
               '293047541690047294058192030078295045721740056'.
           03                          PIC X(45)   VALUE
               '296081582130043297061051920020298047541690013'.
           03                          PIC X(45)   VALUE
               '299079902280091300058192030071301045721740052'.
           03                          PIC X(45)   VALUE
               '302072011950060303069902260035304076892230069'.
           03                          PIC X(45)   VALUE
               '305045721740039306083442240084307083442240051'.
           03                          PIC X(45)   VALUE
               '308076352120078309051491720052310045721740034'.
           03                          PIC X(45)   VALUE
               '311060031980033312056242070045313076892230032'.
           03                          PIC X(45)   VALUE
               '314093372330110315067172040063316060031980038'.
           03                          PIC X(45)   VALUE
               '326206513870242327162273450132328045721740053'.
           03                          PIC X(45)   VALUE
               '329179963790231330112592740127331045721740071'.
           03                          PIC X(45)   VALUE
               '332112592740204333060031980113334045721740067'.
           03                          PIC X(45)   VALUE
               '335162273450205336162273450132337045721740080'.
           03                          PIC X(45)   VALUE
               '338093652400149339069342050092340060031980054'.
           03                          PIC X(45)   VALUE
               '341093652400103342069342050055343060031980027'.
           03                          PIC X(45)   VALUE
               '344162273450178345069342050097346060031980063'.
           03                          PIC X(45)   VALUE
               '347112592740139348060031980082349060031980046'.
           03                          PIC X(45)   VALUE
               '350045721740130351045721740071352045721740038'.
           03                          PIC X(45)   VALUE
               '353162273450131354069342050079355060031980046'.
           03                          PIC X(45)   VALUE
               '356144223400190357095562770111358045721740065'.
           03                          PIC X(45)   VALUE
               '368100922480105369060031980065370060031980045'.
           03                          PIC X(45)   VALUE
               '371093652400127372069342050089373060031980064'.
           03                          PIC X(45)   VALUE
               '374094212210137375065341980087376045721740055'.
           03                          PIC X(45)   VALUE
               '377089232350096378057981980060379045721740042'.
           03                          PIC X(45)   VALUE
               '380103452480114381060031980071382060031980050'.
           03                          PIC X(45)   VALUE
               '383076892230084384060031980054385087772230125'.
           03                          PIC X(45)   VALUE
               '386058791940078387058791940059388099242310113'.
           03                          PIC X(45)   VALUE
               '389065721900070390045721740049391084852320081'.
           03                          PIC X(45)   VALUE
               '392062641990054393106092550106394071602180069'.
           03                          PIC X(45)   VALUE
               '395060031980046405162273450236406162273450125'.
           03                          PIC X(45)   VALUE
               '407162273450081408060031980165409060031980123'.
           03                          PIC X(45)   VALUE
               '410060031980078411112592740175412112592740116'.
           03                          PIC X(45)   VALUE
               '413112592740079414112592740162415112592740101'.
           03                          PIC X(45)   VALUE
               '416060031980063417112592740118418060031980077'.
           03                          PIC X(45)   VALUE
               '419060031980047420076892230186421076892230104'.
           03                          PIC X(45)   VALUE
               '422076892230062423162273450213424162273450133'.
           03                          PIC X(45)   VALUE
               '425162273450077432071932000101433045721740065'.
           03                          PIC X(45)   VALUE
               '434045721740045435087012170111436076892230081'.
           03                          PIC X(45)   VALUE
               '437076892230057438107502510113439069311950069'.
           03                          PIC X(45)   VALUE
               '440045721740049441082312060111442058942020067'.
           03                          PIC X(45)   VALUE
               '443045721740049444086172310098445055611870066'.
           03                          PIC X(45)   VALUE
               '446045721740045453162273450190454162273450092'.
           03                          PIC X(45)   VALUE
               '455162273450054456162273450190457162273450096'.
           03                          PIC X(45)   VALUE
               '458162273450056459162273450133460162273450054'.
           03                          PIC X(45)   VALUE
               '461162273450111462162273450051463140393780221'.
           03                          PIC X(45)   VALUE
               '464109173310122465109173310075466162273450129'.
           03                          PIC X(45)   VALUE
               '467162273450063468162273450043469162273450110'.
           03                          PIC X(45)   VALUE
               '470162273450045471112592740150472112592740056'.
           03                          PIC X(45)   VALUE
               '473076892230026474158543790184475125163300113'.
           03                          PIC X(45)   VALUE
               '476060031980062477147163880169478112592740106'.
           03                          PIC X(45)   VALUE
               '479060031980068480162273450123481162273450071'.
           03                          PIC X(45)   VALUE
               '482162273450057483162273450050484162273450029'.
           03                          PIC X(45)   VALUE
               '485112592740157486112592740095487076892230069'.
           03                          PIC X(45)   VALUE
               '488162273450064489162273450041490162273450073'.
           03                          PIC X(45)   VALUE
               '491162273450034492162273450124493112592740072'.
           03                          PIC X(45)   VALUE
               '494112592740047495147483850156496108583590083'.
           03                          PIC X(45)   VALUE
               '497076892230039498112592740115499076892230039'.
           03                          PIC X(45)   VALUE
               '500137373540159501090063100086502060031980045'.
           03                          PIC X(45)   VALUE
               '503125203070126504088792360093505088792360050'.
           03                          PIC X(45)   VALUE
               '506045721740060507162273450089508162273450036'.
           03                          PIC X(45)   VALUE
               '509060031980056510137373540094511090063100059'.
           03                          PIC X(45)   VALUE
               '512060031980035513112592740079514045721740042'.
           03                          PIC X(45)   VALUE
               '515127963080151516112592740086517060031980054'.
           03                          PIC X(45)   VALUE
               '533060031980091534060031980055535060031980084'.
           03                          PIC X(45)   VALUE
               '536045721740052537060031980061538060031980043'.
           03                          PIC X(45)   VALUE
               '539103242970129540082212740094541075332550074'.
           03                          PIC X(45)   VALUE
               '542088982210128543060031980082544060031980056'.
           03                          PIC X(45)   VALUE
               '545085942220139546070531820079547045721740055'.
           03                          PIC X(45)   VALUE
               '548094112610125549074622510081550055142280059'.
           03                          PIC X(45)   VALUE
               '551102312890102552070152390060553112592740087'.
           03                          PIC X(45)   VALUE
               '554045721740055555060031980079556060031980050'.
           03                          PIC X(45)   VALUE
               '557081802380099558062432030061559089152600113'.
           03                          PIC X(45)   VALUE
               '560074812510069561061022190038562076892230087'.
           03                          PIC X(45)   VALUE
               '563045721740053564088812380099565073252340070'.
           03                          PIC X(45)   VALUE
               '566060031980051570116923320147571087392710100'.
           03                          PIC X(45)   VALUE
               '572067532570070573152344260200574092533130157'.
           03                          PIC X(45)   VALUE
               '575076892230087576162273450211577162273450096'.
           03                          PIC X(45)   VALUE
               '578076892230051579120153380148580096402730084'.
           03                          PIC X(45)   VALUE
               '581060031980040582096402730040583060031980025'.
           03                          PIC X(45)   VALUE
               '584162273450078585057702000040592083012520103'.
           03                          PIC X(45)   VALUE
               '593064112230079594055392000063595089812380125'.
           03                          PIC X(45)   VALUE
               '596059772120072597112592740118598060031980082'.
           03                          PIC X(45)   VALUE
               '599045721740049600112592740074601045721740052'.
           03                          PIC X(45)   VALUE
               '602073912150099603052981850065604088672400081'.
           03                          PIC X(45)   VALUE
               '605065662250049606086942340096607057702000056'.
           03                          PIC X(45)   VALUE
               '614107202890094615107202890040616152723870201'.
           03                          PIC X(45)   VALUE
               '617106593080115618076892230083619144223400118'.
           03                          PIC X(45)   VALUE
               '620095562770049621045721740028622126993450194'.
           03                          PIC X(45)   VALUE
               '623098362990110624060031980066625162273450113'.
           03                          PIC X(45)   VALUE
               '626107202890043627107202890020628136073490162'.
           03                          PIC X(45)   VALUE
               '629107202890112630107202890061637093512640087'.
           03                          PIC X(45)   VALUE
               '638074522370058639060031980040640081812250073'.
           03                          PIC X(45)   VALUE
               '641061202010053642060031980067643096172420109'.
           03                          PIC X(45)   VALUE
               '644060031980074645045721740052653162273450238'.
           03                          PIC X(45)   VALUE
               '654076892230130655076892230087656112592740147'.
           03                          PIC X(45)   VALUE
               '657060031980081658045721740046659162273450167'.
           03                          PIC X(45)   VALUE
               '660076892230091661076892230042662076892230171'.
           03                          PIC X(45)   VALUE
               '663076892230086664045721740032665112592740190'.
           03                          PIC X(45)   VALUE
               '666096782450103667076892230039668162273450145'.
           03                          PIC X(45)   VALUE
               '669112592740066670112592740036671076892230093'.
           03                          PIC X(45)   VALUE
               '672076892230035673136643190165674096782450115'.
           03                          PIC X(45)   VALUE
               '675076892230041682091732310101683068822050069'.
           03                          PIC X(45)   VALUE
               '684045721740046685112592740053686112592740119'.
           03                          PIC X(45)   VALUE
               '687060031980076688045721740041689068762150081'.
           03                          PIC X(45)   VALUE
               '690050971820058691112592740061692060031980030'.
           03                          PIC X(45)   VALUE
               '693112592740086694060031980037695112592740088'.
           03                          PIC X(45)   VALUE
               '696045721740048697045721740051698085962320101'.
           03                          PIC X(45)   VALUE
               '699064162050068700064162050050707096782450063'.
           03                          PIC X(45)   VALUE
               '708076892230023709112592740100710112592740027'.
           03                          PIC X(45)   VALUE
               '711162273450129712162273450048713096782450072'.
           03                          PIC X(45)   VALUE
               '714076892230029715060031980131716045721740026'.
           03                          PIC X(45)   VALUE
               '717112592740107718076892230045722060031980117'.
           03                          PIC X(45)   VALUE
               '723060031980080724060031980037725060031980088'.
           03                          PIC X(45)   VALUE
               '726060031980053727081212190099728060162030059'.
           03                          PIC X(45)   VALUE
               '729078202280079730060031980043734076892230109'.
           03                          PIC X(45)   VALUE
               '735076892230034736076892230186737076892230094'.
           03                          PIC X(45)   VALUE
               '738076892230050739136073490141740107202890064'.
           03                          PIC X(45)   VALUE
               '741107202890031742076892230061743076892230028'.
           03                          PIC X(45)   VALUE
               '744076892230088745076892230035746112592740068'.
           03                          PIC X(45)   VALUE
               '747076892230027748076892230025749076892230140'.
           03                          PIC X(45)   VALUE
               '750076892230044754112592740139755076892230080'.
           03                          PIC X(45)   VALUE
               '756045721740041757070392180114758070332280081'.
           03                          PIC X(45)   VALUE
               '759070332280059760162273450055761162273450033'.
           03                          PIC X(45)   VALUE
               '765076892230067766076892230041767076892230048'.
           03                          PIC X(45)   VALUE
               '768076892230043769076892230101770076892230030'.
           03                          PIC X(45)   VALUE
               '774076892230042775076892230031776112592740052'.
           03                          PIC X(45)   VALUE
               '777112592740030778112592740041779112592740026'.
           03                          PIC X(45)   VALUE
               '780112592740018781045721740060782112592740034'.
           03                          PIC X(45)   VALUE
               '789112592740010790112592740010791112592740010'.
           03                          PIC X(45)   VALUE
               '792112592740010793112592740010794112592740010'.
           03                          PIC X(45)   VALUE
               '795112592740010799144223400208800095562770108'.
           03                          PIC X(45)   VALUE
               '801045721740054802112592740168803076892230100'.
           03                          PIC X(45)   VALUE
               '804076892230047808087662050130809060031980075'.
           03                          PIC X(45)   VALUE
               '810055741970052811082312180077812055741970053'.
           03                          PIC X(45)   VALUE
               '813076071910079814076892230109815045721740067'.
           03                          PIC X(45)   VALUE
               '816045721740045820076892230186821076892230115'.
           03                          PIC X(45)   VALUE
               '822045721740044823112592740228824076892230127'.
           03                          PIC X(45)   VALUE
               '825076892230064826112592740226827076892230109'.
           03                          PIC X(45)   VALUE
               '828076892230052829112592740170830076892230049'.
           03                          PIC X(45)   VALUE
               '834076892230186835060031980120836060031980067'.
           03                          PIC X(45)   VALUE
               '837162273450288838162273450149839060031980079'.
           03                          PIC X(45)   VALUE
               '840097932080173841060031980103842045721740065'.
           03                          PIC X(45)   VALUE
               '843076892230119844045721740085845045721740059'.
           03                          PIC X(45)   VALUE
               '846124442660131847110062600055848076892230048'.
           03                          PIC X(45)   VALUE
               '849091532200094853176133730233854091972780131'.
           03                          PIC X(45)   VALUE
               '855060031980080856154603530214857103343010111'.
           03                          PIC X(45)   VALUE
               '858076892230074862100782530118863072922310071'.
           03                          PIC X(45)   VALUE
               '864060031980055865073062030110866073062030054'.
           03                          PIC X(45)   VALUE
               '867107042340149868071142100078869071142100055'.
           03                          PIC X(45)   VALUE
               '870212543070217871088132280111872059511960075'.
           03                          PIC X(45)   VALUE
               '876112592740201880045721740045881045721740070'.
           03                          PIC X(45)   VALUE
               '882039422290071883044632430121884040432230086'.
           03                          PIC X(45)   VALUE
               '885047352260117886045721740106887045721740068'.
           03                          PIC X(45)   VALUE
               '894045721740044895043892560190896060031980104'.
           03                          PIC X(45)   VALUE
               '897040802360061901144603430229902098913020106'.
           03                          PIC X(45)   VALUE
               '903045721740067904137863500176905137863500068'.
           03                          PIC X(45)   VALUE
               '906045721740054907152153420178908096032850094'.
           03                          PIC X(45)   VALUE
               '909058472020050913085932280079914058472020047'.
           03                          PIC X(45)   VALUE
               '915045721740080916045721740031917076892230077'.
           03                          PIC X(45)   VALUE
               '918045721740042919113622690098920074972260063'.
           03                          PIC X(45)   VALUE
               '921050001760043922076892230091923076892230044'.
           03                          PIC X(45)   VALUE
               '927112592740228928112592740228929112592740121'.
           03                          PIC X(45)   VALUE
               '933076892230081934071852360101935072142310076'.
           03                          PIC X(45)   VALUE
               '939131183210166940087012840087941060031980043'.
           03                          PIC X(45)   VALUE
               '945062922080158946039251820111947079032140076'.
           03                          PIC X(45)   VALUE
               '948049152000051949072862200063950040101610050'.
           03                          PIC X(45)   VALUE
               '951118072960064955162273450187956162273450124'.
           03                          PIC X(45)   VALUE
               '957162273450253958076892230140959076892230086'.
           03                          PIC X(45)   VALUE
               '963112592740142964076892230079965076892230056'.
           03                          PIC X(45)   VALUE
               '969165023290274970076892230120974102672230154'.
           03                          PIC X(45)   VALUE
               '975053761690096976053761690066977062552110076'.
           03                          PIC X(45)   VALUE
               '981212973890213982106913070125983076892230061'.
           03                          PIC X(45)   VALUE
               '984162273450204985076892230122986076892230046'.
           03                          PIC X(45)   VALUE
               '987165163660185988107812930107989060031980048'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 741 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
               05  WWM-IPTHRESH        PIC 9(3)V9(1).
