       01  W-DRG-FILLS.
           03                          PIC X(45)   VALUE
               '001168353710161002168353710071003168353710201'.
           03                          PIC X(45)   VALUE
               '006041751700048007120523610158008055942100042'.
           03                          PIC X(45)   VALUE
               '009104243400097010069712210096011055942100057'.
           03                          PIC X(45)   VALUE
               '012067882510084013060032310074014067722490086'.
           03                          PIC X(45)   VALUE
               '015077052610064016069782310101017055942100047'.
           03                          PIC X(45)   VALUE
               '018075032540082019045121950053021078192390099'.
           03                          PIC X(45)   VALUE
               '022078192390079023101182940061026055942100062'.
           03                          PIC X(45)   VALUE
               '027099783060076028079832580091029041751700050'.
           03                          PIC X(45)   VALUE
               '030041751700020031041751700062032041751700034'.
           03                          PIC X(45)   VALUE
               '033041751700016034070292340074035050802110047'.
           03                          PIC X(45)   VALUE
               '036055942100027037055942100066038055942100043'.
           03                          PIC X(45)   VALUE
               '039055942100031040055942100067041055942100016'.
           03                          PIC X(45)   VALUE
               '042055942100037043041751700046044078192390074'.
           03                          PIC X(45)   VALUE
               '045041751700046046055942100066047041751700047'.
           03                          PIC X(45)   VALUE
               '048041751700029049116252950071050116252950026'.
           03                          PIC X(45)   VALUE
               '051116252950040052116252950021053116252950062'.
           03                          PIC X(45)   VALUE
               '054116252950032055116252950043056116252950041'.
           03                          PIC X(45)   VALUE
               '057041751700049058041751700015059041751700036'.
           03                          PIC X(45)   VALUE
               '060041751700027061041751700102062041751700023'.
           03                          PIC X(45)   VALUE
               '063116252950072064117972620102065041751700042'.
           03                          PIC X(45)   VALUE
               '066041751700048067078192390058068062112030059'.
           03                          PIC X(45)   VALUE
               '069041751700045070041751700036071055942100067'.
           03                          PIC X(45)   VALUE
               '072078192390052073077452290069074041751700039'.
           03                          PIC X(45)   VALUE
               '075199443350154076239824250172077055942100074'.
           03                          PIC X(45)   VALUE
               '078067462260094079081822280129080064852090083'.
           03                          PIC X(45)   VALUE
               '081041751700101082082422140110083041751700082'.
           03                          PIC X(45)   VALUE
               '084041751700048085069562140099086041751700055'.
           03                          PIC X(45)   VALUE
               '087102952480103088064111930075089068022060086'.
           03                          PIC X(45)   VALUE
               '090049581780056091055942100053092066381960094'.
           03                          PIC X(45)   VALUE
               '093041751700059094067852130096095067852130053'.
           03                          PIC X(45)   VALUE
               '096062301890067097062301890052098055942100044'.
           03                          PIC X(45)   VALUE
               '099093812460048100078192390031101081472220067'.
           03                          PIC X(45)   VALUE
               '102041751700039104116252950223105116252950150'.
           03                          PIC X(45)   VALUE
               '106116252950166108116252950171110116252950138'.
           03                          PIC X(45)   VALUE
               '111116252950049113139423610205114124253300140'.
           03                          PIC X(45)   VALUE
               '117055942100067118078192390046119078192390088'.
           03                          PIC X(45)   VALUE
               '120108933140155121074512240101122055942100053'.
           03                          PIC X(45)   VALUE
               '123078581700076124116252950070125041751700041'.
           03                          PIC X(45)   VALUE
               '126088672630175127068322120080128055942100080'.
           03                          PIC X(45)   VALUE
               '129041751700035130064842280086131052672100059'.
           03                          PIC X(45)   VALUE
               '132066212070043133055942100032134049092170048'.
           03                          PIC X(45)   VALUE
               '135080142380068136041751700041137041751700033'.
           03                          PIC X(45)   VALUE
               '138066182190061139055942100037140041751700036'.
           03                          PIC X(45)   VALUE
               '141058912210053142058912210038143041751700031'.
           03                          PIC X(45)   VALUE
               '144077152210096145042921700039146168353710146'.
           03                          PIC X(45)   VALUE
               '147078192390085149078192390081150168353710173'.
           03                          PIC X(45)   VALUE
               '151041751700082152168353710120153168353710071'.
           03                          PIC X(45)   VALUE
               '155168353710064156168353710121157078192390093'.
           03                          PIC X(45)   VALUE
               '158078192390041159168353710082160041751700041'.
           03                          PIC X(45)   VALUE
               '161041751700073162041751700031163041751700040'.
           03                          PIC X(45)   VALUE
               '164078192390119165078192390061166078192390068'.
           03                          PIC X(45)   VALUE
               '167078192390031168168353710077169055942100035'.
           03                          PIC X(45)   VALUE
               '170161633580180171078192390067172084972180111'.
           03                          PIC X(45)   VALUE
               '173055942100056174071492290072175055942100043'.
           03                          PIC X(45)   VALUE
               '176095142480080177055942100068178041751700047'.
           03                          PIC X(45)   VALUE
               '179081572330091180091262280083181041751700051'.
           03                          PIC X(45)   VALUE
               '182078662180064183041751700044184041751700056'.
           03                          PIC X(45)   VALUE
               '185066342320072186055942100050187055942100068'.
           03                          PIC X(45)   VALUE
               '188095962440085189055942100046190055942100051'.
           03                          PIC X(45)   VALUE
               '191168353710211192168353710093193116252950197'.
           03                          PIC X(45)   VALUE
               '194116252950099195168353710162196116252950083'.
           03                          PIC X(45)   VALUE
               '197116252950140198116252950066199078192390152'.
           03                          PIC X(45)   VALUE
               '200168353710175201158022880226202060112020099'.
           03                          PIC X(45)   VALUE
               '203074661960106204088532210085205069332310094'.
           03                          PIC X(45)   VALUE
               '206069332310060207072952150084208041751700046'.
           03                          PIC X(45)   VALUE
               '210148264190095211168353710063212168353710038'.
           03                          PIC X(45)   VALUE
               '213118713350152216121473760088217124143650204'.
           03                          PIC X(45)   VALUE
               '218168353710084219168353710048220168353710105'.
           03                          PIC X(45)   VALUE
               '223116252950051224041751700028225095503060087'.
           03                          PIC X(45)   VALUE
               '226106263430106227078192390040228078192390067'.
           03                          PIC X(45)   VALUE
               '229041751700038230168353710088232168353710041'.
           03                          PIC X(45)   VALUE
               '233117243240108234041751700041235078192390074'.
           03                          PIC X(45)   VALUE
               '236068022890068237041751700059238085892840128'.
           03                          PIC X(45)   VALUE
               '239060312060096240071342240103241041751700056'.
           03                          PIC X(45)   VALUE
               '242077002620102243060282230071244055162200070'.
           03                          PIC X(45)   VALUE
               '245044631940048246055942100056247045821760051'.
           03                          PIC X(45)   VALUE
               '248073282320075249063702400062250041751700060'.
           03                          PIC X(45)   VALUE
               '251041751700043252055942100018253056092400070'.
           03                          PIC X(45)   VALUE
               '254041751700047255055942100029256071322360079'.
           03                          PIC X(45)   VALUE
               '257168353710038258078192390024259078192390041'.
           03                          PIC X(45)   VALUE
               '260078192390019261055942100032262116252950077'.
           03                          PIC X(45)   VALUE
               '263127483800169264085072990099265110193020107'.
           03                          PIC X(45)   VALUE
               '266078192390047267078192390068268116252950054'.
           03                          PIC X(45)   VALUE
               '269120753470134270078192390057271082692690107'.
           03                          PIC X(45)   VALUE
               '272065842300093273041751700059274072312180101'.
           03                          PIC X(45)   VALUE
               '275078192390052276055942100073277060892090084'.
           03                          PIC X(45)   VALUE
               '278042541800061279041751700058280071482410063'.
           03                          PIC X(45)   VALUE
               '281055942100043282055942100022283068762310072'.
           03                          PIC X(45)   VALUE
               '284055942100046285124183160160286116252950080'.
           03                          PIC X(45)   VALUE
               '287104023300152288116252950054289116252950033'.
           03                          PIC X(45)   VALUE
               '290116252950028291116252950021292115493200169'.
           03                          PIC X(45)   VALUE
               '293115493200078294069582390067295055942100057'.
           03                          PIC X(45)   VALUE
               '296070922230073297045961930046298041751700053'.
           03                          PIC X(45)   VALUE
               '299078192390082300070042370093301055942100052'.
           03                          PIC X(45)   VALUE
               '303078192390097304116252950134305078192390047'.
           03                          PIC X(45)   VALUE
               '306116252950091307116252950029308116252950086'.
           03                          PIC X(45)   VALUE
               '309116252950024310116252950072311116252950027'.
           03                          PIC X(45)   VALUE
               '312078192390080313078192390036314078192393604'.
           03                          PIC X(45)   VALUE
               '315140163390111316083212290099317091022440054'.
           03                          PIC X(45)   VALUE
               '318075652100098319078192390039320062002170077'.
           03                          PIC X(45)   VALUE
               '321044501850054322041751700052323041751700048'.
           03                          PIC X(45)   VALUE
               '324041751700027325055942100058326041751700039'.
           03                          PIC X(45)   VALUE
               '327041751700028328055942100054329055942100024'.
           03                          PIC X(45)   VALUE
               '330055942100016331077732250087332041751700048'.
           03                          PIC X(45)   VALUE
               '333041751700084334041751700061335041751700037'.
           03                          PIC X(45)   VALUE
               '336116252950049337116252950026338078192390097'.
           03                          PIC X(45)   VALUE
               '339078192390084340078192390024341168353710044'.
           03                          PIC X(45)   VALUE
               '342078192390046343078192390017344078192390039'.
           03                          PIC X(45)   VALUE
               '345116252950086346078192390096347041751700042'.
           03                          PIC X(45)   VALUE
               '348055942100063349078192390041350056062100070'.
           03                          PIC X(45)   VALUE
               '351078192390013352082092750067353116252950092'.
           03                          PIC X(45)   VALUE
               '354116252950082355116252950042356116252950027'.
           03                          PIC X(45)   VALUE
               '357116252950123358116252950057359116252950033'.
           03                          PIC X(45)   VALUE
               '360116252950037361041751700045362041751700010'.
           03                          PIC X(45)   VALUE
               '363041751700065364041751700061365116252950130'.
           03                          PIC X(45)   VALUE
               '366091062160102367041751700046368078462130102'.
           03                          PIC X(45)   VALUE
               '369078192390051370041751700070371041751700045'.
           03                          PIC X(45)   VALUE
               '372041751700047373041751700030374041751700041'.
           03                          PIC X(45)   VALUE
               '375041751700110376116252950051377041751700072'.
           03                          PIC X(45)   VALUE
               '378041751700032379041751700048380041751700029'.
           03                          PIC X(45)   VALUE
               '381041751700036382041751700021383041751700056'.
           03                          PIC X(45)   VALUE
               '384041751700036385041751700018386041751700179'.
           03                          PIC X(45)   VALUE
               '387041751700133388041751700086389041751700176'.
           03                          PIC X(45)   VALUE
               '390041751700034391041751700031392116252950145'.
           03                          PIC X(45)   VALUE
               '393116252950091394116252950121395066512190065'.
           03                          PIC X(45)   VALUE
               '396041751700045397082762040082398062782080088'.
           03                          PIC X(45)   VALUE
               '399041751700051401116252950189402055942100063'.
           03                          PIC X(45)   VALUE
               '403088462390132404078192390066405078192390049'.
           03                          PIC X(45)   VALUE
               '406168353710155407116252950055408116252950140'.
           03                          PIC X(45)   VALUE
               '409084162320095410125272870058411055942100033'.
           03                          PIC X(45)   VALUE
               '412055942100021413084292140110414078192390064'.
           03                          PIC X(45)   VALUE
               '417078192390105418079612410096419055942100068'.
           03                          PIC X(45)   VALUE
               '420055942100049421070652040062422041751700056'.
           03                          PIC X(45)   VALUE
               '423104262320132424168353710197425041751700053'.
           03                          PIC X(45)   VALUE
               '426040382250068427055942100073428051832450114'.
           03                          PIC X(45)   VALUE
               '429053262400085430040242310126431055942100101'.
           03                          PIC X(45)   VALUE
               '432041751700061433041751700042439122033600136'.
           03                          PIC X(45)   VALUE
               '440122483440134441055942100052442136703490145'.
           03                          PIC X(45)   VALUE
               '443055942100056444065982320064445055942100044'.
           03                          PIC X(45)   VALUE
               '446055942100024447055942100039448055942100029'.
           03                          PIC X(45)   VALUE
               '449078192390058450055942100029451078192390144'.
           03                          PIC X(45)   VALUE
               '452092752570078453057902160042454078192390065'.
           03                          PIC X(45)   VALUE
               '455078192390034461114663270088462058232210148'.
           03                          PIC X(45)   VALUE
               '463060822290061464058312430045465068772120055'.
           03                          PIC X(45)   VALUE
               '466067002170070467078192390040468214784050214'.
           03                          PIC X(45)   VALUE
               '471168353710062473099172530214476168353710177'.
           03                          PIC X(45)   VALUE
               '477151193590148479055942100039481116252950352'.
           03                          PIC X(45)   VALUE
               '482168353710176484168353710231485116252950147'.
           03                          PIC X(45)   VALUE
               '486078192390218487116252950115488116252950296'.
           03                          PIC X(45)   VALUE
               '489094362210133490064562030085491168353710045'.
           03                          PIC X(45)   VALUE
               '492055942100231493116252950098494116252950042'.
           03                          PIC X(45)   VALUE
               '496116252950138497168353710083498168353710053'.
           03                          PIC X(45)   VALUE
               '499168353710066500116252950033501121643330154'.
           03                          PIC X(45)   VALUE
               '502078192390087503116252950061504168353710484'.
           03                          PIC X(45)   VALUE
               '505168353710094506116252950261507041751700132'.
           03                          PIC X(45)   VALUE
               '508075882560121509041751700086510067202260097'.
           03                          PIC X(45)   VALUE
               '511041751700057515116252950059518041751700037'.
           03                          PIC X(45)   VALUE
               '519116252950074520168353710028521055942100084'.
           03                          PIC X(45)   VALUE
               '522055942100167523041751700058524055942100048'.
           03                          PIC X(45)   VALUE
               '525168353710241528168353710269529168353710117'.
           03                          PIC X(45)   VALUE
               '530168353710045531168353710155532078192390059'.
           03                          PIC X(45)   VALUE
               '533116252950057534116252950025535168353710156'.
           03                          PIC X(45)   VALUE
               '536116252950117537146723990108538116252950045'.
           03                          PIC X(45)   VALUE
               '539116252950181540041751700056541388935810658'.
           03                          PIC X(45)   VALUE
               '542286894510491543168353710204544168353710061'.
           03                          PIC X(45)   VALUE
               '545168353710074546168353710134547116252950178'.
           03                          PIC X(45)   VALUE
               '548116252950120549116252950150550116252950093'.
           03                          PIC X(45)   VALUE
               '551160352950103552116252950055553158373250158'.
           03                          PIC X(45)   VALUE
               '554128173160093555078192390078556041751700029'.
           03                          PIC X(45)   VALUE
               '557116252950065558041751700026559078192390107'.
           03                          PIC X(45)   VALUE
               '560093082550169561081452230155562068442320076'.
           03                          PIC X(45)   VALUE
               '563055942100049564075652410053565205573470233'.
           03                          PIC X(45)   VALUE
               '566154452740132567168353710254568168353710192'.
           03                          PIC X(45)   VALUE
               '569168353710225570168353710149571082142190075'.
           03                          PIC X(45)   VALUE
               '572085052330110573168353710167574081061970091'.
           03                          PIC X(45)   VALUE
               '575165832780244576079252300118577116252950033'.
           03                          PIC X(30)   VALUE
               '578148493570265579129783520180'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 530 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
               05  WWM-IPTHRESH        PIC 9(3)V9(1).
