       01  W-DRG-FILLS.
           03                          PIC X(44)   VALUE
               '00345940669004297114450091244031401117291382'.
           03                          PIC X(44)   VALUE
               '01217291382013172913820201729138202117291382'.
           03                          PIC X(44)   VALUE
               '02217291382023124403140241244031402517291382'.
           03                          PIC X(44)   VALUE
               '02617291382027084912520281244031402912440314'.
           03                          PIC X(44)   VALUE
               '03012440314031172913820321729138203317291382'.
           03                          PIC X(44)   VALUE
               '03412440314035124403140361244031403712440314'.
           03                          PIC X(44)   VALUE
               '03812440314039124403140401231934804110740342'.
           03                          PIC X(44)   VALUE
               '04210740342052101233160530849125205409965267'.
           03                          PIC X(44)   VALUE
               '05506501216056079252530570597224005808491252'.
           03                          PIC X(44)   VALUE
               '05906281217060062812170610870623606205958236'.
           03                          PIC X(44)   VALUE
               '06304811195064077002450650612024006604811195'.
           03                          PIC X(44)   VALUE
               '06704811195068048111950690481119507008706236'.
           03                          PIC X(44)   VALUE
               '07105958236072048111950730880624607406043233'.
           03                          PIC X(44)   VALUE
               '07506281217076062812170771244031407806281217'.
           03                          PIC X(44)   VALUE
               '07904811195080078532920810702428208208491252'.
           03                          PIC X(44)   VALUE
               '08306281217084062812170850865226608606542241'.
           03                          PIC X(44)   VALUE
               '08704811195088048111950890481119509004811195'.
           03                          PIC X(44)   VALUE
               '09109149259092068912530930599222009410331292'.
           03                          PIC X(44)   VALUE
               '09509374285096074752760971048126309808491252'.
           03                          PIC X(44)   VALUE
               '09906281217100062992181010606025410206281217'.
           03                          PIC X(44)   VALUE
               '10306281217113084912521140849125211504811195'.
           03                          PIC X(44)   VALUE
               '11608491252117048111951210628121712206281217'.
           03                          PIC X(44)   VALUE
               '12304811195124062812171250481119512912905295'.
           03                          PIC X(44)   VALUE
               '13004811195131172913821321729138213312440314'.
           03                          PIC X(44)   VALUE
               '13412440314135048111951360481119513717291382'.
           03                          PIC X(44)   VALUE
               '13817291382139172913821461290529514710069230'.
           03                          PIC X(44)   VALUE
               '14804811195149048111951500849125215106281217'.
           03                          PIC X(44)   VALUE
               '15208491252153062812171540762622015506937211'.
           03                          PIC X(44)   VALUE
               '15606281217157062812171580628121715904811195'.
           03                          PIC X(44)   VALUE
               '16324763335164124403141650849125216624774419'.
           03                          PIC X(44)   VALUE
               '16718911366168084912521750656921917605411200'.
           03                          PIC X(44)   VALUE
               '17708748229178073262211790616319418007883209'.
           03                          PIC X(44)   VALUE
               '18106227188182062271881830481119518404811195'.
           03                          PIC X(44)   VALUE
               '18504811195186074922051870615220518806152205'.
           03                          PIC X(44)   VALUE
               '18909527240190073882051910614519419205282173'.
           03                          PIC X(44)   VALUE
               '19307613216194063012011950531817419607056201'.
           03                          PIC X(44)   VALUE
               '19705648176198049701591990773722220005840178'.
           03                          PIC X(44)   VALUE
               '20104811195202064411962030481119520408248228'.
           03                          PIC X(44)   VALUE
               '20508178224206070982152072058434620811568235'.
           03                          PIC X(44)   VALUE
               '21508491252216124403142170849125221808491252'.
           03                          PIC X(44)   VALUE
               '21912440314220084912522210849125222217291382'.
           03                          PIC X(44)   VALUE
               '22317291382224172913822251729138222617291382'.
           03                          PIC X(44)   VALUE
               '22717291382228152003422291186928823006281217'.
           03                          PIC X(44)   VALUE
               '23112440314232084912522331244031423408491252'.
           03                          PIC X(44)   VALUE
               '23512440314236084912522371244031423808491252'.
           03                          PIC X(44)   VALUE
               '23915045368240114263412410849125224217291382'.
           03                          PIC X(44)   VALUE
               '24317291382244172913822451729138224612440314'.
           03                          PIC X(44)   VALUE
               '24712440314248124403142491244031425017291382'.
           03                          PIC X(44)   VALUE
               '25117291382252152003422531186928825406281217'.
           03                          PIC X(44)   VALUE
               '25512448338256093243002570481119525812440314'.
           03                          PIC X(44)   VALUE
               '25912440314260124403142610849125226208491252'.
           03                          PIC X(44)   VALUE
               '26304811195264107883102651244031428007751230'.
           03                          PIC X(44)   VALUE
               '28105724208282050071992830801815928408018159'.
           03                          PIC X(44)   VALUE
               '28508018159286124403142870849125228809942261'.
           03                          PIC X(44)   VALUE
               '28907787261290068012432910765322029206229212'.
           03                          PIC X(44)   VALUE
               '29305114188294062812172950628121729608018159'.
           03                          PIC X(44)   VALUE
               '29708018159298080181592990772123430005759220'.
           03                          PIC X(44)   VALUE
               '30105326203302075192183030563220130404811195'.
           03                          PIC X(44)   VALUE
               '30504811195306081442273070729822930808371251'.
           03                          PIC X(44)   VALUE
               '30905671211310045401943110481119531205049197'.
           03                          PIC X(44)   VALUE
               '31304811195314086902303150648321031605963210'.
           03                          PIC X(44)   VALUE
               '32617291382327172913823281729138232922372418'.
           03                          PIC X(44)   VALUE
               '33017291382331172913823321656434333311576300'.
           03                          PIC X(44)   VALUE
               '33411576300335172913823361729138233717291382'.
           03                          PIC X(44)   VALUE
               '33809559251339076672323400588619634109559251'.
           03                          PIC X(44)   VALUE
               '34207667232343058861963441729138234517291382'.
           03                          PIC X(44)   VALUE
               '34617291382347172913823481244031434912440314'.
           03                          PIC X(44)   VALUE
               '35012440314351124403143521244031435317291382'.
           03                          PIC X(44)   VALUE
               '35406281217355062812173561656434335711576300'.
           03                          PIC X(44)   VALUE
               '35811576300368090682113690849125237008491252'.
           03                          PIC X(44)   VALUE
               '37109559251372076672323730588619637408959217'.
           03                          PIC X(44)   VALUE
               '37507739234376062812173770811123837806834238'.
           03                          PIC X(44)   VALUE
               '37906281217380084912523810628121738204811195'.
           03                          PIC X(44)   VALUE
               '38308491252384084912523850797923338607063231'.
           03                          PIC X(44)   VALUE
               '38704811195388094522253890723020939006281217'.
           03                          PIC X(44)   VALUE
               '39107853220392064902093931056825739407815227'.
           03                          PIC X(44)   VALUE
               '39505719221405124403144061244031440712440314'.
           03                          PIC X(44)   VALUE
               '40806281217409062812174100628121741117291382'.
           03                          PIC X(44)   VALUE
               '41217291382413172913824141729138241517291382'.
           03                          PIC X(44)   VALUE
               '41617291382417172913824181729138241917291382'.
           03                          PIC X(44)   VALUE
               '42008491252421084912524220849125242317291382'.
           03                          PIC X(44)   VALUE
               '42408491252425084912524320690820943306281217'.
           03                          PIC X(44)   VALUE
               '43406281217435081332174360486917243704811195'.
           03                          PIC X(44)   VALUE
               '43810686234439074992214400628121744108104231'.
           03                          PIC X(44)   VALUE
               '44207053217443048111954440824322744506025213'.
           03                          PIC X(44)   VALUE
               '44606025213453172913824541729138245517291382'.
           03                          PIC X(44)   VALUE
               '45617291382457172913824581729138245917291382'.
           03                          PIC X(44)   VALUE
               '46017291382461172913824620849125246314027388'.
           03                          PIC X(44)   VALUE
               '46410519340465097363394661244031446712440314'.
           03                          PIC X(44)   VALUE
               '46804811195469172913824701729138247108491252'.
           03                          PIC X(44)   VALUE
               '47208491252473084912524741550338447511015339'.
           03                          PIC X(44)   VALUE
               '47608491252477172913824781244031447912440314'.
           03                          PIC X(44)   VALUE
               '48017291382481124403144820849125248317291382'.
           03                          PIC X(44)   VALUE
               '48408491252485124403144861244031448712440314'.
           03                          PIC X(44)   VALUE
               '48817291382489062812174901244031449112440314'.
           03                          PIC X(44)   VALUE
               '49212440314493124403144940849125249511915350'.
           03                          PIC X(44)   VALUE
               '49611915350497119153504981729138249917291382'.
           03                          PIC X(44)   VALUE
               '50013301367501109393355020849125250312440314'.
           03                          PIC X(44)   VALUE
               '50408491252505084912525061244031450717291382'.
           03                          PIC X(44)   VALUE
               '50817291382509084912525100849125251108491252'.
           03                          PIC X(44)   VALUE
               '51208491252513124403145141244031451513548316'.
           03                          PIC X(44)   VALUE
               '51609050280517090502805330628121753406281217'.
           03                          PIC X(44)   VALUE
               '53508491252536060592695370481119553804811195'.
           03                          PIC X(44)   VALUE
               '53909845303540075882775410684327254208491252'.
           03                          PIC X(44)   VALUE
               '54305614205544048111955450899023554608394255'.
           03                          PIC X(44)   VALUE
               '54704811195548089432635490698626755006012242'.
           03                          PIC X(44)   VALUE
               '55108866266552059952415530628121755404962213'.
           03                          PIC X(44)   VALUE
               '55508491252556048111955570874425455806443230'.
           03                          PIC X(44)   VALUE
               '55908049261560064012475610551122856208491252'.
           03                          PIC X(44)   VALUE
               '56304811195564087332435650641322756606153225'.
           03                          PIC X(44)   VALUE
               '57313856383574107253615750893430157617714376'.
           03                          PIC X(44)   VALUE
               '57708008273578062812175791367536758010404335'.
           03                          PIC X(44)   VALUE
               '58107968301582172913825831729138258406281217'.
           03                          PIC X(44)   VALUE
               '58506281217592093782705930709626259406031247'.
           03                          PIC X(44)   VALUE
               '59508038253596064602245971244031459808491252'.
           03                          PIC X(44)   VALUE
               '59908491252600084912526010481119560206883217'.
           03                          PIC X(44)   VALUE
               '60305268199604081512446050598923860608198245'.
           03                          PIC X(44)   VALUE
               '60705537207614103793266150849125261614615384'.
           03                          PIC X(44)   VALUE
               '61711333331618048111956191729138262017291382'.
           03                          PIC X(44)   VALUE
               '62117291382622131203626231004831162406281217'.
           03                          PIC X(44)   VALUE
               '62512440314626084912526270849125262813619323'.
           03                          PIC X(44)   VALUE
               '62910379326630084912526370917026663806892245'.
           03                          PIC X(44)   VALUE
               '63905743208640083332326410616221564204811195'.
           03                          PIC X(44)   VALUE
               '64306770240644053372116450481119565317291382'.
           03                          PIC X(44)   VALUE
               '65417291382655172913826561729138265717291382'.
           03                          PIC X(44)   VALUE
               '65817291382659124403146601244031466106281217'.
           03                          PIC X(44)   VALUE
               '66217291382663062812176640628121766508491252'.
           03                          PIC X(44)   VALUE
               '66608491252667084912526680849125266906281217'.
           03                          PIC X(44)   VALUE
               '67006281217671062812176720628121767314321340'.
           03                          PIC X(44)   VALUE
               '67411314291675113142916820888123868307436229'.
           03                          PIC X(44)   VALUE
               '68406572206685082582516860849125268708491252'.
           03                          PIC X(44)   VALUE
               '68806281217689066642266900521320569104811195'.
           03                          PIC X(44)   VALUE
               '69204811195693084912526940481119569512440314'.
           03                          PIC X(44)   VALUE
               '69606281217697062812176980949423669906517219'.
           03                          PIC X(44)   VALUE
               '70005613210707124403147080628121770917291382'.
           03                          PIC X(44)   VALUE
               '71017291382711124403147121244031471317291382'.
           03                          PIC X(44)   VALUE
               '71417291382715124403147161244031471712440314'.
           03                          PIC X(44)   VALUE
               '71812440314722062812177230628121772406281217'.
           03                          PIC X(44)   VALUE
               '72508491252726048111957270785823172805215202'.
           03                          PIC X(44)   VALUE
               '72908865259730048111957341244031473512440314'.
           03                          PIC X(44)   VALUE
               '73612440314737084912527380481119573912440314'.
           03                          PIC X(44)   VALUE
               '74012440314741124403147420849125274304811195'.
           03                          PIC X(44)   VALUE
               '74408491252745084912527461729138274717291382'.
           03                          PIC X(44)   VALUE
               '74812440314749124403147501244031475412440314'.
           03                          PIC X(44)   VALUE
               '75508491252756048111957570773324075807733240'.
           03                          PIC X(44)   VALUE
               '75907733240760084912527610849125276508491252'.
           03                          PIC X(44)   VALUE
               '76608491252767084912527680849125276908491252'.
           03                          PIC X(44)   VALUE
               '77008491252774084912527750849125277608491252'.
           03                          PIC X(44)   VALUE
               '77708491252778077332407790773324078007733240'.
           03                          PIC X(44)   VALUE
               '78104811195782048111957890481119579004811195'.
           03                          PIC X(44)   VALUE
               '79104811195792048111957930481119579404811195'.
           03                          PIC X(44)   VALUE
               '79504811195799084912528000849125280108491252'.
           03                          PIC X(44)   VALUE
               '80212440314803124403148041244031480812440314'.
           03                          PIC X(44)   VALUE
               '80908491252810048111958110792523181205272204'.
           03                          PIC X(44)   VALUE
               '81308311232814084912528150628121781604811195'.
           03                          PIC X(44)   VALUE
               '82012440314821084912528220849125282312440314'.
           03                          PIC X(44)   VALUE
               '82408491252825084912528261729138282717291382'.
           03                          PIC X(44)   VALUE
               '82817291382829172913828301729138283408491252'.
           03                          PIC X(44)   VALUE
               '83508491252836084912528371729138283817291382'.
           03                          PIC X(44)   VALUE
               '83917291382840091352318410715919784206281217'.
           03                          PIC X(44)   VALUE
               '84308491252844062812178450628121784614611300'.
           03                          PIC X(44)   VALUE
               '84710744238848107442388490787821685317691373'.
           03                          PIC X(44)   VALUE
               '85411402330855114023308561545436885710591327'.
           03                          PIC X(44)   VALUE
               '85808833268862095322538630697124086404811195'.
           03                          PIC X(44)   VALUE
               '86507928222866062812178671118123386807342226'.
           03                          PIC X(44)   VALUE
               '86904811195870220833318710862523487206514218'.
           03                          PIC X(44)   VALUE
               '87606281217880048111958810628121788204811195'.
           03                          PIC X(44)   VALUE
               '88308491252884051192558850415323888604811195'.
           03                          PIC X(44)   VALUE
               '88706281217894062812178950481119589612440314'.
           03                          PIC X(44)   VALUE
               '89704811195901149713599021044430190308491252'.
           03                          PIC X(44)   VALUE
               '90413240356905084912529061729138290716121375'.
           03                          PIC X(44)   VALUE
               '90811164341909111643419130760325191406102222'.
           03                          PIC X(44)   VALUE
               '91504811195916048111959170481119591804811195'.
           03                          PIC X(44)   VALUE
               '91910831269920084942609210610820292208491252'.
           03                          PIC X(44)   VALUE
               '92306281217927172913829281244031492906281217'.
           03                          PIC X(44)   VALUE
               '93312440314934076412429350774624593913259337'.
           03                          PIC X(44)   VALUE
               '94009894306941084912529450607222194604261189'.
           03                          PIC X(44)   VALUE
               '94706412221948056852219490696222595004952192'.
           03                          PIC X(44)   VALUE
               '95113205279955172913829560849125295712440314'.
           03                          PIC X(44)   VALUE
               '95804811195959048111959630849125296406281217'.
           03                          PIC X(44)   VALUE
               '96504811195969124403149701244031497409948219'.
           03                          PIC X(44)   VALUE
               '97506370183976062812179770682219098123267431'.
           03                          PIC X(44)   VALUE
               '98214598355983114973199841244031498512440314'.
           03                          PIC X(44)   VALUE
               '98612440314987176253679881147433998908491252'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 736 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
