       01  W-DRG-FILLS.
           03                          PIC X(44)   VALUE
               '00120841400002208414000032084140000604964185'.
           03                          PIC X(44)   VALUE
               '00715754410008157544100091502532901007549234'.
           03                          PIC X(44)   VALUE
               '01107281220012074852580130753025901409196274'.
           03                          PIC X(44)   VALUE
               '01508714288016091252390170526220401808225239'.
           03                          PIC X(44)   VALUE
               '01906236227020100972480210737223502207372235'.
           03                          PIC X(44)   VALUE
               '02309033288024085272620250772724102607372235'.
           03                          PIC X(44)   VALUE
               '02711929304028102112900290905626603009562261'.
           03                          PIC X(44)   VALUE
               '03109562261032095622610330737223503409140278'.
           03                          PIC X(44)   VALUE
               '03506651245036049641850370496418503804964185'.
           03                          PIC X(44)   VALUE
               '03904964185040208414000410496418504204964185'.
           03                          PIC X(44)   VALUE
               '04304964185044049641850450496418504604964185'.
           03                          PIC X(44)   VALUE
               '04704964185048049641850491356932505009562261'.
           03                          PIC X(44)   VALUE
               '05109562261052095622610530737223505409562261'.
           03                          PIC X(44)   VALUE
               '05509562261056073722350570956226105809562261'.
           03                          PIC X(44)   VALUE
               '05909562261060095622610610737223506209562261'.
           03                          PIC X(44)   VALUE
               '06309562261064125402750650496418506604964185'.
           03                          PIC X(44)   VALUE
               '06709562261068082432190690496418507004964185'.
           03                          PIC X(44)   VALUE
               '07104964185072073722350730721520307404964185'.
           03                          PIC X(44)   VALUE
               '07520841400076243824390772084140007808896242'.
           03                          PIC X(44)   VALUE
               '07908985226080076452230810496418508207480203'.
           03                          PIC X(44)   VALUE
               '08309562261084073722350850851423508606540224'.
           03                          PIC X(44)   VALUE
               '08716513319088076532070890842823109007318217'.
           03                          PIC X(44)   VALUE
               '09107372235092077022040930496418509406571189'.
           03                          PIC X(44)   VALUE
               '09504964185096073812050970529618709804964185'.
           03                          PIC X(44)   VALUE
               '09910622266100105792611010900922610207011210'.
           03                          PIC X(44)   VALUE
               '10420841400105208414001062084140010720841400'.
           03                          PIC X(44)   VALUE
               '10820841400109208414001102084140011120841400'.
           03                          PIC X(44)   VALUE
               '11315629387114136043831152084140011620841400'.
           03                          PIC X(44)   VALUE
               '11709562261118208414001191356932512012435344'.
           03                          PIC X(44)   VALUE
               '12107467221122064401881230852718812413569325'.
           03                          PIC X(44)   VALUE
               '12513569325126087062561270771922112807372235'.
           03                          PIC X(44)   VALUE
               '12909562261130077122441310639823113208092224'.
           03                          PIC X(44)   VALUE
               '13307044219134091542791350903923113607186224'.
           03                          PIC X(44)   VALUE
               '13707372235138074302271390603220314006094193'.
           03                          PIC X(44)   VALUE
               '14106453229142050412031430731421814407921222'.
           03                          PIC X(44)   VALUE
               '14506983207146208414001472084140014820841400'.
           03                          PIC X(44)   VALUE
               '14904964185150135693251511356932515213569325'.
           03                          PIC X(44)   VALUE
               '15313569325154208414001551356932515613569325'.
           03                          PIC X(44)   VALUE
               '15713569325158095622611591356932516013569325'.
           03                          PIC X(44)   VALUE
               '16113569325162049641851630496418516420841400'.
           03                          PIC X(44)   VALUE
               '16504964185166208414001670496418516820841400'.
           03                          PIC X(44)   VALUE
               '16907372235170170064031711356932517208702225'.
           03                          PIC X(44)   VALUE
               '17307092202174078742371750634521117607728212'.
           03                          PIC X(44)   VALUE
               '17707372235178049641851791002325218008222229'.
           03                          PIC X(44)   VALUE
               '18108222229182084492351830636220318407372235'.
           03                          PIC X(44)   VALUE
               '18507372235186073722351870737223518810308253'.
           03                          PIC X(44)   VALUE
               '18907826218190073722351911356932519204964185'.
           03                          PIC X(44)   VALUE
               '19307372235194073722351951356932519609562261'.
           03                          PIC X(44)   VALUE
               '19709562261198095622611990737223520007372235'.
           03                          PIC X(44)   VALUE
               '20120841400202072542232030675818920409986234'.
           03                          PIC X(44)   VALUE
               '20507029221206070292212070667120520806671205'.
           03                          PIC X(44)   VALUE
               '20913569325210135693252110737223521207372235'.
           03                          PIC X(44)   VALUE
               '21313851338216135693252171403839321809562261'.
           03                          PIC X(44)   VALUE
               '21909562261220095622612230956226122409562261'.
           03                          PIC X(44)   VALUE
               '22509562261226135693252271356932522813569325'.
           03                          PIC X(44)   VALUE
               '22909562261230135693252320737223523309562261'.
           03                          PIC X(44)   VALUE
               '23409562261235083962962360736827123707372235'.
           03                          PIC X(44)   VALUE
               '23808432279239066102202400668521224104538187'.
           03                          PIC X(44)   VALUE
               '24207721264243066162322440556320024504721185'.
           03                          PIC X(44)   VALUE
               '24605128222247055362022480727424524907829270'.
           03                          PIC X(44)   VALUE
               '25008206299251060092732520956226125308176276'.
           03                          PIC X(44)   VALUE
               '25406691251255095622612560829425925709562261'.
           03                          PIC X(44)   VALUE
               '25809562261259095622612600956226126120841400'.
           03                          PIC X(44)   VALUE
               '26209562261263145224242641289244126512215348'.
           03                          PIC X(44)   VALUE
               '26612215348267095622612682084140026914466430'.
           03                          PIC X(44)   VALUE
               '27009916339271096203042720712122827304964185'.
           03                          PIC X(44)   VALUE
               '27409072249275073722352760496418527707409236'.
           03                          PIC X(44)   VALUE
               '27805982207279095622612800972429528107386264'.
           03                          PIC X(44)   VALUE
               '28207372235283065081932840496418528515176374'.
           03                          PIC X(44)   VALUE
               '28607372235287139823972882084140028907372235'.
           03                          PIC X(44)   VALUE
               '29007372235291073722352921356932529309562261'.
           03                          PIC X(44)   VALUE
               '29408061259295095622612960820724129706524245'.
           03                          PIC X(44)   VALUE
               '29807372235299095622613000770422330107372235'.
           03                          PIC X(44)   VALUE
               '30320841400304208414003050496418530613569325'.
           03                          PIC X(44)   VALUE
               '30713569325308135693253090737223531013569325'.
           03                          PIC X(44)   VALUE
               '31104964185312135693253130496418531404964185'.
           03                          PIC X(44)   VALUE
               '31515070368316092142383170956226131807048211'.
           03                          PIC X(44)   VALUE
               '31904964185320072232303210626023232204964185'.
           03                          PIC X(44)   VALUE
               '32307372235324073722353250956226132604964185'.
           03                          PIC X(44)   VALUE
               '32704964185328049641853290496418533004964185'.
           03                          PIC X(44)   VALUE
               '33108473232332057222113330496418533420841400'.
           03                          PIC X(44)   VALUE
               '33520841400336073722353370737223533807372235'.
           03                          PIC X(44)   VALUE
               '33907372235340073722353410737223534204964185'.
           03                          PIC X(44)   VALUE
               '34307372235344049641853452084140034607150223'.
           03                          PIC X(44)   VALUE
               '34707150223348049641853490496418535011820266'.
           03                          PIC X(44)   VALUE
               '35107372235352095622613532084140035420841400'.
           03                          PIC X(44)   VALUE
               '35520841400356135693253571356932535813569325'.
           03                          PIC X(44)   VALUE
               '35913569325360135693253610496418536204964185'.
           03                          PIC X(44)   VALUE
               '36304964185364049641853652084140036608139231'.
           03                          PIC X(44)   VALUE
               '36704964185368069631933690956226137009562261'.
           03                          PIC X(44)   VALUE
               '37104964185372049641853730496418537404964185'.
           03                          PIC X(44)   VALUE
               '37504964185376049641853770496418537809562261'.
           03                          PIC X(44)   VALUE
               '37904964185380049641853810496418538204964185'.
           03                          PIC X(44)   VALUE
               '38304964185384049641853850496418538604964185'.
           03                          PIC X(44)   VALUE
               '38704964185388049641853890496418539004964185'.
           03                          PIC X(44)   VALUE
               '39104964185392073722353930737223539409562261'.
           03                          PIC X(44)   VALUE
               '39507782240396049641853970945423539808372220'.
           03                          PIC X(44)   VALUE
               '39904964185401208414004020956226140308941224'.
           03                          PIC X(44)   VALUE
               '40407394180405073722354062084140040709562261'.
           03                          PIC X(44)   VALUE
               '40809562261409088712514100956226141104964185'.
           03                          PIC X(44)   VALUE
               '41204964185413095412554140496418541516849401'.
           03                          PIC X(44)   VALUE
               '41609191249417095622614180830425241909562261'.
           03                          PIC X(44)   VALUE
               '42007372235421073722354220737223542309024231'.
           03                          PIC X(44)   VALUE
               '42413569325425059812754260466022342713569325'.
           03                          PIC X(44)   VALUE
               '42804964185429064382744300468922743104964185'.
           03                          PIC X(44)   VALUE
               '43204964185433049641854391366340544015854400'.
           03                          PIC X(44)   VALUE
               '44120841400442149714464431356932544409609306'.
           03                          PIC X(44)   VALUE
               '44507552266446073722354470956226144807372235'.
           03                          PIC X(44)   VALUE
               '44909562261450095622614510737223545209692249'.
           03                          PIC X(44)   VALUE
               '45308633242454073722354550737223546113216365'.
           03                          PIC X(44)   VALUE
               '46206471232463075412684640617025546507372235'.
           03                          PIC X(44)   VALUE
               '46607365220467049641854682068642547120841400'.
           03                          PIC X(44)   VALUE
               '47309562261475213583524761003231947718998400'.
           03                          PIC X(44)   VALUE
               '47812567342479125673424810956226148220841400'.
           03                          PIC X(44)   VALUE
               '48332131557484208414004851356932548613569325'.
           03                          PIC X(44)   VALUE
               '48712484327488208414004890925421349007361196'.
           03                          PIC X(44)   VALUE
               '49113569325492095622614931356932549420841400'.
           03                          PIC X(44)   VALUE
               '49613569325497095622614980956226149920841400'.
           03                          PIC X(44)   VALUE
               '50013569325501208414005020737223550309562261'.
           03                          PIC X(44)   VALUE
               '50420841400505135693255060737223550707372235'.
           03                          PIC X(44)   VALUE
               '50807372235509073722355100737223551104964185'.
           03                          PIC X(44)   VALUE
               '51520841400516095622615171356932551809562261'.
           03                          PIC X(44)   VALUE
               '51913569325520095622615210475320552204061204'.
           03                          PIC X(44)   VALUE
               '52304214198524058852295252084140052613569325'.
           03                          PIC X(44)   VALUE
               '52713569325528208414005290737223553007372235'.
           03                          PIC X(44)   VALUE
               '53113569325532095622615332084140053413569325'.
           03                          PIC X(44)   VALUE
               '53520841400536208414005371356932553804964185'.
           03                          PIC X(22)   VALUE
               '5392084140054004964185'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 510 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
