       01  W-DRG-FILLS.
           03                          PIC X(44)   VALUE
               '00337112584004282034460111732837201206090191'.
           03                          PIC X(44)   VALUE
               '01306090191014107722630161077226301710772263'.
           03                          PIC X(44)   VALUE
               '02008806235021060901910220454515402317328372'.
           03                          PIC X(44)   VALUE
               '02417328372025173283720261077226302704545154'.
           03                          PIC X(44)   VALUE
               '02817328372029107722630300806122303117328372'.
           03                          PIC X(44)   VALUE
               '03217328372033080612230341591837903515918379'.
           03                          PIC X(44)   VALUE
               '03615918379037107722630381077226303910772263'.
           03                          PIC X(44)   VALUE
               '04013817345041080612230420609019105210022301'.
           03                          PIC X(44)   VALUE
               '05306090191054080612230550609019105608841249'.
           03                          PIC X(44)   VALUE
               '05706552220058080612230590806122306006090191'.
           03                          PIC X(44)   VALUE
               '06108826223062072952090630454515406408806235'.
           03                          PIC X(44)   VALUE
               '06506090191066060901910671732837206804545154'.
           03                          PIC X(44)   VALUE
               '06904545154070088262230710729520907204545154'.
           03                          PIC X(44)   VALUE
               '07310227252074080612230750609019107606090191'.
           03                          PIC X(44)   VALUE
               '07706090191078060901910790609019108008061223'.
           03                          PIC X(44)   VALUE
               '08104545154082089282710830710221708404545154'.
           03                          PIC X(44)   VALUE
               '08510170283086060901910870454515408806090191'.
           03                          PIC X(44)   VALUE
               '08906090191090045451540910859024309207555225'.
           03                          PIC X(44)   VALUE
               '09304545154094103492620950839722909606090191'.
           03                          PIC X(44)   VALUE
               '09709301209098093012090990454515410007545215'.
           03                          PIC X(44)   VALUE
               '10107545215102080612231030454515411306090191'.
           03                          PIC X(44)   VALUE
               '11406090191115107722631161077226311706090191'.
           03                          PIC X(44)   VALUE
               '12117328372122060901911230609019112406090191'.
           03                          PIC X(44)   VALUE
               '12506090191129107722631300609019113110772263'.
           03                          PIC X(44)   VALUE
               '13206090191133107722631340609019113506090191'.
           03                          PIC X(44)   VALUE
               '13606090191137060901911380609019113910772263'.
           03                          PIC X(44)   VALUE
               '14610772263147060901911480454515414908061223'.
           03                          PIC X(44)   VALUE
               '15008061223151080612231520806122315308061223'.
           03                          PIC X(44)   VALUE
               '15411743279155060901911560454515415708061223'.
           03                          PIC X(44)   VALUE
               '15808061223159060901911632286739916408061223'.
           03                          PIC X(44)   VALUE
               '16508061223166247164151671600631616804545154'.
           03                          PIC X(44)   VALUE
               '17507783211176060901911770840621717806437186'.
           03                          PIC X(44)   VALUE
               '17906090191180078831761810454515418204545154'.
           03                          PIC X(44)   VALUE
               '18310772263184107722631850454515418607555201'.
           03                          PIC X(44)   VALUE
               '18706090191188060901911890958821319007445189'.
           03                          PIC X(44)   VALUE
               '19105534152192055341521930756319619405439164'.
           03                          PIC X(44)   VALUE
               '19504545154196055321621970553216219804545154'.
           03                          PIC X(44)   VALUE
               '19907436199200045451542010454515420206287172'.
           03                          PIC X(44)   VALUE
               '20306287172204080612232050946823420608061223'.
           03                          PIC X(44)   VALUE
               '20718412318208111342212151480530821614805308'.
           03                          PIC X(44)   VALUE
               '21714805308218148053082191480530822014805308'.
           03                          PIC X(44)   VALUE
               '22114805308222173283722231077226322417328372'.
           03                          PIC X(44)   VALUE
               '22510772263226173283722271077226322810772263'.
           03                          PIC X(44)   VALUE
               '22910772263231148053082321208030123314805308'.
           03                          PIC X(44)   VALUE
               '23412080301235148053082361208030123915918379'.
           03                          PIC X(44)   VALUE
               '24008061223241080612232421732837224317328372'.
           03                          PIC X(44)   VALUE
               '24408061223245107722632461077226324710772263'.
           03                          PIC X(44)   VALUE
               '24810772263249080612232501732837225108061223'.
           03                          PIC X(44)   VALUE
               '25214805308253148053082541480530825517328372'.
           03                          PIC X(44)   VALUE
               '25608061223257080612232581480530825914805308'.
           03                          PIC X(44)   VALUE
               '26017328372261148053082621480530826311531277'.
           03                          PIC X(44)   VALUE
               '26412080301265148053082661480530826714805308'.
           03                          PIC X(44)   VALUE
               '26814805308269120803012701732837227108061223'.
           03                          PIC X(44)   VALUE
               '27208061223273107722632741077226328008260218'.
           03                          PIC X(44)   VALUE
               '28105729193282045451542830973917928406090191'.
           03                          PIC X(44)   VALUE
               '28506090191286107722632870806122328810879264'.
           03                          PIC X(44)   VALUE
               '28908048236290080482362910848821229206915199'.
           03                          PIC X(44)   VALUE
               '29306915199294080612232950806122329606915199'.
           03                          PIC X(44)   VALUE
               '29706915199298069151992990857621730005657185'.
           03                          PIC X(44)   VALUE
               '30104545154302087302213030609019130406090191'.
           03                          PIC X(44)   VALUE
               '30506090191306090292203070609019130808009217'.
           03                          PIC X(44)   VALUE
               '30906090191310045451543110609019131208061223'.
           03                          PIC X(44)   VALUE
               '31306090191314103952433150733320531604545154'.
           03                          PIC X(44)   VALUE
               '32617328372327107722633280609019132917328372'.
           03                          PIC X(44)   VALUE
               '33017328372331060901913321732837233306274190'.
           03                          PIC X(44)   VALUE
               '33406090191335097072403360627419033706090191'.
           03                          PIC X(44)   VALUE
               '33809707240339062741903400609019134106090191'.
           03                          PIC X(44)   VALUE
               '34204545154343045451543441077226334506274190'.
           03                          PIC X(44)   VALUE
               '34606090191347173283723480627419034906090191'.
           03                          PIC X(44)   VALUE
               '35009707240351062741903520609019135309707240'.
           03                          PIC X(44)   VALUE
               '35406274190355060901913561538034235710772263'.
           03                          PIC X(44)   VALUE
               '35808061223368080612233690609019137006090191'.
           03                          PIC X(44)   VALUE
               '37109707240372062741903730609019137408825246'.
           03                          PIC X(44)   VALUE
               '37506090191376060901913770692719137806927191'.
           03                          PIC X(44)   VALUE
               '37904545154380095512403810609019138206090191'.
           03                          PIC X(44)   VALUE
               '38310772263384060901913851077226338604545154'.
           03                          PIC X(44)   VALUE
               '38704545154388096272403890609019139004545154'.
           03                          PIC X(44)   VALUE
               '39109025229392065792003931059925339407881218'.
           03                          PIC X(44)   VALUE
               '39506090191405173283724060692719140704545154'.
           03                          PIC X(44)   VALUE
               '40806927191409069271914100454515441106927191'.
           03                          PIC X(44)   VALUE
               '41206927191413045451544140609019141504545154'.
           03                          PIC X(44)   VALUE
               '41604545154417173283724180609019141904545154'.
           03                          PIC X(44)   VALUE
               '42010772263421107722634220454515442317328372'.
           03                          PIC X(44)   VALUE
               '42404545154425045451544320998222743306090191'.
           03                          PIC X(44)   VALUE
               '43404545154435107722634360609019143704545154'.
           03                          PIC X(44)   VALUE
               '43809962227439069432004400454515444108316207'.
           03                          PIC X(44)   VALUE
               '44206179200443045451544440755320844506474201'.
           03                          PIC X(44)   VALUE
               '44606090191453093102414540694620845504545154'.
           03                          PIC X(44)   VALUE
               '45610772263457069462084580454515445909310241'.
           03                          PIC X(44)   VALUE
               '46006946208461093102414620694620846315804393'.
           03                          PIC X(44)   VALUE
               '46411040326465107722634661732837246710772263'.
           03                          PIC X(44)   VALUE
               '46810772263469178404394701077226347109310241'.
           03                          PIC X(44)   VALUE
               '47206946208473045451544741784043947510772263'.
           03                          PIC X(44)   VALUE
               '47610772263477173283724781077226347904545154'.
           03                          PIC X(44)   VALUE
               '48017328372481173283724820454515448317328372'.
           03                          PIC X(44)   VALUE
               '48508061223486045451544870454515448804545154'.
           03                          PIC X(44)   VALUE
               '48904545154492173283724931077226349404545154'.
           03                          PIC X(44)   VALUE
               '49517328372496045451544970454515449817328372'.
           03                          PIC X(44)   VALUE
               '49904545154500153413585010806122350208061223'.
           03                          PIC X(44)   VALUE
               '50310772263504045451545050454515450617328372'.
           03                          PIC X(44)   VALUE
               '50717328372508045451545090454515451004545154'.
           03                          PIC X(44)   VALUE
               '51104545154512045451545131732837251404545154'.
           03                          PIC X(44)   VALUE
               '51515259345516045451545170454515451817328372'.
           03                          PIC X(44)   VALUE
               '51906946208520045451545330454515453404545154'.
           03                          PIC X(44)   VALUE
               '53510772263536060901915370454515453804545154'.
           03                          PIC X(44)   VALUE
               '53911007291540082872565410806122354208061223'.
           03                          PIC X(44)   VALUE
               '54304545154544045451545451077226354604545154'.
           03                          PIC X(44)   VALUE
               '54704545154548107462655490806122355004545154'.
           03                          PIC X(44)   VALUE
               '55110870281552060901915531077226355404545154'.
           03                          PIC X(44)   VALUE
               '55506090191556060901915570944825855807940240'.
           03                          PIC X(44)   VALUE
               '55908971242560071532345610715323456210772263'.
           03                          PIC X(44)   VALUE
               '56306090191564093102415650694620856604545154'.
           03                          PIC X(44)   VALUE
               '57014196353571099243115720992431157316854451'.
           03                          PIC X(44)   VALUE
               '57414366410575060901915761732837257710772263'.
           03                          PIC X(44)   VALUE
               '57806090191579124733075801117631858106090191'.
           03                          PIC X(44)   VALUE
               '58209924311583060901915840992431158506090191'.
           03                          PIC X(44)   VALUE
               '59209504250593073962435940609019159508061223'.
           03                          PIC X(44)   VALUE
               '59604545154597060901915980609019159904545154'.
           03                          PIC X(44)   VALUE
               '60008061223601045451546020799522360305315181'.
           03                          PIC X(44)   VALUE
               '60408904251605080612236061202124960706090191'.
           03                          PIC X(44)   VALUE
               '61408061223615045451546161420835061714208350'.
           03                          PIC X(44)   VALUE
               '61810772263619153803426201077226362108061223'.
           03                          PIC X(44)   VALUE
               '62215330339623105962906240609019162517169351'.
           03                          PIC X(44)   VALUE
               '62610772263627060901916281716935162910772263'.
           03                          PIC X(44)   VALUE
               '63006090191637103132626380819823863904545154'.
           03                          PIC X(44)   VALUE
               '64009733239641067311966421077226364308061223'.
           03                          PIC X(44)   VALUE
               '64408061223645045451546531732837265410772263'.
           03                          PIC X(44)   VALUE
               '65508061223656107722636570806122365808061223'.
           03                          PIC X(44)   VALUE
               '65910772263660107722636610806122366210772263'.
           03                          PIC X(44)   VALUE
               '66308061223664080612236651077226366610772263'.
           03                          PIC X(44)   VALUE
               '66708061223668173283726691732837267007200203'.
           03                          PIC X(44)   VALUE
               '67107200203672072002036731498733067414987330'.
           03                          PIC X(44)   VALUE
               '67507200203682095422326830720020368407200203'.
           03                          PIC X(44)   VALUE
               '68617328372687107722636880685420968906954206'.
           03                          PIC X(44)   VALUE
               '69004969173691060901916920454515469304545154'.
           03                          PIC X(44)   VALUE
               '69404545154695045451546960454515469708947226'.
           03                          PIC X(44)   VALUE
               '69808947226699068542097000685420970714987330'.
           03                          PIC X(44)   VALUE
               '70814987330709107722637100685420971110772263'.
           03                          PIC X(44)   VALUE
               '71207200203713173283727141732837271507200203'.
           03                          PIC X(44)   VALUE
               '71607200203717113552877180720020372208061223'.
           03                          PIC X(44)   VALUE
               '72308061223724045451547250454515472604545154'.
           03                          PIC X(44)   VALUE
               '72707366228728055112037291077226373007200203'.
           03                          PIC X(44)   VALUE
               '73410772263735107722637361077226373710772263'.
           03                          PIC X(44)   VALUE
               '73810772263739171693517401077226374106090191'.
           03                          PIC X(44)   VALUE
               '74210772263743107722637440454515474504545154'.
           03                          PIC X(44)   VALUE
               '74610772263747107722637481077226374910772263'.
           03                          PIC X(44)   VALUE
               '75007200203754045451547550454515475604545154'.
           03                          PIC X(44)   VALUE
               '75709026252758080612237590609019176008061223'.
           03                          PIC X(44)   VALUE
               '76107200203768060901917690609019177006090191'.
           03                          PIC X(44)   VALUE
               '77606090191779060901917831077226378410772263'.
           03                          PIC X(44)   VALUE
               '78510772263786107722637871077226378810772263'.
           03                          PIC X(44)   VALUE
               '78906090191790060901917910609019179206090191'.
           03                          PIC X(44)   VALUE
               '79306090191794060901917950609019179606090191'.
           03                          PIC X(44)   VALUE
               '79706090191798060901917991538034280010772263'.
           03                          PIC X(44)   VALUE
               '80110772263802173283728030454515480404545154'.
           03                          PIC X(44)   VALUE
               '80504545154806045451548070454515480817328372'.
           03                          PIC X(44)   VALUE
               '80904545154810045451548111077226381210772263'.
           03                          PIC X(44)   VALUE
               '81308061223814060901918150609019181604545154'.
           03                          PIC X(44)   VALUE
               '81706090191818060901918190609019182017328372'.
           03                          PIC X(44)   VALUE
               '82117328372822173283728231732837282411040326'.
           03                          PIC X(44)   VALUE
               '82510772263826173283728271732837282817328372'.
           03                          PIC X(44)   VALUE
               '82917328372830173283728310609019183206090191'.
           03                          PIC X(44)   VALUE
               '83306090191834060901918350609019183606090191'.
           03                          PIC X(44)   VALUE
               '83706090191838060901918390609019184010772263'.
           03                          PIC X(44)   VALUE
               '84108061223842080612238430806122384408061223'.
           03                          PIC X(44)   VALUE
               '84508061223846107722638470609019184806090191'.
           03                          PIC X(44)   VALUE
               '84908061223853182843658540844921985508449219'.
           03                          PIC X(44)   VALUE
               '85614949338857098512658580985126586210186255'.
           03                          PIC X(44)   VALUE
               '86307421225864080612238651077226386604545154'.
           03                          PIC X(44)   VALUE
               '86710761239868080612238690454515487019597299'.
           03                          PIC X(44)   VALUE
               '87109185226872061721858760788122988004959177'.
           03                          PIC X(44)   VALUE
               '88106214203882062142038830621420388405152245'.
           03                          PIC X(44)   VALUE
               '88504901231886049591778870495917789404959177'.
           03                          PIC X(44)   VALUE
               '89504670254896078812298970621420390114732344'.
           03                          PIC X(44)   VALUE
               '90210258270903045451549041732837290509924311'.
           03                          PIC X(44)   VALUE
               '90614466339907144663399080806122390904545154'.
           03                          PIC X(44)   VALUE
               '91317328372914045451549150609019191604545154'.
           03                          PIC X(44)   VALUE
               '91706090191918060901919191149826892008375241'.
           03                          PIC X(44)   VALUE
               '92104545154922173283729231077226392717328372'.
           03                          PIC X(44)   VALUE
               '92817328372929173283729331077226393410772263'.
           03                          PIC X(44)   VALUE
               '93508061223939136903249401006829294104545154'.
           03                          PIC X(44)   VALUE
               '94506621205946040631639470951819894808061223'.
           03                          PIC X(44)   VALUE
               '94907419217950040541479510454515495508061223'.
           03                          PIC X(44)   VALUE
               '95604545154957173283729581077226395908061223'.
           03                          PIC X(44)   VALUE
               '96310772263964080612239650806122396917328372'.
           03                          PIC X(44)   VALUE
               '97017328372974101092249751010922497610109224'.
           03                          PIC X(44)   VALUE
               '97708061223981221704009821357432498306090191'.
           03                          PIC X(33)   VALUE
               '987188653799881732837298904545154'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 751 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
