       01  W-DRG-FILLS.
           03                          PIC X(44)   VALUE
               '00116835371002168353710031683537100604175170'.
           03                          PIC X(44)   VALUE
               '00712052361008055942100091042434001006971221'.
           03                          PIC X(44)   VALUE
               '01105594210012067882510130600323101406772249'.
           03                          PIC X(44)   VALUE
               '01507705261016069782310170559421001807503254'.
           03                          PIC X(44)   VALUE
               '01904512195021078192390220781923902310118294'.
           03                          PIC X(44)   VALUE
               '02605594210027099783060280798325802904175170'.
           03                          PIC X(44)   VALUE
               '03004175170031041751700320417517003304175170'.
           03                          PIC X(44)   VALUE
               '03407029234035050802110360559421003705594210'.
           03                          PIC X(44)   VALUE
               '03805594210039055942100400559421004105594210'.
           03                          PIC X(44)   VALUE
               '04205594210043041751700440781923904504175170'.
           03                          PIC X(44)   VALUE
               '04605594210047041751700480417517004911625295'.
           03                          PIC X(44)   VALUE
               '05011625295051116252950521162529505311625295'.
           03                          PIC X(44)   VALUE
               '05411625295055116252950561162529505704175170'.
           03                          PIC X(44)   VALUE
               '05804175170059041751700600417517006104175170'.
           03                          PIC X(44)   VALUE
               '06204175170063116252950641179726206504175170'.
           03                          PIC X(44)   VALUE
               '06604175170067078192390680621120306904175170'.
           03                          PIC X(44)   VALUE
               '07004175170071055942100720781923907307745229'.
           03                          PIC X(44)   VALUE
               '07404175170075199443350762398242507705594210'.
           03                          PIC X(44)   VALUE
               '07806746226079081822280800648520908104175170'.
           03                          PIC X(44)   VALUE
               '08208242214083041751700840417517008506956214'.
           03                          PIC X(44)   VALUE
               '08604175170087102952480880641119308906802206'.
           03                          PIC X(44)   VALUE
               '09004958178091055942100920663819609304175170'.
           03                          PIC X(44)   VALUE
               '09406785213095067852130960623018909706230189'.
           03                          PIC X(44)   VALUE
               '09805594210099093812461000781923910108147222'.
           03                          PIC X(44)   VALUE
               '10204175170104116252951051162529510611625295'.
           03                          PIC X(44)   VALUE
               '10811625295110116252951111162529511313942361'.
           03                          PIC X(44)   VALUE
               '11412425330117055942101180781923911907819239'.
           03                          PIC X(44)   VALUE
               '12010893314121074512241220559421012307858170'.
           03                          PIC X(44)   VALUE
               '12411625295125041751701260886726312706832212'.
           03                          PIC X(44)   VALUE
               '12805594210129041751701300648422813105267210'.
           03                          PIC X(44)   VALUE
               '13206621207133055942101340490921713508014238'.
           03                          PIC X(44)   VALUE
               '13604175170137041751701380661821913905594210'.
           03                          PIC X(44)   VALUE
               '14004175170141058912211420589122114304175170'.
           03                          PIC X(44)   VALUE
               '14407715221145042921701461683537114707819239'.
           03                          PIC X(44)   VALUE
               '14907819239150168353711510417517015216835371'.
           03                          PIC X(44)   VALUE
               '15316835371155168353711561683537115707819239'.
           03                          PIC X(44)   VALUE
               '15807819239159168353711600417517016104175170'.
           03                          PIC X(44)   VALUE
               '16204175170163041751701640781923916507819239'.
           03                          PIC X(44)   VALUE
               '16607819239167078192391681683537116905594210'.
           03                          PIC X(44)   VALUE
               '17016163358171078192391720849721817305594210'.
           03                          PIC X(44)   VALUE
               '17407149229175055942101760951424817705594210'.
           03                          PIC X(44)   VALUE
               '17804175170179081572331800912622818104175170'.
           03                          PIC X(44)   VALUE
               '18207866218183041751701840417517018506634232'.
           03                          PIC X(44)   VALUE
               '18605594210187055942101880959624418905594210'.
           03                          PIC X(44)   VALUE
               '19005594210191168353711921683537119311625295'.
           03                          PIC X(44)   VALUE
               '19411625295195168353711961162529519711625295'.
           03                          PIC X(44)   VALUE
               '19811625295199078192392001683537120115802288'.
           03                          PIC X(44)   VALUE
               '20206011202203074661962040885322120506933231'.
           03                          PIC X(44)   VALUE
               '20606933231207072952152080417517021014826419'.
           03                          PIC X(44)   VALUE
               '21116835371212168353712131187133521612147376'.
           03                          PIC X(44)   VALUE
               '21712414365218168353712191683537122016835371'.
           03                          PIC X(44)   VALUE
               '22311625295224041751702250955030622610626343'.
           03                          PIC X(44)   VALUE
               '22707819239228078192392290417517023016835371'.
           03                          PIC X(44)   VALUE
               '23216835371233117243242340417517023507819239'.
           03                          PIC X(44)   VALUE
               '23606802289237041751702380858928423906031206'.
           03                          PIC X(44)   VALUE
               '24007134224241041751702420770026224306028223'.
           03                          PIC X(44)   VALUE
               '24405516220245044631942460559421024704582176'.
           03                          PIC X(44)   VALUE
               '24807328232249063702402500417517025104175170'.
           03                          PIC X(44)   VALUE
               '25205594210253056092402540417517025505594210'.
           03                          PIC X(44)   VALUE
               '25607132236257168353712580781923925907819239'.
           03                          PIC X(44)   VALUE
               '26007819239261055942102621162529526312748380'.
           03                          PIC X(44)   VALUE
               '26408507299265110193022660781923926707819239'.
           03                          PIC X(44)   VALUE
               '26811625295269120753472700781923927108269269'.
           03                          PIC X(44)   VALUE
               '27206584230273041751702740723121827507819239'.
           03                          PIC X(44)   VALUE
               '27605594210277060892092780425418027904175170'.
           03                          PIC X(44)   VALUE
               '28007148241281055942102820559421028306876231'.
           03                          PIC X(44)   VALUE
               '28405594210285124183162861162529528710402330'.
           03                          PIC X(44)   VALUE
               '28811625295289116252952901162529529111625295'.
           03                          PIC X(44)   VALUE
               '29211549320293115493202940695823929505594210'.
           03                          PIC X(44)   VALUE
               '29607092223297045961932980417517029907819239'.
           03                          PIC X(44)   VALUE
               '30007004237301055942103030781923930411625295'.
           03                          PIC X(44)   VALUE
               '30507819239306116252953071162529530811625295'.
           03                          PIC X(44)   VALUE
               '30911625295310116252953111162529531207819239'.
           03                          PIC X(44)   VALUE
               '31307819239314078192393151401633931608321229'.
           03                          PIC X(44)   VALUE
               '31709102244318075652103190781923932006200217'.
           03                          PIC X(44)   VALUE
               '32104450185322041751703230417517032404175170'.
           03                          PIC X(44)   VALUE
               '32505594210326041751703270417517032805594210'.
           03                          PIC X(44)   VALUE
               '32905594210330055942103310777322533204175170'.
           03                          PIC X(44)   VALUE
               '33304175170334041751703350417517033611625295'.
           03                          PIC X(44)   VALUE
               '33711625295338078192393390781923934007819239'.
           03                          PIC X(44)   VALUE
               '34116835371342078192393430781923934407819239'.
           03                          PIC X(44)   VALUE
               '34511625295346078192393470417517034805594210'.
           03                          PIC X(44)   VALUE
               '34907819239350056062103510781923935208209275'.
           03                          PIC X(44)   VALUE
               '35311625295354116252953551162529535611625295'.
           03                          PIC X(44)   VALUE
               '35711625295358116252953591162529536011625295'.
           03                          PIC X(44)   VALUE
               '36104175170362041751703630417517036404175170'.
           03                          PIC X(44)   VALUE
               '36511625295366091062163670417517036807846213'.
           03                          PIC X(44)   VALUE
               '36907819239370041751703710417517037204175170'.
           03                          PIC X(44)   VALUE
               '37304175170374041751703750417517037611625295'.
           03                          PIC X(44)   VALUE
               '37704175170378041751703790417517038004175170'.
           03                          PIC X(44)   VALUE
               '38104175170382041751703830417517038404175170'.
           03                          PIC X(44)   VALUE
               '38504175170386041751703870417517038804175170'.
           03                          PIC X(44)   VALUE
               '38904175170390041751703910417517039211625295'.
           03                          PIC X(44)   VALUE
               '39311625295394116252953950665121939604175170'.
           03                          PIC X(44)   VALUE
               '39708276204398062782083990417517040111625295'.
           03                          PIC X(44)   VALUE
               '40205594210403088462394040781923940507819239'.
           03                          PIC X(44)   VALUE
               '40616835371407116252954081162529540908416232'.
           03                          PIC X(44)   VALUE
               '41012527287411055942104120559421041308429214'.
           03                          PIC X(44)   VALUE
               '41407819239417078192394180796124141905594210'.
           03                          PIC X(44)   VALUE
               '42005594210421070652044220417517042310426232'.
           03                          PIC X(44)   VALUE
               '42416835371425041751704260403822542705594210'.
           03                          PIC X(44)   VALUE
               '42805183245429053262404300402423143105594210'.
           03                          PIC X(44)   VALUE
               '43204175170433041751704391220336044012248344'.
           03                          PIC X(44)   VALUE
               '44105594210442136703494430559421044406598232'.
           03                          PIC X(44)   VALUE
               '44505594210446055942104470559421044805594210'.
           03                          PIC X(44)   VALUE
               '44907819239450055942104510781923945209275257'.
           03                          PIC X(44)   VALUE
               '45305790216454078192394550781923946111466327'.
           03                          PIC X(44)   VALUE
               '46205823221463060822294640583124346506877212'.
           03                          PIC X(44)   VALUE
               '46606700217467078192394682147840547116835371'.
           03                          PIC X(44)   VALUE
               '47309917253476168353714771511935947905594210'.
           03                          PIC X(44)   VALUE
               '48111625295482168353714841683537148511625295'.
           03                          PIC X(44)   VALUE
               '48607819239487116252954881162529548909436221'.
           03                          PIC X(44)   VALUE
               '49006456203491168353714920559421049311625295'.
           03                          PIC X(44)   VALUE
               '49411625295496116252954971683537149816835371'.
           03                          PIC X(44)   VALUE
               '49916835371500116252955011216433350207819239'.
           03                          PIC X(44)   VALUE
               '50311625295504168353715051683537150611625295'.
           03                          PIC X(44)   VALUE
               '50704175170508075882565090417517051006720226'.
           03                          PIC X(44)   VALUE
               '51104175170515116252955180417517051911625295'.
           03                          PIC X(44)   VALUE
               '52016835371521055942105220559421052304175170'.
           03                          PIC X(44)   VALUE
               '52405594210525168353715281683537152916835371'.
           03                          PIC X(44)   VALUE
               '53016835371531168353715320781923953311625295'.
           03                          PIC X(44)   VALUE
               '53411625295535168353715361162529553714672399'.
           03                          PIC X(44)   VALUE
               '53811625295539116252955400417517054138893581'.
           03                          PIC X(44)   VALUE
               '54228689451543168353715441683537154516835371'.
           03                          PIC X(44)   VALUE
               '54616835371547116252955481162529554911625295'.
           03                          PIC X(44)   VALUE
               '55011625295551160352955521162529555315837325'.
           03                          PIC X(44)   VALUE
               '55412817316555078192395560417517055711625295'.
           03                          PIC X(44)   VALUE
               '55804175170559078192395600930825556108145223'.
           03                          PIC X(44)   VALUE
               '56206844232563055942105640756524156520557347'.
           03                          PIC X(44)   VALUE
               '56615445274567168353715681683537156916835371'.
           03                          PIC X(44)   VALUE
               '57016835371571082142195720850523357316835371'.
           03                          PIC X(44)   VALUE
               '57408106197575165832785760792523057711625295'.
           03                          PIC X(22)   VALUE
               '5781484935757912978352'.
       01  W-DRG-TABLE REDEFINES W-DRG-FILLS.
           03  WWM-ENTRY OCCURS 530 TIMES
                   ASCENDING KEY IS WWM-DRG
                   INDEXED BY WWM-INDX.
               05  WWM-DRG             PIC X(3).
               05  WWM-RELWT           PIC 9(1)V9(4).
               05  WWM-ALOS            PIC 9(2)V9(1).
